[{
  "id": "BSN_solios_ev-cl",
  "version": "2024020714",
  "title": "Matrox Solios eV-CL",
  "subTitles": null,
  "location": "MIL Hardware-specific Notes",
  "pageURL": "content\\BoardSpecificNotes\\solios_ev-cl\\ChapterInformation.htm",
  "text": " Matrox Solios eV-CL This section discusses features of MIL that are particular to Matrox Solios eV-CL and ways that optimize the board's performance. Matrox Solios eV-CL information regarding specific functions is integrated into the functions' reference topics. Refer to the Matrox Solios eV-CL release notes for any additions/modifications to this chapter or the MIL Reference. Matrox Solios eV-CL overview Summary of Matrox Solios eV features Note on nomenclature Using Matrox Solios eV-CL with MIL Changing the mode of your Matrox Solios eV-CL Performing Bayer color conversion in hardware Allocating independent MIL digitizers on Matrox Solios eV-CL Matrox Solios eV-CLB and eV-CLBL Matrox Solios eV-CLF and eV-CLFL Minimum latency and grabbing all frames Detecting missed frames Quickly copying an on-board buffer to a Host destination buffer Quickly converting buffer formats while copying COM ports and UARTS Matrox Solios eV-CL tools Matrox Camera-Link configuration utility Matrox Processing FPGA utility Matrox Solios eV-CLBL and eV-CLFL connectors and signal names Board connectors Signal names and their matching MIL constants Matrox Solios eV-CLB and eV-CLF connectors and signal names Board connectors Signal names and their matching MIL constants Matrox Solios eV-CL board flow diagrams Matrox Solios eV-CLB and eV-CLBL Matrox Solios eV-CLF ",
  "wordCount": 199,
  "subEntries": [
    {
      "id": "BSN_solios_ev-cl_Matrox_Solios_eV-CL_specific_features",
      "version": null,
      "title": "Matrox Solios eV-CL overview",
      "subTitles": [
        "Summary of Matrox Solios eV features",
        "Note on nomenclature"
      ],
      "location": "MIL Hardware-specific Notes",
      "pageURL": "content\\BoardSpecificNotes\\solios_ev-cl\\Matrox_Solios_eV-CL_specific_features.htm",
      "text": " Matrox Solios eV-CL overview The Matrox Solios eV-CL family consists of four members: two PCIe dual-Base/single-Medium frame grabbers and two PCIe single-Medium/single-Full frame grabbers. The PCIe dual-Base/single-Medium frame grabbers are Matrox Solios eV-CLB and Matrox Solios eV-CLBL; these only differ by their I/O connectors. The PCIe single-Medium/single-Full frame grabbers are Matrox Solios eV-CLF and eV-CLFL; similarly, these frame grabbers only differ by their I/O connectors. Matrox Solios eV-CL supports area and line-scan monochrome and color video sources. The color video sources can be RGB video sources or video sources with a Bayer color filter. Matrox Solios eV-CLB and eV-CLBL can decode the color information of Bayer color-encoded images; whereas, Matrox Solios eV-CLF and eV-CLFL can only transfer the images to the Host computer (Host) for decoding. Matrox Solios eV-CL also supports video sources that do not follow the Camera Link standard (for example in dual-Base mode, four tap 14/16-bit with time-multiplexing), but use a Camera Link connection. Summary of Matrox Solios eV features The following table outlines the features currently available for each member of the Matrox Solios family. Matrox Solios eV-CLB eV-CLBL eV-CLF eV-CLFL Can access GenICam camera features using MdigControlFeature() / MdigInquireFeature() 1 Yes Yes Yes Yes On-board memory 128/256/512 Mbytes 128/256/512 Mbytes 128/256/512 Mbytes 128/256/512 Mbytes Digitizer LUT 2 Yes Yes Yes Yes Number of acquisition paths 2 (if in dual-Base mode) or 1 (if in single-Medium mode) 2 (if in dual-Base mode) or 1 (if in single-Medium mode) 1 1 Number of trigger controllers 4/digitizer 4/digitizer 4/digitizer 4/digitizer Asynchronous camera reset Yes Yes Yes Yes Number of timers 4/digitizer 4/digitizer 4/digitizer 4/digitizer Number of UARTS 1/digitizer 1/digitizer 1/digitizer 1/digitizer Number of auxiliary signals 3 22 24 22 24 Number of rotary decoders 1 1 1 1 1 Only if the camera supports GenICam. For more information, refer to the Using GenICam with Camera Link cameras subsection of the Using MIL with GenICam section of Chapter 27: Grabbing with your digitizer. 2 Digitizer LUTs are not supported when using a 10-tap video source. 3 Some of these auxiliary signals are only available when using the optional cable adapter bracket. Also included are the standard camera control signals available on the Camera Link connector(s). For more information, refer to the Matrox Solios eV-CL xxx connectors and signal names, later in this chapter. Note on nomenclature This manual refers to all Matrox Solios eV-CL boards as Matrox Solios eV-CL. When necessary, this manual distinguishes between the boards using their full names. Matrox Solios eV-CL overview Summary of Matrox Solios eV features Note on nomenclature ",
      "wordCount": 427,
      "subEntries": []
    },
    {
      "id": "BSN_solios_ev-cl_Using_Matrox_Solios_eV-CL_with_MIL",
      "version": null,
      "title": "Using Matrox Solios eV-CL with MIL",
      "subTitles": [
        "Changing the mode of your Matrox Solios eV-CL",
        "Performing Bayer color conversion in hardware"
      ],
      "location": "MIL Hardware-specific Notes",
      "pageURL": "content\\BoardSpecificNotes\\solios_ev-cl\\Using_Matrox_Solios_eV-CL_with_MIL.htm",
      "text": " Using Matrox Solios eV-CL with MIL To use Matrox Solios eV-CL, you must allocate it as a MIL Solios system (using MsysAlloc(), with M_SYSTEM_SOLIOS). This allocation opens communications with your Matrox Solios eV-CL and allows MIL to use its resources. You can allocate a MIL Solios eV-CL system for your board in multiple processes (executables). If more than one process allocates a digitizer for the same acquisition path, grabs from the different processes will be queued in the order that they arrive (first in, first out). Matrox Solios eV-CL features a rotary decoder that can decode input from a rotary encoder with quadrature output. For more information on this feature, refer to the Using quadrature input from a rotary encoder section of Chapter 56: I/O signals and communicating with external devices. This chapter also provides information on how to configure and use I/O signals. For information on grabbing with your Matrox Solios eV-CL, refer to Chapter 27: Grabbing with your digitizer. For information regarding GenICam standard feature naming convention (SFNC) features, and configuring your Camera Link camera to use GenICam, see the Using MIL with GenICam section of Chapter 27: Grabbing with your digitizer. Matrox Solios eV-CL information in the MIL Reference can be found in the paragraphs and values marked as being supported by Matrox Solios ecl/xcl/ev-cl. Refer to the Matrox Solios eV-CL release notes for any additions/modifications to this chapter or the MIL Reference. Changing the mode of your Matrox Solios eV-CL The mode of Matrox Solios eV-CL dual-Base/single-Medium can be changed using the MILConfig utility (Solios tab) from its factory-default setting to either single-Medium or dual-Base. Follow all on-screen procedures. Once changed, your computer must be shut-down and then turned back on (perform a cold-boot) for changes to take effect. Note that simply restarting your computer (using the Microsoft Windows security Restart option) will not allow the changes to take affect. If you change the mode of Matrox Solios eV-CL dual-Base/single-Medium, make certain that you also choose the appropriate DCF. Using the wrong DCF when performing a digitizer allocation (using MdigAlloc()) will result in an error. Performing Bayer color conversion in hardware When Matrox Solios eV-CL grabs color images from a video source with a Bayer color filter (as specified by the DCF), it performs Bayer color conversion in hardware, as it transfers the images to the Host. If the images require white balancing, Matrox Solios eV-CL can perform this automatically if white balancing is enabled using MdigControl() with M_WHITE_BALANCE set to M_ENABLE. If performing white balancing, you can use the default white balance coefficients, automatically have them calculated (using MdigControl() with M_WHITE_BALANCE set to M_CALCULATE), or set explicit coefficients (M_BAYER_COEFFICIENTS_ID). For information on Bayer color conversion, refer to the Using images acquired with a Bayer color filter section of Chapter 23: Data buffers. If you don't want to perform Bayer color conversion in hardware, disable it using MdigControl() with M_BAYER_CONVERSION set to M_DISABLE. The M_BAYER... control types of MdigControl() can only be used when grabbing from a camera that has a Bayer color filter (as specified by the DCF); otherwise, an error will be generated. Using Matrox Solios eV-CL with MIL Changing the mode of your Matrox Solios eV-CL Performing Bayer color conversion in hardware ",
      "wordCount": 541,
      "subEntries": []
    },
    {
      "id": "BSN_solios_ev-cl_Allocating_independent_MIL_digitizers",
      "version": null,
      "title": "Allocating independent MIL digitizers on Matrox Solios eV-CL",
      "subTitles": [
        "Matrox Solios eV-CLB and eV-CLBL",
        "Matrox Solios eV-CLF and eV-CLFL"
      ],
      "location": "MIL Hardware-specific Notes",
      "pageURL": "content\\BoardSpecificNotes\\solios_ev-cl\\Allocating_independent_MIL_digitizers.htm",
      "text": " Allocating independent MIL digitizers on Matrox Solios eV-CL Depending on the frame grabber and its mode, you can allocate one or two independent MIL digitizers. Independent digitizers have different device numbers and use different acquisition paths. To allocate an independent digitizer, use MdigAlloc(). Matrox Solios eV-CLB and eV-CLBL The number of independent digitizers that you can allocate on Matrox Solios eV-CL is dependent on the configuration in use. There are two configurations of Matrox Solios eV-CLB and eV-CLBL available: single-Medium. The single-Medium version has only one acquisition path (M_DEV0) with only one data channel. dual-Base. The dual-Base version has two acquisition paths (M_DEV0 and M_DEV1) and each only has one data channel. Matrox Solios eV-CLF and eV-CLFL You can allocate one digitizer on Matrox Solios eV-CLF and eV-CLFL. The digitizer has only one acquisition path (M_DEV0) with only one data channel. Allocating independent MIL digitizers on Matrox Solios eV-CL Matrox Solios eV-CLB and eV-CLBL Matrox Solios eV-CLF and eV-CLFL ",
      "wordCount": 161,
      "subEntries": []
    },
    {
      "id": "BSN_solios_ev-cl_Minimum_latency_and_grabbing_all_frames",
      "version": null,
      "title": "Minimum latency and grabbing all frames",
      "subTitles": [
        "Detecting missed frames",
        "Quickly copying an on-board buffer to a Host destination buffer",
        "Quickly converting buffer formats while copying"
      ],
      "location": "MIL Hardware-specific Notes",
      "pageURL": "content\\BoardSpecificNotes\\solios_ev-cl\\Minimum_latency_and_grabbing_all_frames.htm",
      "text": " Minimum latency and grabbing all frames When grabbing with either MdigGrab() or MdigProcess(), Matrox Solios eV-CL is optimized to have the smallest latency possible between the last pixel sent from the camera to the last pixel written into the buffer. This allows the buffer to be available for processing with a minimum amount of delay. On-board memory is used to protect against PCI-X/PCIe latency. By default, Matrox Solios eV-CL grabs into off-board buffers. To perform real-time grabs, your rate of acquisition (grabbing bandwidth) must be lower than the PCI-X/PCIe maximum transfer rate (PCI-X/PCIe bandwidth). If the acquisition rate is higher than the transfer rate across the PCI-X/PCIe bus, frames will be skipped rather than allowing a grab over-run to occur. To determine the image transfer speed from Matrox Solios eV-CL to the Host, use the Matrox Solios eV-CL Bench utility. Detecting missed frames To be certain that no frames were missed when MdigProcess() was last used, use MdigInquire() with M_PROCESS_FRAME_MISSED. This value is based on a comparison between the frame rate (M_PROCESS_FRAME_RATE) and the frame count (M_PROCESS_FRAME_COUNT). If a grab is triggered from a tempermental trigger or if the hooked function is slow, the value returned by M_PROCESS_FRAME_MISSED will be affected. This value is most trustworthy with a camera in continuous mode. You can inquire the frame time-stamp sampled at the frame's end using MdigGetHookInfo() with M_TIME_STAMP. Use M_PROCESS_FRAME_COUNT to determine the total number of frames grabbed in the sequence. Use M_PROCESS_FRAME_RATE to return an estimate of the frame rate in frames per second. Note that this value is determined based on the average of the camera's frame rate, and the total amount of time to process the user-defined hooked function(s). Quickly copying an on-board buffer to a Host destination buffer When copying an on-board buffer into a Host destination buffer, the copy operation should be performed by your Matrox Solios eV-CL using Matrox Solios's eV-CL DMA engine, rather than the Host. Your Matrox Solios eV-CL will perform the operation faster than the Host. To ensure that Matrox Solios eV-CL performs the operation, use the following: To copy an on-board buffer into a destination buffer on the Host, use MbufCopy(). To resize an on-board buffer while copying it to a destination buffer on the Host, use MimResize() with a factor of 1 to 16 and with an interpolation mode of M_NEAREST_NEIGHBOR. Alternatively, you can use MbufTransfer() to perform the same operation. To flip an on-board buffer while copying it to a destination buffer on the Host, use MimFlip(). Note that for your Matrox Solios eV-CL to perform these operations, the Host destination buffer must be allocated in non-paged memory (that is, using MbufAlloc...() with M_IMAGE + M_NON_PAGED). Quickly converting buffer formats while copying When copying an on-board buffer into a Host destination buffer, Matrox Solios's video formatter can automatically convert the bit-depth and color format of the source buffer to the bit-depth and color format of the destination buffer. When your source buffer is the same bit-depth and color format as the destination buffer, no conversion is required. However, if your source and destination buffer formats have different bit-depths and color formats, a conversion will take place. If the source and destination buffer are of the appropriate formats and bit depths, the conversion will be performed on-board by the video formatter. On-board conversion is supported for the following source and destination buffer combinations. On-board buffer depth and color format (specified in the DCF) Host destination buffer depth and color format 8-bit monochrome 16-bit monochrome M_PACKED + M_BGR24 M_PACKED + M_BGR32 M_RGB48 + M_PACKED M_YUV16_YUYV / M_YUV16 M_PLANAR + M_RGB24 M_PLANAR + M_RGB48 8-bit monochrome Yes No Yes Yes No Yes Yes No 16-bit monochrome Yes Yes Yes Yes No Yes Yes No M_PACKED + M_BGR24 Yes No Yes Yes No Yes Yes No M_RGB48 + M_PACKED Yes No Yes Yes Yes Yes Yes No For information about YUV and RGB buffers, refer to Chapter 23: Data buffers. For the calculations used to convert to YUV, refer to the Matrox Solios eV-CL Hardware and Installation manual. Minimum latency and grabbing all frames Detecting missed frames Quickly copying an on-board buffer to a Host destination buffer Quickly converting buffer formats while copying ",
      "wordCount": 702,
      "subEntries": []
    },
    {
      "id": "BSN_solios_ev-cl_COM_ports_and_UARTS",
      "version": null,
      "title": "COM ports and UARTS",
      "subTitles": null,
      "location": "MIL Hardware-specific Notes",
      "pageURL": "content\\BoardSpecificNotes\\solios_ev-cl\\COM_ports_and_UARTS.htm",
      "text": " COM ports and UARTS For each connected camera, Matrox Solios eV-CL offers a RS-232/LVDS-compatible serial interface to communicate with the camera. Each interface is controlled by the UART on the acquisition path of the camera (through the Camera Link connection). Each interface is mapped as a COM port so that it can be accessed through the Microsoft Windows API. Board type Solios eV-CLB, eV-CLBL Solios eV-CLF, eV-CLFL Configuration dual-Base single-Medium single-Medium Number of COM ports 2 1 1 Use the Microsoft Windows library to access and control the serial ports. To view them in a Microsoft Windows operating system, refer to Microsoft Window's device manager, under Ports (COM &amp; LPT). Alternatively, you can control and access the serial ports using MsysControl() with M_UART.... With Matrox Solios eV-CL, the Camera Link manufacturer's camera configuration application can access and control the serial ports. Note that, if you have enabled the CLProtocol module for one of your cameras, the COM port associated with the acquisition path will not be available. COM ports and UARTS ",
      "wordCount": 173,
      "subEntries": []
    },
    {
      "id": "BSN_solios_ev-cl_Matrox_Solios_eV-CL_utilities",
      "version": null,
      "title": "Matrox Solios eV-CL tools",
      "subTitles": [
        "Matrox Camera-Link configuration utility",
        "Matrox Processing FPGA utility"
      ],
      "location": "MIL Hardware-specific Notes",
      "pageURL": "content\\BoardSpecificNotes\\solios_ev-cl\\Matrox_Solios_eV-CL_utilities.htm",
      "text": " Matrox Solios eV-CL tools There are three Matrox Solios external applications (utilities) available (Matrox Camera-Link and Matrox Processing FPGA). To find them, in the MILConfig utility's tree structure, select the Boards Solios item. These utilities are located in the Launch external applications. Matrox Camera-Link configuration utility The Matrox Camera-Link configuration utility allows you to enable the show select serial device dialog box, as well as enable GenICam for Camera Link (CLProtocol) and pick a Camera Link digitizer and associated protocol device ID. Matrox Processing FPGA utility The Matrox Processing FPGA utility shows a list of all the Matrox Boards installed on your system that contain a Processing FPGA. It also provides the ability to upgrade your firmware should Matrox technical support provides you an update file. Matrox Solios eV-CL tools Matrox Camera-Link configuration utility Matrox Processing FPGA utility ",
      "wordCount": 140,
      "subEntries": []
    },
    {
      "id": "BSN_solios_ev-cl_Matrox_Solios_eV-CLBL_and_eV-CLFL_connectors_and_signal_names",
      "version": null,
      "title": "Matrox Solios eV-CLBL and eV-CLFL connectors and signal names",
      "subTitles": [
        "Board connectors",
        "Signal names and their matching MIL constants"
      ],
      "location": "MIL Hardware-specific Notes",
      "pageURL": "content\\BoardSpecificNotes\\solios_ev-cl\\Matrox_Solios_eV-CLBL_and_eV-CLFL_connectors_and_signal_names.htm",
      "text": " Matrox Solios eV-CLBL and eV-CLFL connectors and signal names This section serves as a reference to match Matrox Solios eV-CLBL's and eV-CLFL's connectors and auxiliary/camera control signals with MIL information, such as MIL auxiliary/camera control signal numbers. To set/inquire all the settings for this board's auxiliary/camera control signals (for example, signal routing and timer settings), use MdigControl() / MdigInquire(), respectively. Matrox Solios eV-CLBL has either 2 (if in dual-Base mode) or 1 (if in single-Medium mode) acquisition paths. Matrox Solios eV-CLFL always has 1 acquisition path. For Matrox Solios eV-CLBL and eV-CLFL, only the auxiliary/camera control signals associated with the following digitizer device numbers are supported: Matrox Solios eV type Digitizer device # Matrox Solios eV-CLBL in dual-Base mode M_DEV0 and M_DEV1. Matrox Solios eV-CLBL in single-Medium mode or eV-CLFL M_DEV0. The following table lists the connectors of the auxiliary/control signals that can be used for each digitizer device number: Digitizer device # Matrox Solios eV-CLBL in single-Medium mode or eV-CLFL Matrox Solios eV-CLBL in dual-Base mode M_DEV0 Camera Link video input connector 0, External auxiliary I/O connector 0 and 1. Camera Link video input connector 0, External auxiliary I/O connector 0 and 1. M_DEV1 Camera Link video input connector 1, External auxiliary I/O connector 0 and 1. Auxiliary I/O signals and camera control signals can have one or more functionalities (for example, trigger input, timer output, or user output, depending on the signal). Their possible functionalities are described in their description in the pinout table below. Shared input and output signals can be accessed by the digitizers with the specified M_DEV... number. Although a shared signal can be accessed by multiple digitizers, all the functionalities supported by the signal might not be accessible by all these digitizers. In the case of shared output signals, ensure that only one digitizer is driving the output. Both versions of this board have 4 trigger controllers per acquisition path so that on-board events (for example, acquisition and timer output) can start upon different triggers if required. Although a trigger controller might support several trigger input signals, only one signal can drive a trigger controller at any given time. For example, if you set signal A as the trigger input source for acquisition, and signal B as the trigger input source for timer 1, signal A and B must be driving different trigger controllers; if they drive the same trigger controller, an error is generated. Note that you can set a signal (for example, signal A) as the trigger input source for both acquisition and timer 1; in this case, the associated trigger controller triggers both events at the same time. Only those auxiliary/camera control signals that have matching MIL information are included in this section. For information on internal connectors and a comprehensive list of all available input and output signals, refer to the board's installation and hardware reference manual. Board connectors On the Matrox Solios eV-CLBL and eV-CLFL boards, there are several interface connectors. On its bracket, there are two Camera Link video input connectors. On the DBHD-44/DB-9 cable adapter bracket, there are 2 external auxiliary I/O connectors. On the dual DBHD-15 cable adapter bracket, there are another 2 external auxiliary I/O connectors. All of Matrox Solios eV-CLBL's and eV-CLFL's connectors have auxiliary/camera control signals with matching MIL information. Connector Name Connector Abbreviation Image Description Camera Link video input connectors MDR (0 and 1) The Camera Link video input connectors are 26-pin high-density female connectors. They are used to receive video input, timing, and synchronization signals and transmit/receive communication signals between the video source and the frame grabber. Matrox Solios eV-CLBL and eV-CLFL boards have two Camera Link connectors on their main brackets. External auxiliary I/O connector 0 DBHD-44 or DBHD-15 (0) External auxiliary I/O connector 0 is used to transmit timing and synchronization signals, and transmit/receive auxiliary signals. Depending on the cable adapter bracket, external auxiliary I/O connector 0 can be either a high-density D-subminiature 44-pin female connector or a high-density D-subminiature 15-pin male connector. It interfaces with the internal auxiliary I/O connector on the board, making the I/O signals accessible outside the computer enclosure. External auxiliary I/O connector 1 DB-9 or DBHD-15 (1) External auxiliary I/O connector 1 is used to transmit/receive auxiliary signals. Depending on the cable adapter bracket, external auxiliary I/O connector 1 can be either a standard D-subminiature 9-pin female connector or a high-density D-subminiature 15-pin male connector. It interfaces with the internal auxiliary I/O connector on the board, making the I/O signals accessible outside the computer enclosure. Signal names and their matching MIL constants The table below lists the auxiliary/camera control signals with their associated MIL information. Note that the MIL constants in this table are those to use with MIL 10 and later. If you are upgrading from a previous version of MIL, you should port your code using the conversion tables for the Matrox Solios eV-CLBL and eV-CLFL (MILSoliosCameraLinkIOConversionTable) in the MIL release notes. Sort by: MIL I/O information Connector and pin Hardware manual signal name Filter by: Show all Direction: input Direction: output Direction: input/output Timers Triggers Tables: Expanded Collapsed Digitizer device # Description MIL I/O # Pin information Direction User-bit information Trigger information Timer information Hardware manual signal name Digitizer device #: M_DEV0 Indicates the following. MIL I/O #: M_AUX_IO0 Shared with: M_DEV1 Opto-isolated auxiliary signal (input), shared between both acquisition paths for trigger input or user input, and dedicated to acquisition path 1 for field polarity input. Pin information Connector: DBHD-44&nbsp;Pin: 24+, 8-; Connector: DBHD-15 (1)&nbsp;Pin: 15+, 9- Direction Input Trigger information M_HARDWARE_PORT0; Digitizer device #: M_DEV0, M_DEV1; Trigger controller: 2 on acq path 0; 2 or 0 on acq path 1. Hardware manual signal name OPTO_AUX_IN0 MIL I/O #: M_AUX_IO1 Shared with: M_DEV1 Opto-isolated auxiliary signal (input), shared between both acquisition paths for trigger input or user input. Pin information Connector: DBHD-44&nbsp;Pin: 38+, 39-; Connector: DBHD-15 (1)&nbsp;Pin: 12+, 11- Direction Input Trigger information M_HARDWARE_PORT1; Digitizer device #: M_DEV0, M_DEV1; Trigger controller: 3 on acq path 0; 3 or 1 on acq path 1. Hardware manual signal name OPTO_AUX_IN1 MIL I/O #: M_AUX_IO2 Shared with: M_DEV1 TTL auxiliary signal (input/output), shared between both acquisition paths for trigger input, user input, or user output, and dedicated to acquisition path 0 for timer output. Pin information Connector: DBHD-44&nbsp;Pin: 43; Connector: DBHD-15 (0)&nbsp;Pin: 3 Direction Input/Output User-bit information MIL user-bit #: M_USER_BIT4; Digitizer device #: M_DEV0, M_DEV1; (Hardware manual user signal rank 1 : 4 on acq path 0 ; 7 on acq path 1 ) Trigger information M_HARDWARE_PORT2; Digitizer device #: M_DEV0, M_DEV1; Trigger controller: 2 on acq path 0; 2 on acq path 1. Timer information Timer: M_TIMER2; Digitizer device #: M_DEV0; Hardware manual signal name TTL_AUX_IO_0 MIL I/O #: M_AUX_IO3 Shared with: M_DEV1 TTL auxiliary signal (input/output), shared between both acquisition paths for trigger input, user input, or user output, and dedicated to acquisition path 1 for timer output. Pin information Connector: DBHD-44&nbsp;Pin: 15; Connector: DBHD-15 (1)&nbsp;Pin: 3 Direction Input/Output User-bit information MIL user-bit #: M_USER_BIT5; Digitizer device #: M_DEV0, M_DEV1; (Hardware manual user signal rank 1 : 7 on acq path 0 ; 4 on acq path 1 ) Trigger information M_HARDWARE_PORT3; Digitizer device #: M_DEV0, M_DEV1; Trigger controller: 3 on acq path 0; 3 on acq path 1. Timer information Timer: M_TIMER2; Digitizer device #: M_DEV1; Hardware manual signal name TTL_AUX_IO_1 MIL I/O #: M_AUX_IO4 Shared with: M_DEV1 LVDS auxiliary signal (input), shared between both acquisition paths for trigger input or user input, and dedicated to acquisition path 1 for field polarity input, or quadrature input bit 0. Pin information Connector: DBHD-44&nbsp;Pin: 32+, 31-; Connector: DBHD-15 (1)&nbsp;Pin: 4+, 5- Direction Input Trigger information M_HARDWARE_PORT4; Digitizer device #: M_DEV0, M_DEV1; Trigger controller: 2 on acq path 0; 2 or 0 on acq path 1. Hardware manual signal name LVDS_AUX_IN0 MIL I/O #: M_AUX_IO5 Shared with: M_DEV1 LVDS auxiliary signal (input), shared between both acquisition paths for trigger input or user input, and dedicated to acquisition path 1 for timer clock input or quadrature input bit 1. Pin information Connector: DBHD-44&nbsp;Pin: 12+, 28-; Connector: DBHD-15 (1)&nbsp;Pin: 6+, 8- Direction Input Trigger information M_HARDWARE_PORT5; Digitizer device #: M_DEV0, M_DEV1; Trigger controller: 3 on acq path 0; 3 or 1 on acq path 1. Hardware manual signal name LVDS_AUX_IN1 MIL I/O #: M_AUX_IO6 Opto-isolated auxiliary signal (input) for acquisition path 0, which supports: trigger input, user input, or field polarity input. Pin information Connector: DB-9&nbsp;Pin: 7+, 2-; Connector: DBHD-15 (0)&nbsp;Pin: 15+, 9- Direction Input Trigger information M_HARDWARE_PORT6; Digitizer device #: M_DEV0; Trigger controller: 0 on acq path 0. Hardware manual signal name P0_OPTO_AUX_IN0 MIL I/O #: M_AUX_IO7 Opto-isolated auxiliary signal (input) for acquisition path 0, which supports: trigger input or user input. Pin information Connector: DB-9&nbsp;Pin: 4+, 5-; Connector: DBHD-15 (0)&nbsp;Pin: 12+, 11- Direction Input Trigger information M_HARDWARE_PORT7; Digitizer device #: M_DEV0; Trigger controller: 1 on acq path 0. Hardware manual signal name P0_OPTO_AUX_IN1 MIL I/O #: M_AUX_IO8 TTL auxiliary signal (input/output) for acquisition path 0, which supports: timer output, trigger input, user input, user output, or field polarity input. Pin information Connector: DB-9&nbsp;Pin: 1; Connector: DBHD-15 (0)&nbsp;Pin: 1 Direction Input/Output User-bit information MIL user-bit #: M_USER_BIT2; Digitizer device #: M_DEV0; (Hardware manual user signal rank 1 : 2 on acq path 0 ) Trigger information M_HARDWARE_PORT8; Digitizer device #: M_DEV0; Trigger controller: 0 on acq path 0. Timer information Timer: M_TIMER3; Digitizer device #: M_DEV0; Hardware manual signal name P0_TTL_AUX_IO_0 MIL I/O #: M_AUX_IO9 TTL auxiliary signal (input/output) for acquisition path 0, which supports: timer output, trigger input, user input, or user output. Pin information Connector: DBHD-44&nbsp;Pin: 13; Connector: DBHD-15 (0)&nbsp;Pin: 2 Direction Input/Output User-bit information MIL user-bit #: M_USER_BIT3; Digitizer device #: M_DEV0; (Hardware manual user signal rank 1 : 3 on acq path 0 ) Trigger information M_HARDWARE_PORT9; Digitizer device #: M_DEV0; Trigger controller: 1 on acq path 0. Timer information Timer: M_TIMER1/M_TIMER4; Digitizer device #: M_DEV0; Hardware manual signal name P0_TTL_AUX_IO_1 MIL I/O #: M_AUX_IO10 LVDS auxiliary signal (input) for acquisition path 0, which supports: trigger input, user input, field polarity input, or quadrature input bit 0. Pin information Connector: DB-9&nbsp;Pin: 8+, 3-; Connector: DBHD-15 (0)&nbsp;Pin: 4+, 5- Direction Input Trigger information M_HARDWARE_PORT10; Digitizer device #: M_DEV0; Trigger controller: 0 on acq path 0. Hardware manual signal name P0_LVDS_AUX_IN0 MIL I/O #: M_AUX_IO11 LVDS auxiliary signal (input) for acquisition path 0, which supports: trigger input, user input, timer clock input, or quadrature input bit 1. Pin information Connector: DBHD-44&nbsp;Pin: 37+, 23-; Connector: DBHD-15 (0)&nbsp;Pin: 6+, 8- Direction Input Trigger information M_HARDWARE_PORT11; Digitizer device #: M_DEV0; Trigger controller: 1 on acq path 0. Hardware manual signal name P0_LVDS_AUX_IN1 MIL I/O #: M_AUX_IO12 LVDS auxiliary signal (output) for acquisition path 0, which supports: timer output or user output. Pin information Connector: DBHD-44&nbsp;Pin: 20+, 4-; Connector: DBHD-15 (0)&nbsp;Pin: 13+, 14- Direction Output User-bit information MIL user-bit #: M_USER_BIT0; Digitizer device #: M_DEV0; (Hardware manual user signal rank 1 : 5 on acq path 0 ) Timer information Timer: M_TIMER1; Digitizer device #: M_DEV0; Hardware manual signal name P0_LVDS_AUX_OUT0 MIL I/O #: M_AUX_IO13 LVDS auxiliary signal (output) for acquisition path 0, which supports: timer output or user output. Pin information Connector: DBHD-44&nbsp;Pin: 19+, 3- Direction Output User-bit information MIL user-bit #: M_USER_BIT1; Digitizer device #: M_DEV0; (Hardware manual user signal rank 1 : 6 on acq path 0 ) Timer information Timer: M_TIMER2; Digitizer device #: M_DEV0; Hardware manual signal name P0_LVDS_AUX_OUT1 MIL I/O #: M_CC_IO1 Camera control output 1 for acquisition path 0, which supports: timer output, user output, VSYNC, HSYNC, clock output, or rerouting of specific auxiliary input signals. Only the following auxiliary input signals can be rerouted to this output signal: M_AUX_IO1 on M_DEV0 and M_DEV1 ( OPTO_AUX_IN1 ). M_AUX_IO2 on M_DEV0 and M_DEV1 ( TTL_AUX_IO_0 ). M_AUX_IO5 on M_DEV0 and M_DEV1 ( LVDS_AUX_IN1 ). M_AUX_IO7 on M_DEV0 ( P0_OPTO_AUX_IN1 ). M_AUX_IO8 on M_DEV0 ( P0_TTL_AUX_IO_0 ). M_AUX_IO10 on M_DEV0 ( P0_LVDS_AUX_IN0 ). Pin information Connector: MDR (0)&nbsp;Pin: 5+, 18- Direction Output User-bit information MIL user-bit #: M_USER_BIT_CC_IO0/M_USER_BIT_CC_IO1; Digitizer device #: M_DEV0; Timer information Timer: M_TIMER1/M_TIMER2; Digitizer device #: M_DEV0; Hardware manual signal name CC1 (0) MIL I/O #: M_CC_IO2 Camera control output 2 for acquisition path 0, which supports: timer output, user output, VSYNC, HSYNC, clock output, or rerouting of specific auxiliary input signals. Only the following auxiliary input signals can be rerouted to this output signal: M_AUX_IO1 on M_DEV0 and M_DEV1 ( OPTO_AUX_IN1 ). M_AUX_IO2 on M_DEV0 and M_DEV1 ( TTL_AUX_IO_0 ). M_AUX_IO5 on M_DEV0 and M_DEV1 ( LVDS_AUX_IN1 ). M_AUX_IO7 on M_DEV0 ( P0_OPTO_AUX_IN1 ). M_AUX_IO8 on M_DEV0 ( P0_TTL_AUX_IO_0 ). M_AUX_IO10 on M_DEV0 ( P0_LVDS_AUX_IN0 ). Pin information Connector: MDR (0)&nbsp;Pin: 17+, 4- Direction Output User-bit information MIL user-bit #: M_USER_BIT_CC_IO0/M_USER_BIT_CC_IO1; Digitizer device #: M_DEV0; Timer information Timer: M_TIMER1/M_TIMER2; Digitizer device #: M_DEV0; Hardware manual signal name CC2 (0) MIL I/O #: M_CC_IO3 Camera control output 3 for acquisition path 0, which supports: timer output, user output, VSYNC, HSYNC, clock output, or rerouting of specific auxiliary input signals. Only the following auxiliary input signals can be rerouted to this output signal: M_AUX_IO1 on M_DEV0 and M_DEV1 ( OPTO_AUX_IN1 ). M_AUX_IO2 on M_DEV0 and M_DEV1 ( TTL_AUX_IO_0 ). M_AUX_IO5 on M_DEV0 and M_DEV1 ( LVDS_AUX_IN1 ). M_AUX_IO7 on M_DEV0 ( P0_OPTO_AUX_IN1 ). M_AUX_IO8 on M_DEV0 ( P0_TTL_AUX_IO_0 ). M_AUX_IO10 on M_DEV0 ( P0_LVDS_AUX_IN0 ). Pin information Connector: MDR (0)&nbsp;Pin: 3+, 16- Direction Output User-bit information MIL user-bit #: M_USER_BIT_CC_IO0/M_USER_BIT_CC_IO1; Digitizer device #: M_DEV0; Timer information Timer: M_TIMER1/M_TIMER2; Digitizer device #: M_DEV0; Hardware manual signal name CC3 (0) MIL I/O #: M_CC_IO4 Camera control output 4 for acquisition path 0, which supports: timer output, user output, VSYNC, HSYNC, clock output, or rerouting of specific auxiliary input signals. Only the following auxiliary input signals can be rerouted to this output signal: M_AUX_IO1 on M_DEV0 and M_DEV1 ( OPTO_AUX_IN1 ). M_AUX_IO2 on M_DEV0 and M_DEV1 ( TTL_AUX_IO_0 ). M_AUX_IO5 on M_DEV0 and M_DEV1 ( LVDS_AUX_IN1 ). M_AUX_IO7 on M_DEV0 ( P0_OPTO_AUX_IN1 ). M_AUX_IO8 on M_DEV0 ( P0_TTL_AUX_IO_0 ). M_AUX_IO10 on M_DEV0 ( P0_LVDS_AUX_IN0 ). Pin information Connector: MDR (0)&nbsp;Pin: 15+, 2- Direction Output User-bit information MIL user-bit #: M_USER_BIT_CC_IO0/M_USER_BIT_CC_IO1; Digitizer device #: M_DEV0; Timer information Timer: M_TIMER1/M_TIMER2; Digitizer device #: M_DEV0; Hardware manual signal name CC4 (0) Digitizer device #: M_DEV1 Indicates the following. MIL I/O #: M_AUX_IO0 Shared with: M_DEV0 Opto-isolated auxiliary signal (input), shared between both acquisition paths for trigger input or user input, and dedicated to acquisition path 1 for field polarity input. Pin information Connector: DBHD-44&nbsp;Pin: 24+, 8-; Connector: DBHD-15 (1)&nbsp;Pin: 15+, 9- Direction Input Trigger information M_HARDWARE_PORT0; Digitizer device #: M_DEV0, M_DEV1; Trigger controller: 2 on acq path 0; 2 or 0 on acq path 1. Hardware manual signal name OPTO_AUX_IN0 MIL I/O #: M_AUX_IO1 Shared with: M_DEV0 Opto-isolated auxiliary signal (input), shared between both acquisition paths for trigger input or user input. Pin information Connector: DBHD-44&nbsp;Pin: 38+, 39-; Connector: DBHD-15 (1)&nbsp;Pin: 12+, 11- Direction Input Trigger information M_HARDWARE_PORT1; Digitizer device #: M_DEV0, M_DEV1; Trigger controller: 3 on acq path 0; 3 or 1 on acq path 1. Hardware manual signal name OPTO_AUX_IN1 MIL I/O #: M_AUX_IO2 Shared with: M_DEV0 TTL auxiliary signal (input/output), shared between both acquisition paths for trigger input, user input, or user output, and dedicated to acquisition path 0 for timer output. Pin information Connector: DBHD-44&nbsp;Pin: 43; Connector: DBHD-15 (0)&nbsp;Pin: 3 Direction Input/Output User-bit information MIL user-bit #: M_USER_BIT4; Digitizer device #: M_DEV0, M_DEV1; (Hardware manual user signal rank 1 : 4 on acq path 0 ; 7 on acq path 1 ) Trigger information M_HARDWARE_PORT2; Digitizer device #: M_DEV0, M_DEV1; Trigger controller: 2 on acq path 0; 2 on acq path 1. Timer information Timer: M_TIMER2; Digitizer device #: M_DEV0; Hardware manual signal name TTL_AUX_IO_0 MIL I/O #: M_AUX_IO3 Shared with: M_DEV0 TTL auxiliary signal (input/output), shared between both acquisition paths for trigger input, user input, or user output, and dedicated to acquisition path 1 for timer output. Pin information Connector: DBHD-44&nbsp;Pin: 15; Connector: DBHD-15 (1)&nbsp;Pin: 3 Direction Input/Output User-bit information MIL user-bit #: M_USER_BIT5; Digitizer device #: M_DEV0, M_DEV1; (Hardware manual user signal rank 1 : 7 on acq path 0 ; 4 on acq path 1 ) Trigger information M_HARDWARE_PORT3; Digitizer device #: M_DEV0, M_DEV1; Trigger controller: 3 on acq path 0; 3 on acq path 1. Timer information Timer: M_TIMER2; Digitizer device #: M_DEV1; Hardware manual signal name TTL_AUX_IO_1 MIL I/O #: M_AUX_IO4 Shared with: M_DEV0 LVDS auxiliary signal (input), shared between both acquisition paths for trigger input or user input, and dedicated to acquisition path 1 for field polarity input, or quadrature input bit 0. Pin information Connector: DBHD-44&nbsp;Pin: 32+, 31-; Connector: DBHD-15 (1)&nbsp;Pin: 4+, 5- Direction Input Trigger information M_HARDWARE_PORT4; Digitizer device #: M_DEV0, M_DEV1; Trigger controller: 2 on acq path 0; 2 or 0 on acq path 1. Hardware manual signal name LVDS_AUX_IN0 MIL I/O #: M_AUX_IO5 Shared with: M_DEV0 LVDS auxiliary signal (input), shared between both acquisition paths for trigger input or user input, and dedicated to acquisition path 1 for timer clock input or quadrature input bit 1. Pin information Connector: DBHD-44&nbsp;Pin: 12+, 28-; Connector: DBHD-15 (1)&nbsp;Pin: 6+, 8- Direction Input Trigger information M_HARDWARE_PORT5; Digitizer device #: M_DEV0, M_DEV1; Trigger controller: 3 on acq path 0; 3 or 1 on acq path 1. Hardware manual signal name LVDS_AUX_IN1 MIL I/O #: M_AUX_IO8 TTL auxiliary signal (input/output) for acquisition path 1, which supports: timer output, trigger input, user input, user output, or field polarity input. Pin information Connector: DBHD-44&nbsp;Pin: 35; Connector: DBHD-15 (1)&nbsp;Pin: 1 Direction Input/Output User-bit information MIL user-bit #: M_USER_BIT2; Digitizer device #: M_DEV1; (Hardware manual user signal rank 1 : 2 on acq path 1 ) Trigger information M_HARDWARE_PORT8; Digitizer device #: M_DEV1; Trigger controller: 0 on acq path 1. Timer information Timer: M_TIMER3; Digitizer device #: M_DEV1; Hardware manual signal name P1_TTL_AUX_IO_0 MIL I/O #: M_AUX_IO9 TTL auxiliary signal (input/output) for acquisition path 1, which supports: timer output, trigger input, user input, or user output. Pin information Connector: DBHD-44&nbsp;Pin: 1; Connector: DBHD-15 (1)&nbsp;Pin: 2 Direction Input/Output User-bit information MIL user-bit #: M_USER_BIT3; Digitizer device #: M_DEV1; (Hardware manual user signal rank 1 : 3 on acq path 1 ) Trigger information M_HARDWARE_PORT9; Digitizer device #: M_DEV1; Trigger controller: 1 on acq path 1. Timer information Timer: M_TIMER1; Digitizer device #: M_DEV1; Hardware manual signal name P1_TTL_AUX_IO_1 MIL I/O #: M_AUX_IO12 LVDS auxiliary signal (output) for acquisition path 1, which supports: timer output or user output. Pin information Connector: DBHD-44&nbsp;Pin: 33+, 18-; Connector: DBHD-15 (1)&nbsp;Pin: 13+, 14- Direction Output User-bit information MIL user-bit #: M_USER_BIT0; Digitizer device #: M_DEV1; (Hardware manual user signal rank 1 : 5 on acq path 1 ) Timer information Timer: M_TIMER1; Digitizer device #: M_DEV1; Hardware manual signal name P1_LVDS_AUX_OUT0 MIL I/O #: M_AUX_IO13 LVDS auxiliary signal (output) for acquisition path 1, which supports: timer output or user output. Pin information Connector: DBHD-44&nbsp;Pin: 2+, 17- Direction Output User-bit information MIL user-bit #: M_USER_BIT1; Digitizer device #: M_DEV1; (Hardware manual user signal rank 1 : 6 on acq path 1 ) Timer information Timer: M_TIMER2; Digitizer device #: M_DEV1; Hardware manual signal name P1_LVDS_AUX_OUT1 MIL I/O #: M_CC_IO1 Camera control output 1 for acquisition path 1, which supports: timer output, user output, VSYNC, HSYNC, clock output, or rerouting of specific auxiliary input signals. Only the following auxiliary input signals can be rerouted to this output signal: M_AUX_IO0 on M_DEV0 and M_DEV1 ( OPTO_AUX_IN0 ). M_AUX_IO1 on M_DEV0 and M_DEV1 ( OPTO_AUX_IN1 ). M_AUX_IO2 on M_DEV0 and M_DEV1 ( TTL_AUX_IO_0 ). M_AUX_IO4 on M_DEV0 and M_DEV1 ( LVDS_AUX_IN0 ). M_AUX_IO5 on M_DEV0 and M_DEV1 ( LVDS_AUX_IN1 ). M_AUX_IO8 on M_DEV1 ( P1_TTL_AUX_IO_0 ). Pin information Connector: MDR (1)&nbsp;Pin: 5+, 18- Direction Output User-bit information MIL user-bit #: M_USER_BIT_CC_IO0/M_USER_BIT_CC_IO1; Digitizer device #: M_DEV1; Timer information Timer: M_TIMER1/M_TIMER2; Digitizer device #: M_DEV1; Hardware manual signal name CC1 (1) MIL I/O #: M_CC_IO2 Camera control output 2 for acquisition path 1, which supports: timer output, user output, VSYNC, HSYNC, clock output, or rerouting of specific auxiliary input signals. Only the following auxiliary input signals can be rerouted to this output signal: M_AUX_IO0 on M_DEV0 and M_DEV1 ( OPTO_AUX_IN0 ). M_AUX_IO1 on M_DEV0 and M_DEV1 ( OPTO_AUX_IN1 ). M_AUX_IO2 on M_DEV0 and M_DEV1 ( TTL_AUX_IO_0 ). M_AUX_IO4 on M_DEV0 and M_DEV1 ( LVDS_AUX_IN0 ). M_AUX_IO5 on M_DEV0 and M_DEV1 ( LVDS_AUX_IN1 ). M_AUX_IO8 on M_DEV1 ( P1_TTL_AUX_IO_0 ). Pin information Connector: MDR (1)&nbsp;Pin: 17+, 4- Direction Output User-bit information MIL user-bit #: M_USER_BIT_CC_IO0/M_USER_BIT_CC_IO1; Digitizer device #: M_DEV1; Timer information Timer: M_TIMER1/M_TIMER2; Digitizer device #: M_DEV1; Hardware manual signal name CC2 (1) MIL I/O #: M_CC_IO3 Camera control output 3 for acquisition path 1, which supports: timer output, user output, VSYNC, HSYNC, clock output, or rerouting of specific auxiliary input signals. Only the following auxiliary input signals can be rerouted to this output signal: M_AUX_IO0 on M_DEV0 and M_DEV1 ( OPTO_AUX_IN0 ). M_AUX_IO1 on M_DEV0 and M_DEV1 ( OPTO_AUX_IN1 ). M_AUX_IO2 on M_DEV0 and M_DEV1 ( TTL_AUX_IO_0 ). M_AUX_IO4 on M_DEV0 and M_DEV1 ( LVDS_AUX_IN0 ). M_AUX_IO5 on M_DEV0 and M_DEV1 ( LVDS_AUX_IN1 ). M_AUX_IO8 on M_DEV1 ( P1_TTL_AUX_IO_0 ). Pin information Connector: MDR (1)&nbsp;Pin: 3+, 16- Direction Output User-bit information MIL user-bit #: M_USER_BIT_CC_IO0/M_USER_BIT_CC_IO1; Digitizer device #: M_DEV1; Timer information Timer: M_TIMER1/M_TIMER2; Digitizer device #: M_DEV1; Hardware manual signal name CC3 (1) MIL I/O #: M_CC_IO4 Camera control output 4 for acquisition path 1, which supports: timer output, user output, VSYNC, HSYNC, clock output, or rerouting of specific auxiliary input signals. Only the following auxiliary input signals can be rerouted to this output signal: M_AUX_IO0 on M_DEV0 and M_DEV1 ( OPTO_AUX_IN0 ). M_AUX_IO1 on M_DEV0 and M_DEV1 ( OPTO_AUX_IN1 ). M_AUX_IO2 on M_DEV0 and M_DEV1 ( TTL_AUX_IO_0 ). M_AUX_IO4 on M_DEV0 and M_DEV1 ( LVDS_AUX_IN0 ). M_AUX_IO5 on M_DEV0 and M_DEV1 ( LVDS_AUX_IN1 ). M_AUX_IO8 on M_DEV1 ( P1_TTL_AUX_IO_0 ). Pin information Connector: MDR (1)&nbsp;Pin: 15+, 2- Direction Output User-bit information MIL user-bit #: M_USER_BIT_CC_IO0/M_USER_BIT_CC_IO1; Digitizer device #: M_DEV1; Timer information Timer: M_TIMER1/M_TIMER2; Digitizer device #: M_DEV1; Hardware manual signal name CC4 (1) expandTable(\"mil_io_information_show_all\"); 1 The user-bit number in the Installation and Hardware Reference manual is just a rank; use the MIL user-bit number instead. Matrox Solios eV-CLBL and eV-CLFL connectors and signal names Board connectors Signal names and their matching MIL constants ",
      "wordCount": 3704,
      "subEntries": []
    },
    {
      "id": "BSN_solios_ev-cl_Matrox_Solios_eV-CLB_and_eV-CLF_connectors_and_signal_names",
      "version": null,
      "title": "Matrox Solios eV-CLB and eV-CLF connectors and signal names",
      "subTitles": [
        "Board connectors",
        "Signal names and their matching MIL constants"
      ],
      "location": "MIL Hardware-specific Notes",
      "pageURL": "content\\BoardSpecificNotes\\solios_ev-cl\\Matrox_Solios_eV-CLB_and_eV-CLF_connectors_and_signal_names.htm",
      "text": " Matrox Solios eV-CLB and eV-CLF connectors and signal names This section serves as a reference to match Matrox Solios eV-CLB's and eV-CLF's connectors and auxiliary/camera control signals with MIL information, such as MIL auxiliary/camera control signal numbers. To set/inquire all the settings for this board's auxiliary/camera control signals (for example, signal routing and timer settings), use MdigControl() / MdigInquire(), respectively. Matrox Solios eV-CLB has either 2 (if in dual-Base mode) or 1 (if in single-Medium mode) acquisition paths. Matrox Solios eV-CLF always has 1 acquisition path. For Matrox Solios eV-CLB and eV-CLF, only the auxiliary/camera control signals associated with the following digitizer device numbers are supported: Matrox Solios eV type Digitizer device # Matrox Solios eV-CLB in dual-Base mode M_DEV0 and M_DEV1. Matrox Solios eV-CLB in single-Medium mode or eV-CLF M_DEV0. The following table lists the connectors of the auxiliary/control signals that can be used for each digitizer device number: Digitizer device # Matrox Solios eV-CLB in single-Medium mode or eV-CLF Matrox Solios eV-CLB in dual-Base mode M_DEV0 External auxiliary I/O connector 0 and 1, and Camera Link video input connector 0 External auxiliary I/O connector 0 and 1, and Camera Link video input connector 0 M_DEV1 External auxiliary I/O connector 0 and 1, and Camera Link video input connector 1 Auxiliary I/O signals and camera control signals can have one or more functionalities (for example, trigger input, timer output, or user output, depending on the signal). Their possible functionalities are described in their description in the pinout table below. Shared input and output signals can be accessed by the digitizers with the specified M_DEV... number. Although a shared signal can be accessed by multiple digitizers, all the functionalities supported by the signal might not be accessible by all these digitizers. In the case of shared output signals, ensure that only one digitizer is driving the output. Both versions of this board have 4 trigger controllers per acquisition path so that on-board events (for example, acquisition and timer output) can start upon different triggers if required. Although a trigger controller might support several trigger input signals, only one signal can drive a trigger controller at any given time. For example, if you set signal A as the trigger input source for acquisition, and signal B as the trigger input source for timer 1, signal A and B must be driving different trigger controllers; if they drive the same trigger controller, an error is generated. Note that you can set a signal (for example, signal A) as the trigger input source for both acquisition and timer 1; in this case, the associated trigger controller triggers both events at the same time. Only those auxiliary/camera control signals that have matching MIL information are included in this section. For information on internal connectors and a comprehensive list of all available input and output signals, refer to the board's installation and hardware reference manual. Board connectors On the Matrox Solios eV-CLB and eV-CLF boards, there are several interface connectors. On its bracket, there are two mini Camera Link video input connectors, and an auxiliary I/O connector. On the cable adapter brakcet, there is an additional auxiliary I/O connector (DBHD-15 or DB-9). All of Matrox Solios eV-CLB's and eV-CLF's connectors have auxiliary/camera control signals with matching MIL information. Connector Name Connector Abbreviation Image Description Camera Link video input connectors HDR or SDR (0 and 1) The two Camera Link video input connectors are 26-pin high-density female mini Camera Link connectors. They are used to receive video input, timing, and synchronization signals, and transmit/receive communication signals between the video source and the frame grabber. Matrox Solios eV-CLB and eV-CLF boards have two mini Camera Link connectors on their main brackets. External auxiliary I/O connector 0 DBHD-15 (0) External auxiliary I/O connector 0 is a high-density D-subminiature 15-pin male connector, located on the main bracket. It is used to transmit timing and synchronization signals, and transmit/receive auxiliary signals. If a jumper is installed on the 2-pin I/O acquisition path connector (jumper block), the auxiliary signals carried by this connector will be different; refer to connector J-DBHD-15 (0). External auxiliary I/O connector 1 DB-9 or DBHD-15 (1) External auxiliary I/O connector 1 can be either a high-density D-subminiature 15-pin male connector or a standard D-subminiature 9-pin female connector. In either case, the connector is used to transmit timing and synchronization signals, and transmit/receive auxiliary signals. External auxiliary I/O connector 1 is located on the cable adapter bracket, allowing you to access the internal auxiliary I/O signals from outside the computer enclosure. Note that if this external auxiliary I/O connector is a DB-9 connector, some DBHD-15 signals are not available. If a jumper is installed on the 2-pin I/O acquisition path connector (jumper block), the auxiliary signals carried by this connector will be different; refer to connector J-DB-9 or J-DBHD-15 (1) (described later in this section) for the correct MIL information. On the Matrox Solios eV-CLB and eV-CLF boards, there is a 2-pin I/O acquisition path connector (jumper block). When these two pins are connected together with a jumper, the set of signals carried by external auxiliary I/O connector 0 is swapped with the set of signals carried by external auxiliary I/O connector 1. The most significant change resulting with the installation of the jumper is a change in the acquisition path dependency. For clarity, when the jumper is installed, the connector abbreviation for the external auxiliary I/O connectors will have the prefix \"J-\". Connector Name Connector Abbreviation Image Description External auxiliary I/O connector 0 J-DBHD-15 (0) Phyiscally, DBHD-15 (0) and J-DBHD-15 (0) are the same connector, but J-DBHD-15 (0) is used to describe the pins of the connector when a jumper is installed on the 2-pin I/O acquisition path connector. External auxiliary I/O connector 1 J-DB-9 or J-DBHD-15 (1) Phyiscally, DB-9 and J-DB-9 are the same connector. Also, DBHD-15 (1) and J-DBHD-15 (1) are the same connector. J-DB-9 and J-DBHD-15 (1) are used to describe the pins of these connectors when a jumper is installed on the 2-pin I/O acquisition path connector. Signal names and their matching MIL constants The table below lists the auxiliary/camera control signals with their associated MIL information. Note that the MIL constants in this table are those to use with MIL 10 and later. If you are upgrading from a previous version of MIL, you should port your code using the conversion tables for the Matrox Solios eV-CLB and eV-CLF (MILSoliosCameraLinkIOConversionTable) in the MIL release notes. Sort by: MIL I/O information Connector and pin Hardware manual signal name Filter by: Show all Direction: input Direction: output Direction: input/output Timers Triggers Tables: Expanded Collapsed Digitizer device # Description MIL I/O # Pin information Direction User-bit information Trigger information Timer information Hardware manual signal name Digitizer device #: M_DEV0 Indicates the following. MIL I/O #: M_AUX_IO0 Shared with: M_DEV1 Opto-isolated auxiliary signal (input), shared between both acquisition paths for trigger input or user input, and dedicated to acquisition path 1 for field polarity input. Pin information Connector: DBHD-15 (1)&nbsp;Pin: 15+, 9-; Connector: DB-9&nbsp;Pin: 7+, 2-; Connector: J-DBHD-15 (0)&nbsp;Pin: 15+, 9- Direction Input Trigger information M_HARDWARE_PORT0; Digitizer device #: M_DEV0, M_DEV1; Trigger controller: 2 on acq path 0; 2 or 0 on acq path 1. Hardware manual signal name OPTO_AUX_IN0 MIL I/O #: M_AUX_IO1 Shared with: M_DEV1 Opto-isolated auxiliary signal (input), shared between both acquisition paths for trigger input or user input. Pin information Connector: DBHD-15 (1)&nbsp;Pin: 12+, 11-; Connector: DB-9&nbsp;Pin: 4+, 5-; Connector: J-DBHD-15 (0)&nbsp;Pin: 12+, 11- Direction Input Trigger information M_HARDWARE_PORT1; Digitizer device #: M_DEV0, M_DEV1; Trigger controller: 3 on acq path 0; 3 or 1 on acq path 1. Hardware manual signal name OPTO_AUX_IN1 MIL I/O #: M_AUX_IO2 Shared with: M_DEV1 TTL auxiliary signal (input/output), shared between both acquisition paths for trigger input, user input or user output, and dedicated to acquisition path 0 for timer output. Pin information Connector: DBHD-15 (0)&nbsp;Pin: 3; Connector: J-DBHD-15 (1)&nbsp;Pin: 3 Direction Input/Output User-bit information MIL user-bit #: M_USER_BIT4; Digitizer device #: M_DEV0, M_DEV1; (Hardware manual user signal rank 1 : 4 on acq path 0 ; 7 on acq path 1 ) Trigger information M_HARDWARE_PORT2; Digitizer device #: M_DEV0, M_DEV1; Trigger controller: 2 on acq path 0; 2 on acq path 1. Timer information Timer: M_TIMER2; Digitizer device #: M_DEV0; Hardware manual signal name TTL_AUX_IO_0 MIL I/O #: M_AUX_IO3 Shared with: M_DEV1 TTL auxiliary signal (input/output), shared between both acquisition paths for trigger input, user input or user output, and dedicated to acquisition path 1 for timer output. Pin information Connector: DBHD-15 (1)&nbsp;Pin: 3; Connector: J-DBHD-15 (0)&nbsp;Pin: 3 Direction Input/Output User-bit information MIL user-bit #: M_USER_BIT5; Digitizer device #: M_DEV0, M_DEV1; (Hardware manual user signal rank 1 : 7 on acq path 0 ; 4 on acq path 1 ) Trigger information M_HARDWARE_PORT3; Digitizer device #: M_DEV0, M_DEV1; Trigger controller: 3 on acq path 0; 3 on acq path 1. Timer information Timer: M_TIMER2; Digitizer device #: M_DEV1; Hardware manual signal name TTL_AUX_IO_1 MIL I/O #: M_AUX_IO4 Shared with: M_DEV1 LVDS auxiliary signal (input), shared between both acquisition paths for trigger input or user input, and dedicated to acquisition path 1 for field polarity input or quadrature input bit 0. Pin information Connector: DBHD-15 (1)&nbsp;Pin: 4+, 5-; Connector: DB-9&nbsp;Pin: 8+, 3-; Connector: J-DBHD-15 (0)&nbsp;Pin: 4+, 5- Direction Input Trigger information M_HARDWARE_PORT4; Digitizer device #: M_DEV0, M_DEV1; Trigger controller: 2 on acq path 0; 2 or 0 on acq path 1. Hardware manual signal name LVDS_AUX_IN0 MIL I/O #: M_AUX_IO5 Shared with: M_DEV1 LVDS auxiliary signal (input), shared between both acquisition paths for trigger input or user input, and dedicated to acquisition path 1 for timer clock input or quadrature input bit 1. Pin information Connector: DBHD-15 (1)&nbsp;Pin: 6+, 8-; Connector: J-DBHD-15 (0)&nbsp;Pin: 6+, 8- Direction Input Trigger information M_HARDWARE_PORT5; Digitizer device #: M_DEV0, M_DEV1; Trigger controller: 3 on acq path 0; 3 or 1 on acq path 1. Hardware manual signal name LVDS_AUX_IN1 MIL I/O #: M_AUX_IO6 Opto-isolated auxiliary signal (input) for acquisition path 0, which supports: trigger input, user input, or field polarity input. Pin information Connector: DBHD-15 (0)&nbsp;Pin: 15+, 9-; Connector: J-DBHD-15 (1)&nbsp;Pin: 15+, 9-; Connector: J-DB-9&nbsp;Pin: 7+, 2- Direction Input Trigger information M_HARDWARE_PORT6; Digitizer device #: M_DEV0; Trigger controller: 0 on acq path 0. Hardware manual signal name P0_OPTO_AUX_IN0 MIL I/O #: M_AUX_IO7 Opto-isolated auxiliary signal (input) for acquisition path 0, which supports: trigger input or user input. Pin information Connector: DBHD-15 (0)&nbsp;Pin: 12+, 11-; Connector: J-DBHD-15 (1)&nbsp;Pin: 12+, 11-; Connector: J-DB-9&nbsp;Pin: 4+, 5- Direction Input Trigger information M_HARDWARE_PORT7; Digitizer device #: M_DEV0; Trigger controller: 1 on acq path 0. Hardware manual signal name P0_OPTO_AUX_IN1 MIL I/O #: M_AUX_IO8 TTL auxiliary signal (input/output) for acquisition path 0, which supports: timer output, trigger input, user input, user output, or field polarity input. Pin information Connector: DBHD-15 (0)&nbsp;Pin: 1; Connector: J-DBHD-15 (1)&nbsp;Pin: 1; Connector: J-DB-9&nbsp;Pin: 1 Direction Input/Output User-bit information MIL user-bit #: M_USER_BIT2; Digitizer device #: M_DEV0; (Hardware manual user signal rank 1 : 2 on acq path 0 ) Trigger information M_HARDWARE_PORT8; Digitizer device #: M_DEV0; Trigger controller: 0 on acq path 0. Timer information Timer: M_TIMER3; Digitizer device #: M_DEV0; Hardware manual signal name P0_TTL_AUX_IO_0 MIL I/O #: M_AUX_IO9 TTL auxiliary signal (input/output) for acquisition path 0, which supports: timer output, trigger input, user input, or user output. Pin information Connector: DBHD-15 (0)&nbsp;Pin: 2; Connector: J-DBHD-15 (1)&nbsp;Pin: 2 Direction Input/Output User-bit information MIL user-bit #: M_USER_BIT3; Digitizer device #: M_DEV0; (Hardware manual user signal rank 1 : 3 on acq path 0 ) Trigger information M_HARDWARE_PORT9; Digitizer device #: M_DEV0; Trigger controller: 1 on acq path 0. Timer information Timer: M_TIMER1/M_TIMER4; Digitizer device #: M_DEV0; Hardware manual signal name P0_TTL_AUX_IO_1 MIL I/O #: M_AUX_IO10 LVDS auxiliary signal (input) for acquisition path 0, which supports: trigger input, user input, field polarity input, or quadrature input bit 0. Pin information Connector: DBHD-15 (0)&nbsp;Pin: 4+, 5-; Connector: J-DBHD-15 (1)&nbsp;Pin: 4+, 5-; Connector: J-DB-9&nbsp;Pin: 8+, 3- Direction Input Trigger information M_HARDWARE_PORT10; Digitizer device #: M_DEV0; Trigger controller: 0 on acq path 0. Hardware manual signal name P0_LVDS_AUX_IN0 MIL I/O #: M_AUX_IO11 LVDS auxiliary signal (input) for acquisition path 0, which supports: trigger input, user input, timer clock input, or quadrature input bit 1. Pin information Connector: DBHD-15 (0)&nbsp;Pin: 6+, 8-; Connector: J-DBHD-15 (1)&nbsp;Pin: 6+, 8- Direction Input Trigger information M_HARDWARE_PORT11; Digitizer device #: M_DEV0; Trigger controller: 1 on acq path 0. Hardware manual signal name P0_LVDS_AUX_IN1 MIL I/O #: M_AUX_IO12 LVDS auxiliary signal (output) for acquisition path 0, which supports: timer output or user output. Pin information Connector: DBHD-15 (0)&nbsp;Pin: 13+, 14-; Connector: J-DBHD-15 (1)&nbsp;Pin: 13+, 14- Direction Output User-bit information MIL user-bit #: M_USER_BIT0; Digitizer device #: M_DEV0; (Hardware manual user signal rank 1 : 5 on acq path 0 ) Timer information Timer: M_TIMER1; Digitizer device #: M_DEV0; Hardware manual signal name P0_LVDS_AUX_OUT0 MIL I/O #: M_CC_IO1 Camera control output 1 for acquisition path 0, which supports: timer output, user output, VSYNC, HSYNC, clock output, or rerouting of specific auxiliary input signals. Only the following auxiliary input signals can be rerouted to this output signal: M_AUX_IO1 on M_DEV0 and M_DEV1 ( OPTO_AUX_IN1 ). M_AUX_IO2 on M_DEV0 and M_DEV1 ( TTL_AUX_IO_0 ). M_AUX_IO5 on M_DEV0 and M_DEV1 ( LVDS_AUX_IN1 ). M_AUX_IO7 on M_DEV0 ( P0_OPTO_AUX_IN1 ). M_AUX_IO8 on M_DEV0 ( P0_TTL_AUX_IO_0 ). M_AUX_IO10 on M_DEV0 ( P0_LVDS_AUX_IN0 ). Pin information Connector: HDR/SDR (0)&nbsp;Pin: 5+, 18- Direction Output User-bit information MIL user-bit #: M_USER_BIT_CC_IO0/M_USER_BIT_CC_IO1; Digitizer device #: M_DEV0; Timer information Timer: M_TIMER1/M_TIMER2; Digitizer device #: M_DEV0; Hardware manual signal name CC1 (0) MIL I/O #: M_CC_IO2 Camera control output 2 for acquisition path 0, which supports: timer output, user output, VSYNC, HSYNC, clock output, or rerouting of specific auxiliary input signals. Only the following auxiliary input signals can be rerouted to this output signal: M_AUX_IO1 on M_DEV0 and M_DEV1 ( OPTO_AUX_IN1 ). M_AUX_IO2 on M_DEV0 and M_DEV1 ( TTL_AUX_IO_0 ). M_AUX_IO5 on M_DEV0 and M_DEV1 ( LVDS_AUX_IN1 ). M_AUX_IO7 on M_DEV0 ( P0_OPTO_AUX_IN1 ). M_AUX_IO8 on M_DEV0 ( P0_TTL_AUX_IO_0 ). M_AUX_IO10 on M_DEV0 ( P0_LVDS_AUX_IN0 ). Pin information Connector: HDR/SDR (0)&nbsp;Pin: 17+, 4- Direction Output User-bit information MIL user-bit #: M_USER_BIT_CC_IO0/M_USER_BIT_CC_IO1; Digitizer device #: M_DEV0; Timer information Timer: M_TIMER1/M_TIMER2; Digitizer device #: M_DEV0; Hardware manual signal name CC2 (0) MIL I/O #: M_CC_IO3 Camera control output 3 for acquisition path 0, which supports: timer output, user output, VSYNC, HSYNC, clock output, or rerouting of specific auxiliary input signals. Only the following auxiliary input signals can be rerouted to this output signal: M_AUX_IO1 on M_DEV0 and M_DEV1 ( OPTO_AUX_IN1 ). M_AUX_IO2 on M_DEV0 and M_DEV1 ( TTL_AUX_IO_0 ). M_AUX_IO5 on M_DEV0 and M_DEV1 ( LVDS_AUX_IN1 ). M_AUX_IO7 on M_DEV0 ( P0_OPTO_AUX_IN1 ). M_AUX_IO8 on M_DEV0 ( P0_TTL_AUX_IO_0 ). M_AUX_IO10 on M_DEV0 ( P0_LVDS_AUX_IN0 ). Pin information Connector: HDR/SDR (0)&nbsp;Pin: 3+, 16- Direction Output User-bit information MIL user-bit #: M_USER_BIT_CC_IO0/M_USER_BIT_CC_IO1; Digitizer device #: M_DEV0; Timer information Timer: M_TIMER1/M_TIMER2; Digitizer device #: M_DEV0; Hardware manual signal name CC3 (0) MIL I/O #: M_CC_IO4 Camera control output 4 for acquisition path 0, which supports: timer output, user output, VSYNC, HSYNC, clock output, or rerouting of specific auxiliary input signals. Only the following auxiliary input signals can be rerouted to this output signal: M_AUX_IO1 on M_DEV0 and M_DEV1 ( OPTO_AUX_IN1 ). M_AUX_IO2 on M_DEV0 and M_DEV1 ( TTL_AUX_IO_0 ). M_AUX_IO5 on M_DEV0 and M_DEV1 ( LVDS_AUX_IN1 ). M_AUX_IO7 on M_DEV0 ( P0_OPTO_AUX_IN1 ). M_AUX_IO8 on M_DEV0 ( P0_TTL_AUX_IO_0 ). M_AUX_IO10 on M_DEV0 ( P0_LVDS_AUX_IN0 ). Pin information Connector: HDR/SDR (0)&nbsp;Pin: 15+, 2- Direction Output User-bit information MIL user-bit #: M_USER_BIT_CC_IO0/M_USER_BIT_CC_IO1; Digitizer device #: M_DEV0; Timer information Timer: M_TIMER1/M_TIMER2; Digitizer device #: M_DEV0; Hardware manual signal name CC4 (0) Digitizer device #: M_DEV1 Indicates the following. MIL I/O #: M_AUX_IO0 Shared with: M_DEV0 Opto-isolated auxiliary signal (input), shared between both acquisition paths for trigger input or user input, and dedicated to acquisition path 1 for field polarity input. Pin information Connector: DBHD-15 (1)&nbsp;Pin: 15+, 9-; Connector: DB-9&nbsp;Pin: 7+, 2-; Connector: J-DBHD-15 (0)&nbsp;Pin: 15+, 9- Direction Input Trigger information M_HARDWARE_PORT0; Digitizer device #: M_DEV0, M_DEV1; Trigger controller: 2 on acq path 0; 2 or 0 on acq path 1. Hardware manual signal name OPTO_AUX_IN0 MIL I/O #: M_AUX_IO1 Shared with: M_DEV0 Opto-isolated auxiliary signal (input), shared between both acquisition paths for trigger input or user input. Pin information Connector: DBHD-15 (1)&nbsp;Pin: 12+, 11-; Connector: DB-9&nbsp;Pin: 4+, 5-; Connector: J-DBHD-15 (0)&nbsp;Pin: 12+, 11- Direction Input Trigger information M_HARDWARE_PORT1; Digitizer device #: M_DEV0, M_DEV1; Trigger controller: 3 on acq path 0; 3 or 1 on acq path 1. Hardware manual signal name OPTO_AUX_IN1 MIL I/O #: M_AUX_IO2 Shared with: M_DEV0 TTL auxiliary signal (input/output), shared between both acquisition paths for trigger input, user input or user output, and dedicated to acquisition path 0 for timer output. Pin information Connector: DBHD-15 (0)&nbsp;Pin: 3; Connector: J-DBHD-15 (1)&nbsp;Pin: 3 Direction Input/Output User-bit information MIL user-bit #: M_USER_BIT4; Digitizer device #: M_DEV0, M_DEV1; (Hardware manual user signal rank 1 : 4 on acq path 0 ; 7 on acq path 1 ) Trigger information M_HARDWARE_PORT2; Digitizer device #: M_DEV0, M_DEV1; Trigger controller: 2 on acq path 0; 2 on acq path 1. Timer information Timer: M_TIMER2; Digitizer device #: M_DEV0; Hardware manual signal name TTL_AUX_IO_0 MIL I/O #: M_AUX_IO3 Shared with: M_DEV0 TTL auxiliary signal (input/output), shared between both acquisition paths for trigger input, user input or user output, and dedicated to acquisition path 1 for timer output. Pin information Connector: DBHD-15 (1)&nbsp;Pin: 3; Connector: J-DBHD-15 (0)&nbsp;Pin: 3 Direction Input/Output User-bit information MIL user-bit #: M_USER_BIT5; Digitizer device #: M_DEV0, M_DEV1; (Hardware manual user signal rank 1 : 7 on acq path 0 ; 4 on acq path 1 ) Trigger information M_HARDWARE_PORT3; Digitizer device #: M_DEV0, M_DEV1; Trigger controller: 3 on acq path 0; 3 on acq path 1. Timer information Timer: M_TIMER2; Digitizer device #: M_DEV1; Hardware manual signal name TTL_AUX_IO_1 MIL I/O #: M_AUX_IO4 Shared with: M_DEV0 LVDS auxiliary signal (input), shared between both acquisition paths for trigger input or user input, and dedicated to acquisition path 1 for field polarity input or quadrature input bit 0. Pin information Connector: DBHD-15 (1)&nbsp;Pin: 4+, 5-; Connector: DB-9&nbsp;Pin: 8+, 3-; Connector: J-DBHD-15 (0)&nbsp;Pin: 4+, 5- Direction Input Trigger information M_HARDWARE_PORT4; Digitizer device #: M_DEV0, M_DEV1; Trigger controller: 2 on acq path 0; 2 or 0 on acq path 1. Hardware manual signal name LVDS_AUX_IN0 MIL I/O #: M_AUX_IO5 Shared with: M_DEV0 LVDS auxiliary signal (input), shared between both acquisition paths for trigger input or user input, and dedicated to acquisition path 1 for timer clock input or quadrature input bit 1. Pin information Connector: DBHD-15 (1)&nbsp;Pin: 6+, 8-; Connector: J-DBHD-15 (0)&nbsp;Pin: 6+, 8- Direction Input Trigger information M_HARDWARE_PORT5; Digitizer device #: M_DEV0, M_DEV1; Trigger controller: 3 on acq path 0; 3 or 1 on acq path 1. Hardware manual signal name LVDS_AUX_IN1 MIL I/O #: M_AUX_IO8 TTL auxiliary signal (input/output) for acquisition path 1, which supports: timer output, trigger input, user input, user output, or field polarity input. Pin information Connector: DBHD-15 (1)&nbsp;Pin: 1; Connector: DB-9&nbsp;Pin: 1; Connector: J-DBHD-15 (0)&nbsp;Pin: 1 Direction Input/Output User-bit information MIL user-bit #: M_USER_BIT2; Digitizer device #: M_DEV1; (Hardware manual user signal rank 1 : 2 on acq path 1 ) Trigger information M_HARDWARE_PORT8; Digitizer device #: M_DEV1; Trigger controller: 0 on acq path 1. Timer information Timer: M_TIMER3; Digitizer device #: M_DEV1; Hardware manual signal name P1_TTL_AUX_IO_0 MIL I/O #: M_AUX_IO9 TTL auxiliary signal (input/output) for acquisition path 1, which supports: timer output, trigger input, user input or user output. Pin information Connector: DBHD-15 (1)&nbsp;Pin: 2; Connector: J-DBHD-15 (0)&nbsp;Pin: 2 Direction Input/Output User-bit information MIL user-bit #: M_USER_BIT3; Digitizer device #: M_DEV1; (Hardware manual user signal rank 1 : 3 on acq path 1 ) Trigger information M_HARDWARE_PORT9; Digitizer device #: M_DEV1; Trigger controller: 1 on acq path 1. Timer information Timer: M_TIMER1; Digitizer device #: M_DEV1; Hardware manual signal name P1_TTL_AUX_IO_1 MIL I/O #: M_AUX_IO12 LVDS auxiliary signal (output) for acquisition path 1, which supports: timer output or user output. Pin information Connector: DBHD-15 (1)&nbsp;Pin: 13+, 14-; Connector: J-DBHD-15 (0)&nbsp;Pin: 13+, 14- Direction Output User-bit information MIL user-bit #: M_USER_BIT0; Digitizer device #: M_DEV1; (Hardware manual user signal rank 1 : 5 on acq path 1 ) Timer information Timer: M_TIMER1; Digitizer device #: M_DEV1; Hardware manual signal name P1_LVDS_AUX_OUT0 MIL I/O #: M_CC_IO1 Camera control output 1 for acquisition path 1, which supports: timer output, user output, VSYNC, HSYNC, clock output, or rerouting of specific auxiliary input signals. Only the following auxiliary input signals can be rerouted to this output signal: M_AUX_IO0 on M_DEV0 and M_DEV1 ( OPTO_AUX_IN0 ). M_AUX_IO1 on M_DEV0 and M_DEV1 ( OPTO_AUX_IN1 ). M_AUX_IO2 on M_DEV0 and M_DEV1 ( TTL_AUX_IO_0 ). M_AUX_IO4 on M_DEV0 and M_DEV1 ( LVDS_AUX_IN0 ). M_AUX_IO5 on M_DEV0 and M_DEV1 ( LVDS_AUX_IN1 ). M_AUX_IO8 on M_DEV1 ( P1_TTL_AUX_IO_0 ). Pin information Connector: HDR/SDR (1)&nbsp;Pin: 5+, 18- Direction Output User-bit information MIL user-bit #: M_USER_BIT_CC_IO0/M_USER_BIT_CC_IO1; Digitizer device #: M_DEV1; Timer information Timer: M_TIMER1/M_TIMER2; Digitizer device #: M_DEV1; Hardware manual signal name CC1 (1) MIL I/O #: M_CC_IO2 Camera control output 2 for acquisition path 1, which supports: timer output, user output, VSYNC, HSYNC, clock output, or rerouting of specific auxiliary input signals. Only the following auxiliary input signals can be rerouted to this output signal: M_AUX_IO0 on M_DEV0 and M_DEV1 ( OPTO_AUX_IN0 ). M_AUX_IO1 on M_DEV0 and M_DEV1 ( OPTO_AUX_IN1 ). M_AUX_IO2 on M_DEV0 and M_DEV1 ( TTL_AUX_IO_0 ). M_AUX_IO4 on M_DEV0 and M_DEV1 ( LVDS_AUX_IN0 ). M_AUX_IO5 on M_DEV0 and M_DEV1 ( LVDS_AUX_IN1 ). M_AUX_IO8 on M_DEV1 ( P1_TTL_AUX_IO_0 ). Pin information Connector: HDR/SDR (1)&nbsp;Pin: 17+, 4- Direction Output User-bit information MIL user-bit #: M_USER_BIT_CC_IO0/M_USER_BIT_CC_IO1; Digitizer device #: M_DEV1; Timer information Timer: M_TIMER1/M_TIMER2; Digitizer device #: M_DEV1; Hardware manual signal name CC2 (1) MIL I/O #: M_CC_IO3 Camera control output 3 for acquisition path 1, which supports: timer output, user output, VSYNC, HSYNC, clock output, or rerouting of specific auxiliary input signals. Only the following auxiliary input signals can be rerouted to this output signal: M_AUX_IO0 on M_DEV0 and M_DEV1 ( OPTO_AUX_IN0 ). M_AUX_IO1 on M_DEV0 and M_DEV1 ( OPTO_AUX_IN1 ). M_AUX_IO2 on M_DEV0 and M_DEV1 ( TTL_AUX_IO_0 ). M_AUX_IO4 on M_DEV0 and M_DEV1 ( LVDS_AUX_IN0 ). M_AUX_IO5 on M_DEV0 and M_DEV1 ( LVDS_AUX_IN1 ). M_AUX_IO8 on M_DEV1 ( P1_TTL_AUX_IO_0 ). Pin information Connector: HDR/SDR (1)&nbsp;Pin: 3+, 16- Direction Output User-bit information MIL user-bit #: M_USER_BIT_CC_IO0/M_USER_BIT_CC_IO1; Digitizer device #: M_DEV1; Timer information Timer: M_TIMER1/M_TIMER2; Digitizer device #: M_DEV1; Hardware manual signal name CC3 (1) MIL I/O #: M_CC_IO4 Camera control output 4 for acquisition path 1, which supports: timer output, user output, VSYNC, HSYNC, clock output, or rerouting of specific auxiliary input signals. Only the following auxiliary input signals can be rerouted to this output signal: M_AUX_IO0 on M_DEV0 and M_DEV1 ( OPTO_AUX_IN0 ). M_AUX_IO1 on M_DEV0 and M_DEV1 ( OPTO_AUX_IN1 ). M_AUX_IO2 on M_DEV0 and M_DEV1 ( TTL_AUX_IO_0 ). M_AUX_IO4 on M_DEV0 and M_DEV1 ( LVDS_AUX_IN0 ). M_AUX_IO5 on M_DEV0 and M_DEV1 ( LVDS_AUX_IN1 ). M_AUX_IO8 on M_DEV1 ( P1_TTL_AUX_IO_0 ). Pin information Connector: HDR/SDR (1)&nbsp;Pin: 15+, 2- Direction Output User-bit information MIL user-bit #: M_USER_BIT_CC_IO0/M_USER_BIT_CC_IO1; Digitizer device #: M_DEV1; Timer information Timer: M_TIMER1/M_TIMER2; Digitizer device #: M_DEV1; Hardware manual signal name CC4 (1) expandTable(\"mil_io_information_show_all\"); 1 The user-bit number in the Installation and Hardware Reference manual is just a rank; use the MIL user-bit number instead. Matrox Solios eV-CLB and eV-CLF connectors and signal names Board connectors Signal names and their matching MIL constants ",
      "wordCount": 3895,
      "subEntries": []
    },
    {
      "id": "BSN_solios_ev-cl_Matrox_Solios_eV-CL_board_flow_diagrams",
      "version": null,
      "title": "Matrox Solios eV-CL board flow diagrams",
      "subTitles": [
        "Matrox Solios eV-CLB and eV-CLBL",
        "Matrox Solios eV-CLF"
      ],
      "location": "MIL Hardware-specific Notes",
      "pageURL": "content\\BoardSpecificNotes\\solios_ev-cl\\Matrox_Solios_eV-CL_board_flow_diagrams.htm",
      "text": " Matrox Solios eV-CL board flow diagrams This section contains data flow diagrams for Matrox Solios boards. Matrox Solios eV-CLB and eV-CLBL The following flow diagram shows Matrox Solios eV-CLB in dual-Base configuration. The following flow diagram shows Matrox Solios eV-CLBL in dual-Base configuration. The following flow diagram shows Matrox Solios eV-CLB in single-Medium configuration. The following flow diagram shows Matrox Solios eV-CLBL in single-Medium configuration. Matrox Solios eV-CLF The following flow diagram shows Matrox Solios eV-CLF in single-Medium and single-Full configuration. The following flow diagram shows Matrox Solios eV-CLFL in single-Medium and single-Full configuration. Matrox Solios eV-CL board flow diagrams Matrox Solios eV-CLB and eV-CLBL Matrox Solios eV-CLF ",
      "wordCount": 110,
      "subEntries": []
    }
  ]
}]