[{
  "id": "BSN_gentl",
  "version": "2024020714",
  "title": "Matrox GenTL Consumer driver",
  "subTitles": null,
  "location": "MIL Hardware-specific Notes",
  "pageURL": "content\\BoardSpecificNotes\\gentl\\ChapterInformation.htm",
  "text": " Matrox GenTL Consumer driver This chapter discusses features of MIL that are particular to the Matrox GenTL Consumer driver, and optimizing its performance. Information regarding using this driver with specific functions is integrated into the functions' reference topics. Refer to the Matrox GenTL driver release notes for any additions/modifications to this chapter or the MIL Reference. Matrox GenTL Consumer (library) overview Using Matrox GenTL Consumer (library) with MIL GenICam-compliant device description files Allocating MIL GenTL systems Mixed-type GenTL Producers Controlling and Inquiring GenTL features MIL buffer handling with the Matrox GenTL Consumer (library) General GenTL Producer configuration and installation requirements GenIcam SFNC ",
  "wordCount": 104,
  "subEntries": [
    {
      "id": "BSN_gentl_Matrox_GenTL_specific_features",
      "version": null,
      "title": "Matrox GenTL Consumer (library) overview",
      "subTitles": null,
      "location": "MIL Hardware-specific Notes",
      "pageURL": "content\\BoardSpecificNotes\\gentl\\Matrox_GenTL_specific_features.htm",
      "text": " Matrox GenTL Consumer (library) overview The Matrox GenTL Consumer (library) allows you to use a third-party GenTL Producer (library) with MIL. The Matrox GenTL Consumer (based on the GenICam GenTL standard) provides a software-generic way to communicate with one or more third-party devices through multiple interface technologies (such as, using GigE Vision, Camera Link, USB3 Vision, or a custom/non-standard interface to connect the camera and the Host). The Matrox GenTL Consumer requires you to first install a third-party, vendor-supplied, standard compliant, GenTL Producer. Once installed, the MILConfig utility lists the available GenTL Producer libraries. It is possible that multiple Producer libraries can access the same device (camera). For example, if you install multiple GenTL Producer libraries for GigE Vision-compliant devices (from different vendors), it is possible that any one of them can be used to grab from a GigE Vision-compliant device. A GenTL Producer is a software library implementing the GenTL interface to enable an application or a software library to access and configure hardware in a generic way (for example, to stream image data from a camera). The MIL GenTL Consumer is a software library that communicates with multiple GenTL Vision-compliant devices via the specified GenTL Producer. You can install more than one GenTL Producer on your computer. These libraries are indexed and sorted by MIL. You can inquire the indices of the installed GenICam GenTL Producers in the MILConfig utility, or inquire the count of different GenTL Producers installed using MappInquire() with M_GENTL_PRODUCER_COUNT. If you are using a GigE Vision or USB3 Vision-compliant device, or a camera connected to a Matrox frame grabber, you should use the native library for maximum performance (rather than the Matrox GenTL Consumer). The Matrox GenTL Consumer should be used with devices (cameras) that use a third-party, proprietary communication protocol, and for which the vendor has supplied a GenTL Producer. Matrox GenTL Consumer (library) overview ",
      "wordCount": 314,
      "subEntries": []
    },
    {
      "id": "BSN_gentl_Using_Matrox_GenTL_with_MIL",
      "version": null,
      "title": "Using Matrox GenTL Consumer (library) with MIL",
      "subTitles": [
        "GenICam-compliant device description files",
        "Allocating MIL GenTL systems",
        "Mixed-type GenTL Producers",
        "Controlling and Inquiring GenTL features",
        "MIL buffer handling with the Matrox GenTL Consumer (library)",
        "General GenTL Producer configuration and installation requirements",
        "GenIcam SFNC"
      ],
      "location": "MIL Hardware-specific Notes",
      "pageURL": "content\\BoardSpecificNotes\\gentl\\Using_Matrox_GenTL_with_MIL.htm",
      "text": " Using Matrox GenTL Consumer (library) with MIL To use your Matrox GenTL Consumer (library) with MIL, you must first install at least one third-party GenTL Producer (library). The MIL GenTL Consumer communicates with the third-party GenTL Producer that allows you to configure or grab from your compliant devices (camera). Matrox Feature Browser can access all of the GenICam GenTL-compliant device description files (XML), providing an interface to view and change the system information, digitizer, device (camera), and buffer. GenICam-compliant device description files The Matrox GenTL Producer (library) uses five distinct sets of GenICam-compliant device description files (XML). Per MIL system: GenTL system configuration information. The system refers to the allocated GenTL Producer. There is one GenTL system configuration information file per GenTL Producer. GenTL interface configuration information. The interface, in this case, is the type of physical connection (port) between the Host and the device (such as Camera Link, Ethernet, or USB3 connections). Note that this could include auxiliary I/O signals such as trigger input, user input or user output, depending on the signal. Per MIL digitizer: GenTL device configuration information. The GenTL device is a proxy to the remote device controlling the GenTL Producer's view of the device. Typically, there is one GenTL device configuration information file for each digitizer allocated on your MIL system. GenTL remote device configuration information. The GenTL remote device is your actual device (camera). Typically, there is one remote device configuration information file for each camera allocated to a specific MIL digitizer. With MIL, this is a one-to-one relationship. GenTL stream configuration information. The GenTL stream is the data stream generated by your device (camera) is handled by the GenTL Producer. Typically, there is one GenTL stream configuration information file per data stream between your device and your digitizer. Per MIL buffer: GenTL buffer configuration information (optional). The GenTL buffer is how the GenTL Consumer handles buffers. Typically, there is one GenTL buffer configuration information file per acquisition target (that is, per MIL buffer used by your MIL system). Allocating MIL GenTL systems You can then allocate a MIL GenTL system using MsysAlloc() with M_SYSTEM_GENTL. Set SystemNum to M_DEVn + M_GENTL_PRODUCER(n), where M_DEVn corresponds to the rank of the adapter board and M_GENTL_PRODUCER(n) specifies the index of the GenTL Producer to allocate. When you install more than one GenTL Producer on your computer, the GenTL Producers are indexed and sorted by MIL. You can establish the number of GenTL Producers, using MappInquire() with M_GENTL_PRODUCER_COUNT or using the General Default Values page of the MILConfig utility. Allocating a GenTL system opens general communication with all connected third-party devices that can communicate with the GenTL Producer. You can then allocate a digitizer for each device (camera) using MdigAlloc(). You can allocate more than one MIL GenTL system (MsysAlloc() with M_SYSTEM_GENTL) in a process (executable); and each must have a unique SystemNum. Note that for GigE Vision, USB3 Vision, and custom transport layer type Producers, you must only use M_DEV0 to allocate the GenTL system. Allocating one Producer will discover all devices of this type regardless of their adapter board. For all other transport layer type Producers, M_DEVn targets the nth frame grabber of that type. For example, you can allocate two systems that use the same GenTL Producer but target different frame grabbers that have the same type as the Producer. GenICam GenTL Producers of mixed-type can be used multiple times; the mixed-type supports multiple interface technologies, and can be used once per interface type. For example, a mixed-type library can support both a proprietary Ethernet (non-GigE Vision) camera and a proprietary USB (non-USB3 Vision) camera; therefore, a GenICam GenTL mixed-type Producer can be allocated twice. Otherwise, a GenTL Producer can only be used once per MIL application. Mixed-type GenTL Producers When allocating a MIL GenTL system for a mixed-type GenTL Producer, you can also set the InitFlag parameter to the type of interface technology that you want to use. For example, if you have a mixed-type GenTL Producer that supports both GigE Vision and USB3 Vision, but you only want GigE Vision interfaces, set the InitFlag to M_GEV. If you do not specify an interface type, all interface types supported by the Producer are used. Controlling and Inquiring GenTL features In most cases, you should control and inquire GenTL features using the conventional MIL functions (for example, MsysControl() / MsysInquire(), MdigControl() / MdigInquire(), and MbufControl() / MbufInquire()). However, some GenTL-compliant device have features that can only be accessed using MsysControlFeature() / MsysInquireFeature(), MdigControlFeature() / MdigInquireFeature(), and MbufControlFeature() / MbufInquireFeature(). For more information about accessing the features of your GenTL-compliant device, refer to the Using MIL with GenICam section of Chapter 27: Grabbing with your digitizer. MIL buffer handling with the Matrox GenTL Consumer (library) The GenICam GenTL standard specifies that a buffer must be announced before it can be used to receive a grabbed image. To overcome this requirement, the Matrox GenTL Consumer automatically announces ten internal buffers when any digitizer is allocated (using MdigAlloc()). Note that allocated grab buffers will also be automatically announced to the Producer when MdigGrab(), MdigGrabContinuous(), or MdigProcess() is called. This allows you to use MdigGrab(), MdigGrabContinuous(), or MdigProcess() to capture frames. These functions use internal buffers to buffer the incoming data before it is copied to the specified MIL buffer, or if a grab cannot be made directly to the allocated buffer. For example, if you allocate a 3-band color grab buffer and the device (camera) outputs a monochrome image, the image will be grabbed into an internal buffer and copied into the allocated 3-band color buffer. Note that you are still require to allocate and specify a MIL buffer. Note that when using MdigProcess(), each buffer queued is automatically announced by MIL. Note that when using MdigGrab(), there is a delay announcing the buffer because pending grabs must finish before announcing a new buffer. You can manually announce buffers using MdigControl() with M_GENTL_ANNOUNCE_BUFFER. When using MdigGrabContinuous() or MdigProcess(), there is no delay present; this is because grabs are not immediately executed when these functions are called. When you are finished with the buffer, revoke it using MdigControl() with M_GENTL_REVOKE_BUFFER before freeing it. Note that if you use M_GENTL_ANNOUNCE_BUFFER, MIL will not use its internal buffers. For any additions/modifications to this chapter, refer to the Matrox GenTL driver release notes. General GenTL Producer configuration and installation requirements The GenTL Producer communicates with and is used by the Matrox GenTL Consumer (library) to configure or grab from your GenICam-compliant devices (camera). You can configure a GenTL Producer in the MILConfig utility by expanding the General item in the tree structure and navigating to the Default Values subitem where you can select the GenTL Producer number that corresponds to the correct GenTL Producer library. Alternatively, you can specify the GenTL Producer to allocate the MIL GenTL system by setting SystemNum to M_DEVn + M_GENTL_PRODUCER(n), where M_DEVn corresponds to the rank of the board and M_GENTL_PRODUCER(n) specifies the index of the GenTL Producer to allocate. You can determine the number of GenTL libraries installed on your computer, using MappInquire() with M_GENTL_PRODUCER_COUNT. If the expected GenTL Producer library is not visible in the MILConfig utility, the cause is typically that the device's GenTL Producer file (CTI file extension) or the GENICAM_GENTL64_PATH environment variable does not include the path to the correct CTI file. Make sure that the GenTL Producer is installed either by the software provided with the device, or install a compatible generic GenTL Producer. In addition, verify that the GENICAM_GENTL64_PATH environment variable has the appropriate CTI file path. Each directory that you list in the environment variable must contain a CTI file (GenTL Producer). Note that GenTL Producer information is highly dependent on the vendor of the GenICam-compliant device. For specific information related to your device, refer to the device's documentation. GenIcam SFNC For more information on the GenICam GenTL standard features available, refer to GenICam's standard feature naming convention (SFNC), available on the GenICam website at: https://www.emva.org/standards-technology/genicam/. Additional GenICam GenTL SFNC-extension features might be available; check your camera's manual and Matrox Feature Browser for details. Note that the standard features specified in the GenICam SFNC work with the MIL Digitizer module. Using Matrox GenTL Consumer (library) with MIL GenICam-compliant device description files Allocating MIL GenTL systems Mixed-type GenTL Producers Controlling and Inquiring GenTL features MIL buffer handling with the Matrox GenTL Consumer (library) General GenTL Producer configuration and installation requirements GenIcam SFNC ",
      "wordCount": 1404,
      "subEntries": []
    }
  ]
}]