[{
  "id": "BSN_Concord_PoE",
  "version": "2024020714",
  "title": "Matrox Concord PoE",
  "subTitles": null,
  "location": "MIL Hardware-specific Notes",
  "pageURL": "content\\BoardSpecificNotes\\Concord_PoE\\ChapterInformation.htm",
  "text": " Matrox Concord PoE This chapter discusses features of MIL that are particular to Matrox Concord PoE base model and Matrox Concord PoE with ToE. Matrox Concord PoE information regarding specific functions is integrated into the functions' reference topics. Matrox Concord PoE overview Summary of Matrox Concord PoE features Note on nomenclature Using Matrox Concord PoE with MIL Using the Advanced I/O Engine of Matrox Concord PoE with ToE Using a MIL Concord PoE system with the Matrox Concord PoE base model Sending a Trigger-over-Ethernet packet without Host intervention Sending a Trigger-over-Ethernet packet as an action command Sending a Trigger-over-Ethernet packet as a GigE Vision software trigger Matrox Concord PoE with ToE connectors and signal names Board connectors Signal names and their matching MIL constants Matrox Concord PoE board flow diagrams ",
  "wordCount": 132,
  "subEntries": [
    {
      "id": "BSN_Concord_PoE_Matrox_Concord_POE_specific_features",
      "version": null,
      "title": "Matrox Concord PoE overview",
      "subTitles": [
        "Summary of Matrox Concord PoE features",
        "Note on nomenclature"
      ],
      "location": "MIL Hardware-specific Notes",
      "pageURL": "content\\BoardSpecificNotes\\Concord_PoE\\Matrox_Concord_POE_specific_features.htm",
      "text": " Matrox Concord PoE overview The Matrox Concord PoE family consists of two models: the Matrox Concord PoE base model and Matrox Concord PoE with ToE. Matrox Concord PoE base model is a Gigabit Ethernet network interface board that provides optimum support for interfacing with GigE Vision cameras and supplies Power-over-Ethernet (PoE) to GigE Vision cameras that support PoE. There are two versions of the Matrox Concord PoE base model: the Dual-port version and the Quad-port version. Matrox Concord PoE with ToE includes all the features of the Matrox Concord PoE base model, with the addition of an Advanced I/O Engine. The Advanced I/O Engine provides use of 8 auxiliary signals, and includes I/O command lists, timers, quadrature decoders, user outputs, and a Trigger-over-Ethernet (ToE) module. The Trigger-over-Ethernet module can transmit a Trigger-over-Ethernet packet, either as an action command or a GigE Vision software trigger, upon reception of an internal or external event. There are two versions of Matrox Concord PoE with ToE: the Dual-port version and the Quad-port version. In addition to being prelicensed for use with the MIL drivers for GigE Vision cameras, the Matrox Concord PoE board can act as a fingerprint for licensing supplemental MIL functionality. The board can also store a supplemental MIL license, which facilitates the process of moving to a new computer. Summary of Matrox Concord PoE features The following table outlines the features currently available for Matrox Concord PoE family. Matrox Concord PoE base model Matrox Concord PoE with ToE Can access GenICam camera features using MdigControlFeature() / MdigInquireFeature() 1 Yes Yes On-board memory N/A N/A Number of acquisition ports 2 (Dual) or 4 (Quad) 2 (Dual) or 4 (Quad) Number of auxiliary signals 0 8 (6 in, 2 out) Trigger-over-Ethernet (ToE) module No Yes Number of timers 0 16 Number of quadrature decoders for input from linear or rotary encoders 0 2 Number of I/O command lists 0 2 Number of reference latches per I/O command list 0 4 Power over Ethernet (PoE) support Yes Yes 1 When using a GigE Vision system (M_SYSTEM_GIGE_VISION, using MsysAlloc()). Note on nomenclature This manual refers to all models of Matrox Concord PoE as the Matrox Concord PoE. When necessary, this manual distinguishes between the boards using their full names (Matrox Concord PoE base model and Matrox Concord PoE with ToE). Matrox Concord PoE overview Summary of Matrox Concord PoE features Note on nomenclature ",
      "wordCount": 400,
      "subEntries": []
    },
    {
      "id": "BSN_Concord_PoE_Using_Matrox_Concord_POE_with_MIL",
      "version": null,
      "title": "Using Matrox Concord PoE with MIL",
      "subTitles": [
        "Using the Advanced I/O Engine of Matrox Concord PoE with ToE"
      ],
      "location": "MIL Hardware-specific Notes",
      "pageURL": "content\\BoardSpecificNotes\\Concord_PoE\\Using_Matrox_Concord_POE_with_MIL.htm",
      "text": " Using Matrox Concord PoE with MIL To use Matrox Concord PoE with MIL for acquisition, you must allocate a MIL GigE Vision system (M_SYSTEM_GIGE_VISION), using MsysAlloc(). This allocation opens communication with GigE Vision compliant cameras (through one or more Gigabit Ethernet network adapters in your computer). You can then access and grab from multiple connected GigE Vision cameras by allocating a digitizer for each connected camera (using MdigAlloc() with M_DEVn). Each process (executable) can allocate only one MIL GigE Vision system. Each camera can be used by one process (executable) at a time. For additional information, refer to the Matrox GigE Vision driver chapter in the MIL Hardware-specific Notes. To use other functionality available on Matrox Concord PoE with ToE or inquire about the status (for example, BoardType) of either model of the board, you must allocate a MIL Concord PoE system, using MsysAlloc() with M_SYSTEM_CONCORD_POE. Be aware that to access the MIL license that is included on the Matrox Concord PoE board, you must install the Matrox Concord PoE driver. Refer to the Matrox Concord PoE release notes for any additions/modifications to the MIL Hardware-specific Notes in this chapter or in the MIL Reference. Using the Advanced I/O Engine of Matrox Concord PoE with ToE Matrox Concord PoE with ToE has an Advanced I/O Engine that controls the auxiliary I/O interface. The engine includes 16 timers, 2 rotary decoders, 2 I/O command lists, a user-output register, 2 auxiliary output signals, 6 auxiliary input signals and a Trigger-over-Ethernet (ToE) module. To route I/O signals, configure interrupts, and set the mode of an auxiliary signal, use MsysControl(). To inquire this information, use MsysInquire() For more information on some of these features, refer to Chapter 56: I/O signals and communicating with external devices. For information on how to use the ToE module to send a Trigger-over-Ethernet packet (as an action command or GigE Vision software trigger) to the camera, refer to the Sending a Trigger-over-Ethernet packet without Host intervention section later in this chapter. Using Matrox Concord PoE with MIL Using the Advanced I/O Engine of Matrox Concord PoE with ToE ",
      "wordCount": 351,
      "subEntries": []
    },
    {
      "id": "BSN_Concord_PoE_Using_a_MIL_Concord_PoE_system_with_the_Matrox_Concord_PoE_base_model",
      "version": null,
      "title": "Using a MIL Concord PoE system with the Matrox Concord PoE base model",
      "subTitles": null,
      "location": "MIL Hardware-specific Notes",
      "pageURL": "content\\BoardSpecificNotes\\Concord_PoE\\Using_a_MIL_Concord_PoE_system_with_the_Matrox_Concord_PoE_base_model.htm",
      "text": " Using a MIL Concord PoE system with the Matrox Concord PoE base model To use Matrox Concord PoE for acquisition, you must allocate and use a MIL GigE Vision system (MsysAlloc() with M_SYSTEM_GIGE_VISION); refer to information denoted for a GigE Vision system. You only need to allocate and use a MIL Concord PoE system (MsysAlloc() with M_SYSTEM_CONCORD_POE) to use the other functionality on the board and to inquire about the board itself. This means that you rarely use a MIL Concord PoE system with the Matrox Concord PoE base model. For this reason, in the reference, information pertinent to using a MIL Concord PoE system is identified with a column for the Matrox Concord PoE with ToE; most of the functions and constants are typically only available to this model. If the information is applicable to the Matrox Concord PoE base model, there will be a note included to specify this. The following are the only functions and constants that can be used with a MIL Concord PoE system (using MsysAlloc() with M_SYSTEM_CONCORD_POE) when allocated for a Matrox Concord PoE base model: Function Constants supported MsysAlloc() M_SYSTEM_CONCORD_POE with M_DEVn or user-defined board name. MsysFree() All functionality is available. MsysControl() M_DEVICE_NAME, M_POWER_OVER_CABLE. MsysInquire() M_BOARD_TYPE, M_DEVICE_NAME, M_DEVICE_NAME_MAX_SIZE, M_POWER_OVER_CABLE, M_SERIAL_NUMBER, M_SERIAL_NUMBER, M_SYSTEM_DESCRIPTOR, M_SYSTEM_DESCRIPTOR, M_SYSTEM_TYPE. Action commands are also supported on Matrox Concord PoE base model; however, you need to use a MIL GigE Vision system (using MsysAlloc() with M_SYSTEM_GIGE_VISION). Using a MIL Concord PoE system with the Matrox Concord PoE base model ",
      "wordCount": 251,
      "subEntries": []
    },
    {
      "id": "BSN_Concord_PoE_Sending_a_ToE_trigger_packet_without_Host_intervention",
      "version": null,
      "title": "Sending a Trigger-over-Ethernet packet without Host intervention",
      "subTitles": [
        "Sending a Trigger-over-Ethernet packet as an action command",
        "Sending a Trigger-over-Ethernet packet as a GigE Vision software trigger"
      ],
      "location": "MIL Hardware-specific Notes",
      "pageURL": "content\\BoardSpecificNotes\\Concord_PoE\\Sending_a_ToE_trigger_packet_without_Host_intervention.htm",
      "text": " Sending a Trigger-over-Ethernet packet without Host intervention Although both models of Matrox Concord PoE support sending Trigger-over-Ethernet packets as described in Introducing action commands, the Matrox Concord PoE with ToE model can also do so without Host intervention. Matrox Concord PoE with ToE includes a Trigger-over-Ethernet (ToE) module that can send a Trigger-over-Ethernet packet (action command or GigE Vision software trigger) over Ethernet, upon reception of an internal or external event, without Host intervention. The ToE module reduces latency, jitter, and is useful for applications that require a high degree of trigger accuracy. Since most GigE Vision cameras include a hardware implementation for receiving action commands, sending an action command is likely to provide a better result than sending a GigE Vision software trigger. For an explanation on action commands, see the Introducing action commands subsection of the Triggering simultaneous actions in multiple GigE Vision cameras section of the Matrox GigE Vision driver chapter in the MIL Hardware-specific Notes. If your camera does not support action commands, or does not have hardware implemented for receiving them, then using a GigE Vision software trigger is an alternative option. Sending a Trigger-over-Ethernet packet as an action command To configure the ToE module to send a Trigger-over-Ethernet packet as an action command, you follow similar steps as when sending an action command in software. However, you set up the action command on a MIL Concord PoE system instead of a MIL GigE system; you still set up the cameras using digitizers allocated on a MIL GigE system. Specifically: Allocate a MIL Concord PoE system, using MsysAlloc() with M_SYSTEM_CONCORD_POE. Allocate a MIL GigE system, using MsysAlloc() with M_SYSTEM_GIGE_VISION. Then, allocate a digitizer on this system for each GigE camera that is physically connected to the Matrox Concord PoE and will receive the action command, using MdigAlloc(). Set up the action command on the MIL Concord PoE system. To do so, make successive calls to MsysControl() with the MIL Concord PoE system identifier and each of the following: • M_GC_ACTION_DEVICE_KEY to identify the group of cameras to receive the action command. • M_GC_ACTION_GROUP_MASK to limit which cameras in the group should generate the action signal upon receiving the command. Set this to 0xFFFFFFFF if all cameras in the group should generate the action signal. • M_GC_ACTION_GROUP_KEY to specify the key corresponding to the internal action signal on the camera. • M_TRIGGER_SOURCE to specify the event that should cause the action command to be sent (for example, an auxiliary input signal). Set up the GigE cameras to receive the action command, using successive calls to MdigControlFeature() with their digitizer identifiers (allocated on the MIL GigE system) and each of the following features: ActionDeviceKey, ActionGroupMask, and ActionGroupKey. Set up the cameras to acquire the next frame upon receiving the action command. To do so, make successive calls to MdigControlFeature() with the camera's corresponding digitizer and each of the following features: • The TriggerSelector feature to select the type of trigger to configure (for example, FrameStart). • The ActionSelector feature to associate an internal action signal (for example, Action0) with the action group key. • The TriggerSource feature to set the trigger source of the frame start to the internal action signal (for example, Action0). • The TriggerMode feature to activate triggering the frame start upon the reception of the action command. Register with MIL the cameras associated with the action command. To do so, make successive calls to MsysControl() with the MIL Concord PoE system, M_ADD_DESTINATION, and each of the MIL digitizers. MIL uses this information to know on which port to send the packet and to track and make use of the camera's action results. Activate sending a Trigger-over-Ethernet packet as an action command upon the reception of the specified trigger event (for example, an auxiliary input signal). Use MsysControl() with M_TRIGGER_STATE set to M_ENABLE. The following code snippet demonstrate how to set up the ToE module on Matrox Concord PoE with ToE to send an action command, and how to set the camera to grab a frame upon receiving the action command: void SetupToEUsingActions(MIL_ID MilConcordPoESystem, const std::vector&lt;ToEDevice&gt;&amp; Devices) { MosPrintf(MIL_TEXT(\"\\nSetting-up GigE Vision devices and the Matrox ConcordPoE board.\\n\\n\")); /* Set-up action command on Matrox Concord PoE with ToE */ MIL_INT DeviceKey = 0x56781234, GroupKey = 0x24, GroupMask = 0xFFFFFFFF; MsysControl(MilConcordPoESystem, M_GC_ACTION0 + M_GC_ACTION_DEVICE_KEY, DeviceKey); MsysControl(MilConcordPoESystem, M_GC_ACTION0 + M_GC_ACTION_GROUP_MASK, GroupMask); MsysControl(MilConcordPoESystem, M_GC_ACTION0 + M_GC_ACTION_GROUP_KEY, GroupKey); MsysControl(MilConcordPoESystem, M_GC_ACTION0 + M_TRIGGER_SOURCE, M_AUX_IO2); /* Set-up action command on the GigE Vision devices */ for (size_t i = 0; i &lt; Devices.size(); i++) { MIL_INT64 ActionNumber = 0; MdigControlFeature(Devices[i].MilDigitizerId, M_FEATURE_VALUE, MIL_TEXT(\"ActionSelector\"), M_TYPE_INT64, &amp;ActionNumber); MdigControlFeature(Devices[i].MilDigitizerId, M_FEATURE_VALUE, MIL_TEXT(\"ActionDeviceKey\"), M_TYPE_INT64, &amp;DeviceKey); MdigControlFeature(Devices[i].MilDigitizerId, M_FEATURE_VALUE, MIL_TEXT(\"ActionGroupMask\"), M_TYPE_INT64, &amp;GroupMask); MdigControlFeature(Devices[i].MilDigitizerId, M_FEATURE_VALUE, MIL_TEXT(\"ActionGroupKey\"), M_TYPE_INT64, &amp;GroupKey); MdigControlFeature(Devices[i].MilDigitizerId, M_FEATURE_VALUE, MIL_TEXT(\"TriggerSelector\"), M_TYPE_STRING, MIL_TEXT(\"FrameStart\")); MdigControlFeature(Devices[i].MilDigitizerId, M_FEATURE_VALUE, MIL_TEXT(\"TriggerSource\"), M_TYPE_STRING, MIL_TEXT(\"Action0\")); MdigControlFeature(Devices[i].MilDigitizerId, M_FEATURE_VALUE, MIL_TEXT(\"TriggerMode\"), M_TYPE_STRING, MIL_TEXT(\"On\")); MsysControl(MilConcordPoESystem, M_GC_ACTION0 + M_ADD_DESTINATION, Devices[i].MilDigitizerId); } } Sending a Trigger-over-Ethernet packet as a GigE Vision software trigger To configure the ToE module to send a Trigger-over-Ethernet packet as a GigE Vision software trigger, do the following: Allocate a MIL Concord PoE system, using MsysAlloc() with M_SYSTEM_CONCORD_POE. Allocate a MIL GigE Vision system, using MsysAlloc() with M_SYSTEM_GIGE_VISION. Then, allocate a digitizer on this system for each GigE Vision camera that should receive the GigE Vision software trigger, using MdigAlloc(). Set up the ToE module to send a Trigger-over-Ethernet packet, as a GigE Vision software trigger, upon a specified event. To do so, make successive calls to MsysControl() with the MIL Concord PoE system identifier and each of the following: • M_GC_TRIGGER_SOFTWARE0 + M_GC_TRIGGER_SELECTOR to specify the type of trigger that should take place on the cameras upon receiving the Trigger-over-Ethernet packet (for example, frame start). • M_GC_TRIGGER_SOFTWARE0 + M_TRIGGER_SOURCE to specify the event that should cause the Trigger-over-Ethernet packet (GigE Vision software trigger) to be sent (for example, an auxiliary input signal). Set up the cameras to receive the Trigger-over-Ethernet packets, using successive calls to MdigControlFeature() with their digitizer identifiers (allocated on the MIL GigE Vision system) and each of the following features: • The TriggerSelector feature to select the type of trigger to configure (for example, FrameStart). • The TriggerSource feature to set the trigger source of the frame start to Software. • The TriggerMode feature to activate triggering the frame start upon the reception of the GigE Vision software trigger. Specify the cameras that should receive the GigE Vision software trigger. To do so, make successive calls to MsysControl() with the MIL Concord PoE system, M_ADD_DESTINATION, and each of the MIL digitizers. Activate sending a Trigger-over-Ethernet packet as a GigE Vision software trigger upon the reception of the specified trigger event (for example, an auxiliary input signal). Use MsysControl with M_TRIGGER_STATE set to M_ENABLE. The following code snippet demonstrate how to set up the ToE module on Matrox Concord PoE with ToE to send a GigE Vision software trigger, and how to set the camera to grab a frame upon receiving the GigE Vision software trigger: void SetupToEUsingSoftware(MIL_ID MilConcordPoESystem, const std::vector&lt;ToEDevice&gt;&amp; Devices) { MosPrintf(MIL_TEXT(\"\\nSetting-up GigE Vision devices and the Matrox ConcordPoE board.\\n\\n\")); /* Set-up GigE software trigger on Matrox Concord PoE with ToE */ MsysControl(MilConcordPoESystem, M_GC_TRIGGER_SOFTWARE0 + M_TRIGGER_SOURCE, M_TIMER1); MsysControl(MilConcordPoESystem, M_GC_TRIGGER_SOFTWARE0 + M_GC_TRIGGER_SELECTOR, MIL_TEXT(\"FrameStart\")); /* Set-up GigE software trigger on the GigE Vision devices */ for (size_t i = 0; i &lt; Devices.size(); i++) { MdigControlFeature(Devices[i].MilDigitizerId, M_FEATURE_VALUE, MIL_TEXT(\"TriggerSelector\"), M_TYPE_STRING, MIL_TEXT(\"FrameStart\")); MdigControlFeature(Devices[i].MilDigitizerId, M_FEATURE_VALUE, MIL_TEXT(\"TriggerSource\"), M_TYPE_STRING, MIL_TEXT(\"Software\")); MdigControlFeature(Devices[i].MilDigitizerId, M_FEATURE_VALUE, MIL_TEXT(\"TriggerMode\"), M_TYPE_STRING, MIL_TEXT(\"On\")); MsysControl(MilConcordPoESystem, M_GC_TRIGGER_SOFTWARE0 + M_ADD_DESTINATION, Devices[i].MilDigitizerId); } MsysControl(MilConcordPoESystem, M_GC_TRIGGER_SOFTWARE0 + M_TRIGGER_STATE, M_ENABLE); } Sending a Trigger-over-Ethernet packet without Host intervention Sending a Trigger-over-Ethernet packet as an action command Sending a Trigger-over-Ethernet packet as a GigE Vision software trigger ",
      "wordCount": 1263,
      "subEntries": []
    },
    {
      "id": "BSN_Concord_PoE_Matrox_Concord_POE_connectors_and_signal_names",
      "version": null,
      "title": "Matrox Concord PoE with ToE connectors and signal names",
      "subTitles": [
        "Board connectors",
        "Signal names and their matching MIL constants"
      ],
      "location": "MIL Hardware-specific Notes",
      "pageURL": "content\\BoardSpecificNotes\\Concord_PoE\\Matrox_Concord_POE_connectors_and_signal_names.htm",
      "text": " Matrox Concord PoE with ToE connectors and signal names This section serves as a reference to match Matrox Concord PoE with ToE's connectors and auxiliary signals with MIL information, such as MIL auxiliary signal numbers. To set/inquire all the settings for this board's auxiliary signals (for example, signal routing and timer settings), use MsysControl() / MsysInquire(), respectively. Auxiliary I/O signals can have one or more functionalities (for example, outputting the state of an I/O command register bit, timer output, or user output, depending on the signal). Their possible functionalities are described in their description in the pinout table below. Note that, there is no limit to the number of events that can be triggered simultaneously using the auxiliary input signals, nor is there a restriction on which auxiliary signal can be used to trigger the event. Only those auxiliary signals that have matching MIL information are included in this section. For information on internal connectors and a comprehensive list of all available input and output signals, refer to the board's installation and hardware reference manual. Board connectors The Matrox Concord PoE with ToE board provides an external auxiliary I/O connector and Gigabit Ethernet connectors. Only the following connectors have auxiliary signals with matching MIL information. Connector Name Connector Abbreviation Image Description External auxiliary I/O connector HD-15 The external auxiliary I/O connectors is used to transmit/receive auxiliary signals from the Advanced I/O engine. Signal names and their matching MIL constants The table below lists the auxiliary signals with their associated MIL information. Sort by: MIL I/O information Connector and pin Hardware manual signal name Filter by: Show all Direction: input Direction: output Direction: input/output Timers Triggers Tables: Expanded Collapsed System Description MIL I/O # Pin information Direction User-bit information Trigger information Timer information Hardware manual signal name System Indicates the following. MIL I/O #: M_AUX_IO0 Opto-isolated auxiliary signal 0 (output), which supports: user output, timer output, and receiving the state of an I/O command register bit. Pin information Connector: HD-15&nbsp;Pin: 12+, 11- Direction Output User-bit information MIL user-bit #: M_USER_BIT0; Timer information Timer: M_TIMERn Hardware manual signal name AUX_OPTOIND_OUT0 MIL I/O #: M_AUX_IO1 Opto-isolated auxiliary signal 1 (output), which supports: user output, timer output, and outputting the state of an I/O command register bit. Pin information Connector: HD-15&nbsp;Pin: 6+, 1- Direction Output User-bit information MIL user-bit #: M_USER_BIT1; Timer information Timer: M_TIMERn Hardware manual signal name AUX_OPTOIND_OUT1 MIL I/O #: M_AUX_IO2 Opto-isolated auxiliary signal 2 (input), which supports: user input, I/O command list counter source, timer clock, timer arm, reference latch trigger, quadrature input bit 0 or 1, or quadrature decoder counter reset source. Pin information Connector: HD-15&nbsp;Pin: 5+, 4 (AUX_OPTOIND_IN_COM_2-3) Direction Input Timer information Timer: M_TIMERn Hardware manual signal name AUX_OPTOIND_IN2 MIL I/O #: M_AUX_IO3 Opto-isolated auxiliary signal 3 (input), which supports: user input, I/O command list counter source, timer clock, timer arm, reference latch trigger, quadrature input bit 0 or 1, or quadrature decoder counter reset source. Pin information Connector: HD-15&nbsp;Pin: 3+, 4 (AUX_OPTOIND_IN_COM_2-3) Direction Input Timer information Timer: M_TIMERn Hardware manual signal name AUX_OPTOIND_IN3 MIL I/O #: M_AUX_IO4 Opto-isolated auxiliary signal 4 (input), which supports: user input, I/O command list counter source, timer clock, timer arm, reference latch trigger, quadrature input bit 0 or 1, or quadrature decoder counter reset source. Pin information Connector: HD-15&nbsp;Pin: 9+, 8 (AUX_OPTOIND_IN_COM_4-5) Direction Input Timer information Timer: M_TIMERn Hardware manual signal name AUX_OPTOIND_IN4 MIL I/O #: M_AUX_IO5 Opto-isolated auxiliary signal 5 (input), which supports: user input, I/O command list counter source, timer clock, timer arm, reference latch trigger, quadrature input bit 0 or 1, or quadrature decoder counter reset source. Pin information Connector: HD-15&nbsp;Pin: 2+, 8 (AUX_OPTOIND_IN_COM_4-5) Direction Input Timer information Timer: M_TIMERn Hardware manual signal name AUX_OPTOIND_IN5 MIL I/O #: M_AUX_IO6 Opto-isolated auxiliary signal 6 (input), which supports: user input, I/O command list counter source, timer clock, timer arm, reference latch trigger, quadrature input bit 0 or 1, or quadrature decoder counter reset source. Pin information Connector: HD-15&nbsp;Pin: 15+, 14 (AUX_OPTOIND_IN_COM_6-7) Direction Input Timer information Timer: M_TIMERn Hardware manual signal name AUX_OPTOIND_IN6 MIL I/O #: M_AUX_IO7 Opto-isolated auxiliary signal 7 (input), which supports: user input, I/O command list counter source, timer clock, timer arm, reference latch trigger, quadrature input bit 0 or 1, or quadrature decoder counter reset source. Pin information Connector: HD-15&nbsp;Pin: 13+, 14 (AUX_OPTOIND_IN_COM_6-7) Direction Input Timer information Timer: M_TIMERn Hardware manual signal name AUX_OPTOIND_IN7 expandTable(\"mil_io_information_show_all\"); Matrox Concord PoE with ToE connectors and signal names Board connectors Signal names and their matching MIL constants ",
      "wordCount": 747,
      "subEntries": []
    },
    {
      "id": "BSN_Concord_PoE_Matrox_Concord_POE_board_flow_diagrams",
      "version": null,
      "title": "Matrox Concord PoE board flow diagrams",
      "subTitles": null,
      "location": "MIL Hardware-specific Notes",
      "pageURL": "content\\BoardSpecificNotes\\Concord_PoE\\Matrox_Concord_POE_board_flow_diagrams.htm",
      "text": " Matrox Concord PoE board flow diagrams The following diagram illustrates the data flow of the Matrox Concord PoE base model. The following diagram illustrates the data flow of Matrox Concord PoE with ToE. Matrox Concord PoE board flow diagrams ",
      "wordCount": 41,
      "subEntries": []
    }
  ]
}]