[{
  "id": "BSN_geviq",
  "version": "2024020714",
  "title": "Matrox GevIQ",
  "subTitles": null,
  "location": "MIL Hardware-specific Notes",
  "pageURL": "content\\BoardSpecificNotes\\geviq\\ChapterInformation.htm",
  "text": " Matrox GevIQ This section discusses features of MIL that are particular to Matrox GevIQ board and ways that optimize its performance. Matrox GevIQ specific information regarding specific functions is integrated into the functions' reference topics. Refer to the Matrox GevIQ release notes for any additions/modifications to this chapter or the MIL Reference. Matrox GevIQ overview Summary of Matrox GevIQ features Using Matrox GevIQ with MIL Grabbing and the MIL buffer formats to use for each camera pixel format Performing Bayer color conversion in hardware Matrox GevIQ utilities and tools Matrox GevIQ Bench utility Matrox Capture Works Matrox Gecho Matrox GigE Vision discovery service Matrox GevIQ PCIe Information tool Matrox GevIQ System Monitor tool Ethernet switches and Configuring your IP Minimum latency and grabbing all frames Detecting missed frames Efficiently copying an on-board buffer to a destination buffer in Host memory Efficiently converting buffer formats while copying Matrox GevIQ board flow diagram ",
  "wordCount": 153,
  "subEntries": [
    {
      "id": "BSN_geviq_Matrox_GevIQ_overview",
      "version": null,
      "title": "Matrox GevIQ overview",
      "subTitles": [
        "Summary of Matrox GevIQ features"
      ],
      "location": "MIL Hardware-specific Notes",
      "pageURL": "content\\BoardSpecificNotes\\geviq\\Matrox_GevIQ_overview.htm",
      "text": " Matrox GevIQ overview Matrox GevIQ is a smart network adapter that provides two 10 or 25 GbE interfaces (ports) for connection with 1/2.5/5/10/25 Gbits/sec GigE Vision-compatible cameras. Matrox GevIQ is a low-profile PCIe 3.0 x8 board that includes two SFP cages for connecting SFP+/SFP28 transceiver modules. The board can also be used as a standard network interface controller (NIC), and supports MIL licensing fingerprint storage. Matrox GevIQ supports GigE Vision Standard version 2.2, GenICam GenApi version 3.4, and GenICam Standard Feature Naming Convention (SFNC) version 2.6. Matrox GevIQ supports up to two GigE Vision cameras connected directly to the Matrox GevIQ board, or can offload up to 32 stream channels when connected behind a switch. Area-scan and line-scan monochrome or color video sources are supported, as long as they are GigE Vision-compliant (including video sources with a Bayer color filter). GigE Vision streaming protocol packets are offloaded to Matrox GevIQ, where images are reconstructed on-board and then sent to the Host using scatter-gather DMA transfers if the destination buffer is in paged memory. Matrox GevIQ can send data to the Host at a maximum theoretical transfer rate of 8 Gbytes/sec using scatter-gather DMA transfers. Optimum conditions for high speed transfer include using the board in a PCIe 3.0 slot with 8 active lanes and using a 256-byte payload. If the destination buffer is non-paged, then standard DMA transfers are used. To measure the effective available bandwidth of the PCIe slot in your computer with your Matrox GevIQ board, Matrox provides the Matrox GevIQ Bench utility. This utility is accessible using the MILConfig utility. For more information on Matrox GevIQ Bench utility other tools, refer to the Matrox GevIQ utilities and tools section later in this chapter. Summary of Matrox GevIQ features The following table outlines the features currently available for Matrox GevIQ. Matrox GevIQ Can access GenICam camera features using MdigControlFeature() / MdigInquireFeature() Yes On-board memory 4 Gbytes of DDR4 SDRAM PCIe (3.0) board type x8 low-profile board Transceiver modules (SFP+/SFP28) 2 Number of stream channels Up to 32 when connected behind a switch Acquisition section GigE Vision GigE Vision compatible camera speeds 1/2.5/5/10/25 Gbit/sec Color space converter/Image formatter Yes 1 Bayer decoder Yes (GRBG, GBRG, BGGR, RGGB supported) Supports MIL licensing fingerprint storage Yes 1 It can convert 8-bit or 16-bit monochrome, or 24-bit or 48-bit packed BGR data to monochrome, packed BGR, packed BGRa, planar RGB, or YUV (YUYV) format. Matrox GevIQ overview Summary of Matrox GevIQ features ",
      "wordCount": 412,
      "subEntries": []
    },
    {
      "id": "BSN_geviq_Using_Matrox_GevIQ_with_MIL",
      "version": null,
      "title": "Using Matrox GevIQ with MIL",
      "subTitles": [
        "Grabbing and the MIL buffer formats to use for each camera pixel format",
        "Performing Bayer color conversion in hardware"
      ],
      "location": "MIL Hardware-specific Notes",
      "pageURL": "content\\BoardSpecificNotes\\geviq\\Using_Matrox_GevIQ_with_MIL.htm",
      "text": " Using Matrox GevIQ with MIL To use Matrox GevIQ, you must allocate it as a MIL GevIQ system (using MsysAlloc() with M_SYSTEM_GEVIQ). This allocation opens general communication with (allows you to discover) all GigE Vision-compliant cameras (or other devices) connected to Matrox GevIQ directly or behind a switch. You must then allocate a digitizer for each camera that you want to use to grab images and/or access directly, using MdigAlloc(). If you have multiple GigE Vision-compliant interface cameras, you should use the M_GC_CAMERA_ID() macro and specify the device's name; this will make for more portable code. You can use the Matrox Capture Works utility to view a list of available GigE Vision-compliant cameras and their user-defined name. For information on this utility, refer to the Matrox GevIQ utilities and tools section later in this chapter. For information regarding working with multiple GigE Vision-compliant devices, refer to the Working with one or more GigE Vision-compliant cameras subsection of the Using GigE Vision with MIL section of the Matrox GigE Vision driver chapter in the MIL Hardware-specific Notes. You can allocate a MIL GevIQ system for your board in multiple processes (executables). Note that you must only allocate an M_SYSTEM_GEVIQ system per Matrox GevIQ board and not for each SFP transceiver per board. Matrox GevIQ is a network adapter that supports digital video sources compliant with the GigE Vision 2.2 standard. Matrox GevIQ can grab monochrome, RGB color, and Bayer color-encoded data. The board can also perform pixel unpacking, image sub-sampling, and color-conversion. Depending on how your video sources are configured/connected to your Matrox GevIQ (for example, using a switch), an SFP connector could have multiple offloaded stream channels behind it. For information regarding working with multiple GigE Vision-compliant devices using a switch, refer to the Using a Gbit Ethernet switch with GigE Vision-compliant cameras section of the Matrox GigE Vision driver chapter in the MIL Hardware-specific Notes. Refer to Matrox GevIQ release notes for any additions/modifications to the MIL Hardware-specific Notes in this chapter or in the MIL Reference. Grabbing and the MIL buffer formats to use for each camera pixel format The following table outlines which MIL buffer format to use with each supported camera pixel format. Note that these are the officially supported camera pixel formats. Camera pixel format 3 MIL buffer format (type and attribute) Operation Mono8, Mono10, Mono12, Mono14, Mono16, Mono32 1-band 8-bit, 1-band 16-bit, 1-band 32-bit, 3-band 8-bit 1 , 3-band 16-bit 2 Data will automatically be bit-shifted to have most-significant bits (MSB) in destination buffer BayerXX8, BayerXX10, BayerXX12, BayerXX14, BayerXX16 where XX = GR, GB, BG or RG 1-band 8-bit, 1-band 16-bit Demosaicing followed by RGB to Y (bit shift for MSB) 3-band 8-bit, 3-band 16-bit Demosaicing (bit shift for MSB) 3-band YUV16 + M_PACKED Demosaicing followed by RGB to YUV RGB8, RGBA8, 1-band 8-bit RGB to Y 3-band 8-bit Direct copy 3-band YUV16 + M_PACKED RGB to YUV RGB10, RGBA10, RGB12, RGBA12, RGB14, RGBA14, RGB16, RGBA16 1-band 8-bit RGB to Y (bit shift for MSB) 1-band 16-bit RGB to Y 3-band 16-bit M_PLANAR Packed destination buffers are not supported YUV422_8, YCbCr601_422_8, YCbCr709_422_8 1-band 8-bit Only Y component 3-band YUV16 + M_PACKED Direct copy 1 3-band 8-bit buffers can be in any of the following formats: M_RGB24 + M_PLANAR, M_RGB24 + M_PACKED, M_BGR24 + M_PACKED, or M_BGR32 + M_PACKED. 2 3-band 16-bit buffers can be in either an M_RGB48 + M_PLANAR or M_RGB48 + M_PACKED format. 3 All of the values available for RGB are also available in BGR format. Note that for Matrox GevIQ, allocating a buffer with M_GRAB will force the buffer in pageable memory (M_PAGED) by default. Performing Bayer color conversion in hardware When Matrox GevIQ grabs color images from a video source with a Bayer color filter, it performs Bayer color conversion in hardware, as it transfers the images to the Host. If the images require white balancing, Matrox GevIQ can perform this automatically if white balancing is enabled using MdigControl() with M_WHITE_BALANCE set to M_ENABLE. If performing white balancing, you can use the default white balance coefficients, automatically have them calculated (using MdigControl() with M_WHITE_BALANCE set to M_CALCULATE), or set explicit coefficients (M_BAYER_COEFFICIENTS_ID). For information on Bayer color conversion, refer to the Using images acquired with a Bayer color filter section of Chapter 23: Data buffers. If you don't want to perform Bayer color conversion in hardware, disable it using MdigControl() with M_BAYER_CONVERSION set to M_DISABLE. The M_BAYER... control types of MdigControl() can only be used when grabbing from a camera that has a Bayer color filter; otherwise, an error will be generated. Using Matrox GevIQ with MIL Grabbing and the MIL buffer formats to use for each camera pixel format Performing Bayer color conversion in hardware ",
      "wordCount": 789,
      "subEntries": []
    },
    {
      "id": "BSN_geviq_GevIQ_utilities",
      "version": null,
      "title": "Matrox GevIQ utilities and tools",
      "subTitles": [
        "Matrox GevIQ Bench utility",
        "Matrox Capture Works",
        "Matrox Gecho",
        "Matrox GigE Vision discovery service",
        "Matrox GevIQ PCIe Information tool",
        "Matrox GevIQ System Monitor tool",
        "Ethernet switches and Configuring your IP"
      ],
      "location": "MIL Hardware-specific Notes",
      "pageURL": "content\\BoardSpecificNotes\\geviq\\GevIQ_utilities.htm",
      "text": " Matrox GevIQ utilities and tools The Matrox GevIQ can leverage the use of Matrox Capture Works (external application) and a series of tools integrated in the MILConfig utility (such as, the PCIe Information tool and the System Monitor tool) to help setup, diagnose, and debug your system. To access these utilities and tools, launch the MILConfig utility. Expand the Boards item in the tree structure and then click on the GevIQ subitem from the tree structure in the presented interface. The utilities and tools are located in the Launch external applications and Matrox GevIQ System Monitor pages, respectively. Matrox GevIQ Bench utility The Matrox GevIQ Bench utility calculates the real-time transfer speed of the PCIe slot (in Gbytes/sec) for Matrox GevIQ-to-Host: Non-paged DMA: A copy from a Matrox GevIQ on-board buffer to a buffer located in Host non-paged memory. Scatter gather DMA: A copy from a Matrox GevIQ on-board buffer to a buffer located in Host paged memory using scatter gather DMA. Another key feature of the Matrox GevIQ Bench utility is the interrupt latency tool, which measures the system interrupt latency (the time required for the system to respond to an interrupt). While the Matrox GevIQ is under load (for example, grabbing images using the Matrox Capture works utility), the tool will output the current, minimum, and maximum ISR (Interrupt Service Routine) latency in microseconds. Matrox Capture Works Matrox Capture Works is an interactive utility to configure and test devices that make use of a GenICam-based interface standard, and supports the GigE Vision interface standard (besides other standards). Matrox Capture Works adds, in particular, support for GenICam GenDC containers and multi-part payload types. Matrox Capture Works also adds support for 3D displays. Matrox Capture Works will list all detected GigE Vision-compliant devices connected to each allocated board. It can start or stop capturing images, display acquired images, save the last grabbed image, send a software trigger, as well as browse and control the selected device's features. You can view and change acquisition properties, and view acquisition statistics. Matrox Capture Works key features: Camera-centric user interface with support for camera enumeration and presence. Feature browser to display and control camera, digitizer, and system settings. DCF creation to save camera and digitizer settings. Efficient display of grabbed images with many options and view modes. Display of line and arc profiles. Display of image histogram. Memory viewer to display pixel values. Matrox Gecho Matrox Gecho (Gecho.exe) is an event logging application that is used to help debug and troubleshoot MIL applications and driver issues. Matrox Gecho is run in the background while other MIL applications are running, and can generate RAW, CSV, or JSON files that can be used to track the detected events (such as errors, warnings, and information messages generated by the camera). The Matrox Gecho tool is located in the ...\\Matrox Imaging\\Tools folder. You can run Matrox Gecho concurrently with your MIL application to help detect and diagnose grabbing errors such as: Unexpected camera removal. Latency issues. Missed frames. User-hook latency. Matrox GigE Vision discovery service The Matrox GigE Vision discovery service allows your MIL application and the Matrox Capture Works utility to automatically detect when GigE Vision-compliant cameras are added to or removed from your network. For more information, refer to the Matrox GigE Vision discovery service subsection of the Matrox GigE Vision tools section of the Matrox GigE Vision driver chapter in the MIL Hardware-specific Notes. Matrox GevIQ PCIe Information tool The Matrox GevIQ PCIe Information tool returns information about the board's PCIe connection. Use the acquisition (device) selector to set the stream channel about which to inquire (M_DEVn). Note that this selector is shared with the Matrox GevIQ System Monitor tool. This tool presents the following information inside the MILConfig utility: Current number of PCIe lanes. Current speed of the PCIe lanes. Maximum number of PCIe lanes. Maximum speed of the PCIe lanes. Matrox GevIQ System Monitor tool The Matrox GevIQ System Monitor tool displays board properties of the specified digitizer (M_DEVn). Use the acquisition (device) selector to set the stream channel about which to inquire (M_DEVn). Note that this selector is shared with the Matrox GevIQ PCIe Information tool. This tool presents the following information inside the MILConfig utility: The current temperature of the camera connected to the specified digitizer (M_DEVn). The maximum recorded temperature of the camera connected to the specified digitizer (M_DEVn). Ethernet switches and Configuring your IP Matrox GevIQ supports digital video sources compliant with the GigE Vision 2.2 standard. Depending on how your video sources are configured/connected to your Matrox GevIQ (for example, using a switch), a single port can offload multiple stream channels. For information regarding working with multiple GigE Vision-compliant devices using a switch, refer to the Using a Gbit Ethernet switch with GigE Vision-compliant cameras section of the Matrox GigE Vision driver chapter in the MIL Hardware-specific Notes. Matrox GevIQ network adapter settings are already optimized for best performance and do not need to be adjusted (for example, in the event of corrupted frames). However, for generalized information regarding acquisition reliability and common causes (such as firewall settings, insufficient inter-packet delay, packet resend capabilities, and more), refer to the Troubleshooting acquisition reliability issues section of the Matrox GigE Vision driver chapter in the MIL Hardware-specific Notes. For information regarding IP configuration of your Matrox GevIQ and GigE Vision-complaint camera, refer to the Configuring IP addresses section of the Matrox GigE Vision driver chapter in the MIL Hardware-specific Notes. Matrox GevIQ utilities and tools Matrox GevIQ Bench utility Matrox Capture Works Matrox Gecho Matrox GigE Vision discovery service Matrox GevIQ PCIe Information tool Matrox GevIQ System Monitor tool Ethernet switches and Configuring your IP ",
      "wordCount": 947,
      "subEntries": []
    },
    {
      "id": "BSN_geviq_Minimum_latency_and_grabbing_all_frames",
      "version": null,
      "title": "Minimum latency and grabbing all frames",
      "subTitles": [
        "Detecting missed frames",
        "Efficiently copying an on-board buffer to a destination buffer in Host memory",
        "Efficiently converting buffer formats while copying"
      ],
      "location": "MIL Hardware-specific Notes",
      "pageURL": "content\\BoardSpecificNotes\\geviq\\Minimum_latency_and_grabbing_all_frames.htm",
      "text": " Minimum latency and grabbing all frames When grabbing with either MdigGrab() or MdigProcess(), Matrox GevIQ is optimized to have the smallest latency possible between the last pixel sent from the camera to the last pixel written into the buffer. This allows the buffer to be available for processing with a minimum amount of delay. By default, Matrox GevIQ grabs into buffers in Host memory. On-board memory is used to protect against PCIe latency. To perform real-time grabs, your rate of acquisition (grabbing bandwidth) must be lower than the PCIe maximum transfer rate (PCIe bandwidth). If the acquisition rate is higher than the transfer rate across the PCIe bus, frames will be skipped rather than allowing a grab over-run to occur. To determine the image transfer speed from Matrox GevIQ to the Host, use the Matrox GevIQ Bench utility. Detecting missed frames To be certain that no frames were missed when MdigProcess() was last used, use MdigInquire() with M_PROCESS_FRAME_MISSED. This value reads the number of frames that were transmitted by the camera when no buffer was available to receive the frame; for example, if a grab is triggered and the associated hooked function is slow, then a frame can be missed. Efficiently copying an on-board buffer to a destination buffer in Host memory When copying an on-board buffer into a destination buffer in Host memory, the copy operation is performed by your Matrox GevIQ using the board's DMA write engine, rather than the Host. Your Matrox GevIQ will perform the operation faster than the Host. To ensure that Matrox GevIQ performs the operation, use the following: To copy an on-board buffer into a destination buffer in Host memory, use MbufCopy(). Efficiently converting buffer formats while copying When copying an on-board buffer into a destination buffer in Host memory, the color space converter and image formatter can automatically convert the bit-depth and color format of the source buffer to the bit-depth and color format of the destination buffer. For on-board conversion of buffers to take place, the following on-board buffer and destination buffer depth and color formats are supported. On-board buffer depth and color format (specified in the DCF) Destination buffer depth and color format 8-bit monochrome 16-bit monochrome M_PACKED + M_BGR24 M_PACKED + M_BGR32 M_YUV16_YUYV / M_YUV16 M_PLANAR + M_RGB24 M_PLANAR + M_RGB48 8-bit monochrome Yes No Yes Yes Yes Yes No 16-bit monochrome Yes Yes Yes Yes Yes Yes Yes M_PACKED + M_BGR24 Yes No Yes Yes Yes Yes No M_RGB48 + M_PACKED Yes Yes Yes Yes Yes Yes Yes For information about YUV or RGB/BGR buffers, refer to Chapter 23: Data buffers. For the calculations used to convert to YUV, refer to the Matrox GevIQ Hardware and Installation manual. Minimum latency and grabbing all frames Detecting missed frames Efficiently copying an on-board buffer to a destination buffer in Host memory Efficiently converting buffer formats while copying ",
      "wordCount": 479,
      "subEntries": []
    },
    {
      "id": "BSN_geviq_Matrox_GevIQ_board_flow_diagram",
      "version": null,
      "title": "Matrox GevIQ board flow diagram",
      "subTitles": null,
      "location": "MIL Hardware-specific Notes",
      "pageURL": "content\\BoardSpecificNotes\\geviq\\Matrox_GevIQ_board_flow_diagram.htm",
      "text": " Matrox GevIQ board flow diagram The following diagram illustrates the data flow of Matrox GevIQ. Matrox GevIQ board flow diagram ",
      "wordCount": 22,
      "subEntries": []
    }
  ]
}]