[{
  "id": "BSN_solios",
  "version": "2024020714",
  "title": "Matrox Solios",
  "subTitles": null,
  "location": "MIL Hardware-specific Notes",
  "pageURL": "content\\BoardSpecificNotes\\solios\\ChapterInformation.htm",
  "text": " Matrox Solios This section discusses features of MIL that are particular to Matrox Solios and ways that optimize the board's performance. Matrox Solios information regarding specific functions is integrated into the functions' reference topics. Refer to the Matrox Solios release notes for any additions/modifications to this chapter or the MIL Reference. Matrox Solios overview Summary of Matrox Solios features Note on nomenclature Using Matrox Solios with MIL Changing the mode of your Matrox Solios eCL/XCL Allocating independent MIL digitizers on Matrox Solios Matrox Solios eA/XA Data input channels of acquisition paths Switching between cameras of the same type Switching between cameras of different types Channel locking and unlocking Matrox Solios eCL/XCL Minimum latency, grabbing all frames, and grabbing a single field Detecting missed frames when using MdigProcess Quickly copying an on-board buffer to a Host destination buffer Quickly converting buffer formats while copying Grabbing a single field COM ports and UARTS Matrox Solios tools Matrox Usage Meter utility Matrox Solios Performance Monitor utility Matrox Solios Bench utility Camera-Link Configuration tool Usable On-Board Memory tool Matrox Solios eCL/XCL-B connectors and signal names Board connectors Signal names and their matching MIL constants Matrox Solios eCL/XCL dual-Base/single-Medium and cCL/XCL-F connectors and signal names Board connectors Signal names and their matching MIL constants Matrox Solios eA/XA connectors and signal names Board connectors Signal names and their matching MIL constants Matrox Solios board flow diagrams Matrox Solios eCL/XCL Matrox Solios eA/XA ",
  "wordCount": 238,
  "subEntries": [
    {
      "id": "BSN_solios_Matrox_Solios_specific_features",
      "version": null,
      "title": "Matrox Solios overview",
      "subTitles": [
        "Summary of Matrox Solios features",
        "Note on nomenclature"
      ],
      "location": "MIL Hardware-specific Notes",
      "pageURL": "content\\BoardSpecificNotes\\solios\\Matrox_Solios_specific_features.htm",
      "text": " Matrox Solios overview The Matrox Solios family consists of four members: two PCI-X compliant, single-slot, frame grabbers, and two PCIe compliant, single-slot, frame grabbers. If purchased with the optional Processing FPGA, members also have custom image processing capabilities. The PCI-X compliant boards are Matrox Solios XCL and Matrox Solios XA. The PCIe compliant boards are Matrox Solios eCL and Matrox Solios eA. The PCIe compliant boards provide the exact same features as the related PCI-X versions, except for the way the boards connect to the Host bus. Matrox Solios eCL/XCL is a Camera Link frame grabber. It is available in three factory-configured versions: eCL/XCL-B. Supports a single-Base configuration. It can acquire images from one Camera Link camera in the Base configuration. eCL/XCL-F. Supports a single-Full configuration. It can acquire images from a single Camera Link camera in the Base, Medium, or Full configuration. eCL/XCL dual-Base/single-Medium. Supports both a dual-Base and single-Medium configuration. It can acquire images from either two independent Camera Link cameras in the Base mode, or one Camera Link camera in the Medium mode. Matrox Solios eA/XA is available in three factory-configured versions: eA/XA Quad (with 4 independent acquisition paths), eA/XA Dual (with 2 independent acquisition paths), and eA/XA Single (with 1 acquisition path). All versions of Matrox Solios eA/XA are high-performance analog frame grabbers, capable of high frequency and high fidelity acquisition. Matrox Solios can preprocess and format grabbed data in on-board buffers before transferring them to the Host if your Matrox Solios is purchased with the optional Processing FPGA (which comes with up to an additional 25 Mbytes of DDR SDRAM and up to 8 Mbytes of QDR-II SRAM). Summary of Matrox Solios features The following table outlines the features currently available for each member of the Matrox Solios family. Matrox Solios eCL/XCL dual-Base/single-Medium and eCL/XCL-F eCL/XCL-B eA/XA Can access GenICam camera features using MdigControlFeature() / MdigInquireFeature() 1 Yes Yes No On-board memory up to 256 Mbytes 2 up to 128 Mbytes 2 up to 256 Mbytes 2 Processing FPGA (optional) Yes 3 No 3 Yes 4 Digitizer LUT Yes 5 Yes 5 Yes Asynchronous camera reset support Yes Yes Yes Number of acquisition paths 2 or 1 6 1 4 (Quad), 2 (Dual), 1 (Single) Number of trigger controllers 4/digitizer 3 4/digitizer Number of timers 4/digitizer 4 2/digitizer Number of UARTS 1/digitizer 1 1/digitizer Number of auxiliary signals 7 8 in, 4 I/O, and 2 out/digitizer 3 I/O, 4 in, 1 out 10 in/digitizer, 3 out/digitizer Number of camera control signals 4/digitizer 4 No Number of rotary decoders 1 0 0 1 Only if the camera supports GenICam. For more information, refer to the Using GenICam with Camera Link cameras subsection of the Using MIL with GenICam section of Chapter 27: Grabbing with your digitizer. 2 This total includes RAM that is only available if your Matrox Solios comes with a Processing FPGA. 3 Note that the Processing FPGA option is not available on the standard Camera Link speed (66 MHz) version of Matrox Solios eCL/XCL dual-Base/single-Medium. 4 Note that Matrox Solios eA/XA Single does not spport this option. 5 Digitizer LUTs are not supported when using a 10-tap video source. 6 Two acquisition paths are available on Matrox Solios eCL/XCL dual-Base/single-Medium operating in dual-Base mode. One acquisition path is available on Matrox Solios eCL/XCL-F, and eCL/XCL dual-Base/single-Medium operating in single-Medium mode. 7 For the exact number of auxiliary signals, timers and supported trigger controllers, refer to the Matrox Solios eCL/XCL-B connectors and signal names section later in this chapter. Note on nomenclature This manual refers to all versions of Matrox Solios as Matrox Solios. Matrox Solios eCL/XCL refers to Matrox Solios eCL/XCL dual-Base/single-Medium, Matrox Solios eCL/XCL-B, and Matrox Solios eCL/XCL-F versions. In addition, Matrox Solios eA/XA refers to the Quad, Dual, and Single versions. When necessary, this manual distinguishes between the Matrox products using their full names. Matrox Solios overview Summary of Matrox Solios features Note on nomenclature ",
      "wordCount": 656,
      "subEntries": []
    },
    {
      "id": "BSN_solios_Using_Matrox_Solios_with_MIL",
      "version": null,
      "title": "Using Matrox Solios with MIL",
      "subTitles": [
        "Changing the mode of your Matrox Solios eCL/XCL"
      ],
      "location": "MIL Hardware-specific Notes",
      "pageURL": "content\\BoardSpecificNotes\\solios\\Using_Matrox_Solios_with_MIL.htm",
      "text": " Using Matrox Solios with MIL To use any Matrox Solios, you must allocate it as a MIL Solios system (using MsysAlloc(), with M_SYSTEM_SOLIOS). This allocation opens communication with your Matrox Solios and allows MIL to use its resources. You can allocate a MIL Solios system for your board in multiple processes (executables). If more than one process allocates a digitizer for the same acquisition path, grabs from the different processes will be queued in the order that they arrive (first in, first out). For more information regarding controlling your digitizer and its I/Os, see Chapter 27: Grabbing with your digitizer and Chapter 56: I/O signals and communicating with external devices, respectively. For information regarding the use of your Matrox Solios' Processing FPGA, see Chapter 66: Using MIL with a Processing FPGA. For information regarding GenICam, and configuring your Camera Link camera to use GenICam, see the Using MIL with GenICam section of Chapter 27: Grabbing with your digitizer. Refer to the Matrox Solios release notes for any additions/modifications to the MIL Hardware-specific Notes in this chapter or in the MIL Reference. Changing the mode of your Matrox Solios eCL/XCL The mode of Matrox Solios eCL/XCL dual-Base/single-Medium can be changed using the MILConfig utility (Solios tab) from its factory-default setting of single-Medium to dual-Base. Follow all on-screen procedures. Once changed, your computer must be shut-down and then turned back on (perform a cold-boot) for changes to take effect. Note that simply restarting your computer (using the Microsoft Windows security Restart option) will not allow the changes to take affect. If you change the mode of Matrox Solios eCL/XCL dual-Base/single-Medium, make certain that you also choose the appropriate DCF. Using the wrong DCF when performing a digitizer allocation (using MdigAlloc()) will result in an error. Using Matrox Solios with MIL Changing the mode of your Matrox Solios eCL/XCL ",
      "wordCount": 308,
      "subEntries": []
    },
    {
      "id": "BSN_solios_Allocating_independent_MIL_digitizers",
      "version": null,
      "title": "Allocating independent MIL digitizers on Matrox Solios",
      "subTitles": [
        "Matrox Solios eA/XA",
        "Data input channels of acquisition paths",
        "Switching between cameras of the same type",
        "Switching between cameras of different types",
        "Channel locking and unlocking",
        "Matrox Solios eCL/XCL"
      ],
      "location": "MIL Hardware-specific Notes",
      "pageURL": "content\\BoardSpecificNotes\\solios\\Allocating_independent_MIL_digitizers.htm",
      "text": " Allocating independent MIL digitizers on Matrox Solios Depending on the frame grabber, you can allocate several independent MIL digitizers. Independent digitizers have different device numbers and use different acquisition paths. Matrox Solios eA/XA The following table lists the acquisition paths and the digitizer number to use when connecting asynchronous cameras of different types. Matrox Solios eA/XA type Single Dual Quad Acquisition paths 1 2 4 Maximum number of taps 1 2 4 Available device numbers M_DEV0 M_DEV0, M_DEV1 M_DEV0 through M_DEV3 The following image shows the different types of configurations possible for the number of acquisition paths available. Each acquisition path supports input from one of two sources; therefore, all digitizers have 2 data channels. You can switch between them using MdigControl() with M_CHANNEL. Synchronization signals can either come combined with the data (CSYNC), come along the data input signal of another acquisition path that is not already allocated (external analog synchronization), or from the DVI connector (external digital synchronization). Note that using an acquisition path to receive an external analog synchronization signal renders that acquisition path \"occupied\" and not available for use by another digitizer that uses the acquisition path. For example, when allocating a digitizer for a 3-tap (RGB) camera on acquisition paths 0, 1, and 2 (using MdigAlloc() with M_DEV0), you can set your synchronization signal on acquisition path 3 by customizing the DCF using Matrox Intellicam. This results in acquisition path 3 not being available for use by another camera. Data input channels of acquisition paths Most acquisition paths have several multiplexed data input channels. This means that they have several data input channels but can only grab from one channel at a time. In this case, the MIL digitizer representing the acquisition path(s) has multiple data input channels. If you have a camera that is connected to a channel other than the first of its digitizer, you must specify the channel, using MdigControl() with M_CHANNEL. Switching between cameras of the same type When connecting several cameras of the same data format to different data input channels of a digitizer, allocate a single digitizer with the appropriate DCF for the first camera and use MdigControl() with M_CHANNEL to switch between the others of the same type. Switching between cameras of different types When connecting cameras of different data formats to different data input channels of a digitizer, you must use a different DCF for each camera. You could allocate a digitizer, grab the required frame, free the digitizer, and then allocate the digitizer again with the second DCF; this can increase the time required for the operation. MIL can circumvent this problem by using a fast DCF-switching technique which is outlined in the steps below: Make as many calls to MdigAlloc() as you have cameras, with different formats, from which you want to grab. Specify the required digitizer settings using MdigControl() and MdigHookFunction() for each allocated digitizer. Specify the channel to use for the grab using M_CHANNEL. Call MdigGrab() with an allocated digitizer identifier. Note that if this call uses a digitizer identifier different from the previous call, a DCF switch will occur. If there is a grab in progress with one digitizer, calling any of the following functions with any other digitizer will result in an error: MdigGrab(), MdigGrabContinuous(), MdigInquire(), MdigProcess(), MdigAlloc(), and MdigFree(). To synchronize your grabs with different digitizers, use MthrWait(). Channel locking and unlocking If the synchronization between a digitizer and a camera is uncertain, enable MdigControl() with M_CAMERA_LOCK to lock the digitizer to the synchronization signal of the camera after a channel-switch. This provides additional stability. In this case, the digitizer is unlocked from the first camera and then locked to the next camera after a channel-switch occurs. Typically, MIL finds the best balance between the fastest lock and the most reliable lock possible, depending on your camera. Matrox Solios eCL/XCL The number of independent digitizers that you can allocate on Matrox Solios eCL/XCL is dependent on the configuration in use. There are three configurations of Matrox Solios eCL/XCL available: Single-Medium. The single-Medium version has only one acquisition path (M_DEV0) with only one data channel. Dual-Base. The dual-Base version has two acquisition paths (M_DEV0 and M_DEV1), but each only has one data channel. Single-Full. The single-Full version has one acquisition path (M_DEV0), with only one data channel. Allocating independent MIL digitizers on Matrox Solios Matrox Solios eA/XA Data input channels of acquisition paths Switching between cameras of the same type Switching between cameras of different types Channel locking and unlocking Matrox Solios eCL/XCL ",
      "wordCount": 754,
      "subEntries": []
    },
    {
      "id": "BSN_solios_Minimum_latency_and_grabbing_all_frames",
      "version": null,
      "title": "Minimum latency, grabbing all frames, and grabbing a single field",
      "subTitles": [
        "Detecting missed frames when using MdigProcess",
        "Quickly copying an on-board buffer to a Host destination buffer",
        "Quickly converting buffer formats while copying",
        "Grabbing a single field"
      ],
      "location": "MIL Hardware-specific Notes",
      "pageURL": "content\\BoardSpecificNotes\\solios\\Minimum_latency_and_grabbing_all_frames.htm",
      "text": " Minimum latency, grabbing all frames, and grabbing a single field When grabbing with either MdigGrab() or MdigProcess(), Matrox Solios is optimized to have the smallest latency possible between the last pixel sent from the camera to the last pixel written into the buffer. This allows the buffer to be available for processing with a minimum amount of delay. On-board memory is used to protect against PCI (PCI/PCI-X/PCIe) latency. By default, Matrox Solios grabs into off-board buffers. To perform real-time grabs, your rate of acquisition (grabbing bandwidth) must be lower than the PCI maximum transfer rate (PCI bandwidth). If the acquisition rate is higher than the transfer rate across the PCI bus, frames will be skipped rather than allowing a grab over-run to occur. To determine the image transfer speed from the Host, use the Matrox Solios Bench utility. Detecting missed frames when using MdigProcess To be certain that no frames were missed when MdigProcess() was last used, use MdigInquire() with M_PROCESS_FRAME_MISSED. This value is based on a comparison between the frame rate (M_PROCESS_FRAME_RATE) and the frame count (M_PROCESS_FRAME_COUNT). If a grab is triggered from a temperamental trigger or if the hooked function is slow, the value returned by M_PROCESS_FRAME_MISSED will be affected. This value is most trustworthy with a camera in continuous mode. You can inquire the frame time-stamp sampled at the frame's end using MdigGetHookInfo() with M_TIME_STAMP. Use M_PROCESS_FRAME_COUNT to determine the total number of frames grabbed in the sequence. Use M_PROCESS_FRAME_RATE to return an estimate of the frame rate in frames per second. Note that this value is determined based on the average of the camera's frame rate, and the total amount of time to process the user-defined hooked function(s). Quickly copying an on-board buffer to a Host destination buffer When copying an on-board buffer into a Host destination buffer, the copy operation should be performed by your Matrox Solios using the Matrox Solios DMA engine, rather than the Host. Your Matrox Solios will perform the operation faster than the Host. To ensure that Matrox Solios performs the operation, use the following: To copy an on-board buffer into a destination buffer on the Host, use MbufCopy(). To resize an on-board buffer while copying it to a destination buffer on the Host, use MimResize() with a factor of 1 to 16 and with an interpolation mode of M_NEAREST_NEIGHBOR. Alternatively, you can use MbufTransfer() to perform the same operation. To flip an on-board buffer while copying it to a destination buffer on the Host, use MimFlip(). Note that for your Matrox Solios to perform these operations, the Host destination buffer must be allocated in non-paged memory (that is, using MbufAlloc...() with M_IMAGE + M_NON_PAGED). Quickly converting buffer formats while copying When copying an on-board buffer into a Host destination buffer, Matrox Solios's Video to PCI-X bridge can automatically convert the bit-depth and color format of the source buffer to the bit-depth and color format of the destination buffer. When your source buffer is the same bit-depth and color format as the destination buffer, no conversion is required. However, if your source and destination buffer formats have different color formats, a conversion will take place. If the source and destination buffers are of the appropriate format and bit depths, the conversion will be performed on-board by the video to PCI-X bridge. On-board conversion is supported for the following source and destination buffer combinations. On-board buffer depth and color format (specified in the DCF) Host destination buffer depth and color format 8-bit monochrome 16-bit monochrome M_PACKED + M_BGR24 M_PACKED + M_BGR32 M_RGB48 + M_PACKED M_YUV16_YUYV / M_YUV16 M_PLANAR + M_RGB24 M_PLANAR + M_RGB48 8-bit monochrome Yes No Yes Yes No Yes Yes No 16-bit monochrome Yes Yes Yes Yes No Yes Yes No M_PACKED + M_BGR24 Yes No Yes Yes No Yes Yes No M_RGB48 + M_PACKED Yes No Yes Yes Yes Yes Yes No For more information about YUV and RGB buffers, refer to Chapter 23: Data buffers. For the calculations used to convert to YUV, refer to the Matrox Solios Hardware and Installation manual. Grabbing a single field With interlaced scanning cameras, 2 fields are grabbed by default; therefore one call to MdigGrab() will grab both the odd and even fields. You can change the number of fields to 1 and have MIL treat each field as one frame using MdigControl() with M_GRAB_FIELD_NUM, grabbing every second row and storing them in sequential rows. Therefore, the grab time is reduced by half. This control type can only be set to 1 or 2, and should only be used for interlaced video. When set to 1, each field is treated like a frame and the following digitizer events occur relative to the grabbed field: M_GRAB_FRAME_START, M_GRAB_END, and M_GRAB_FRAME_END. To achieve 60 fps in NTSC or 50 fps in PAL, the control type M_GRAB_START_MODE must be set to M_FIELD_START. Minimum latency, grabbing all frames, and grabbing a single field Detecting missed frames when using MdigProcess Quickly copying an on-board buffer to a Host destination buffer Quickly converting buffer formats while copying Grabbing a single field ",
      "wordCount": 844,
      "subEntries": []
    },
    {
      "id": "BSN_solios_COM_ports_and_UARTS",
      "version": null,
      "title": "COM ports and UARTS",
      "subTitles": null,
      "location": "MIL Hardware-specific Notes",
      "pageURL": "content\\BoardSpecificNotes\\solios\\COM_ports_and_UARTS.htm",
      "text": " COM ports and UARTS Matrox Solios eA/XA and eCL/XCL offers RS-232 compatible serial interfaces (each controlled by a UART). Each interface is mapped as a COM port so that it can be accessed through the Microsoft Windows API. Use the Microsoft Windows library to access and control the serial ports. To view them in a Microsoft Windows operating system, refer to Microsoft Window's device manager, under Ports (COM &amp; LPT). Alternatively, MIL can control and access the serial ports using MsysControl() with M_UART.... With Matrox Solios eCL/XCL, the Camera Link manufacturer's camera configuration application can access and control the serial ports. Note that, if you have enabled the CLProtocol module for one of your cameras, the COM port for the associated acquisition path will not be available. COM ports and UARTS ",
      "wordCount": 133,
      "subEntries": []
    },
    {
      "id": "BSN_solios_Matrox_Solios_utilities",
      "version": null,
      "title": "Matrox Solios tools",
      "subTitles": [
        "Matrox Usage Meter utility",
        "Matrox Solios Performance Monitor utility",
        "Matrox Solios Bench utility",
        "Camera-Link Configuration tool",
        "Usable On-Board Memory tool"
      ],
      "location": "MIL Hardware-specific Notes",
      "pageURL": "content\\BoardSpecificNotes\\solios\\Matrox_Solios_utilities.htm",
      "text": " Matrox Solios tools There are three Matrox Solios external applications (utilities) available (Matrox Usage Meter, Matrox Solios Performance Monitor, and Matrox Solios Bench) and two Matrox Solios tools integrated in the MILConfig utility (Camera-Link Configuration and Usable On-Board Memory). To access these utilities and tools, in the MILConfig utility's tree structure, select the Boards Solios item. These utilities are located in the Launch external applications, Camera-Link Configuration, and Usable On-Board Memory panes, respectively. Matrox Usage Meter utility The Matrox Usage Meter utility calculates how much is being used of the grab section and the transfer section of each DMA engin. This rate of utilization is expressed as a percentage. This utility also shows the usage of on-board memory. Matrox Solios Performance Monitor utility The Matrox Solios performance monitor utility is integrated with the Windows Performance Monitor and is used to monitor information about the Matrox Solios, such as: Grab usage. Transfer usage of each DMA engine. Memory size of the memory bank. Current and maximum temperatures of the on-board FPGAs. Matrox Solios Bench utility The Matrox Solios Bench utility calculates the real-time transfer speed of the PCI/PCI-X/PCIe slot (in Mbytes/sec) from: Matrox Solios to Host. Host to Matrox Solios. Camera-Link Configuration tool The Camera-Link Configuration tool allows you to switch the camera configuration from Camera-Link Dual Base to Camera-Link Single Full. Note that, you must select an acquisition device and make ceratin that all cameras are unplugged before changing the Camera-Link configuration. Usable On-Board Memory tool The Usable On-Board Memory tool allows you specify the amount of memory on-board your Matrox Solios board that MIL can use. Matrox Solios tools Matrox Usage Meter utility Matrox Solios Performance Monitor utility Matrox Solios Bench utility Camera-Link Configuration tool Usable On-Board Memory tool ",
      "wordCount": 292,
      "subEntries": []
    },
    {
      "id": "BSN_solios_Matrox_Solios_CL_SB_connectors_and_signal_names",
      "version": null,
      "title": "Matrox Solios eCL/XCL-B connectors and signal names",
      "subTitles": [
        "Board connectors",
        "Signal names and their matching MIL constants"
      ],
      "location": "MIL Hardware-specific Notes",
      "pageURL": "content\\BoardSpecificNotes\\solios\\Matrox_Solios_CL_SB_connectors_and_signal_names.htm",
      "text": " Matrox Solios eCL/XCL-B connectors and signal names This section serves as a reference to match Matrox Solios eCL/XCL-B's connectors and auxiliary/camera control signals with MIL information, such as MIL auxiliary/camera control signal numbers. To set/inquire all the settings for this board's auxiliary/camera control signals (for example, signal routing and timer settings), use MdigControl() / MdigInquire(), respectively. Matrox Solios eCL/XCL-B has only one acquisition path, so all auxiliary signals can be used. Auxiliary I/O signals and camera control signals can have one or more functionalities (for example, trigger input, timer output, or user output, depending on the signal). Their possible functionalities are described in their description in the pinout table below. The Matrox Solios eCL/XCL-B board has 3 trigger controllers on its acquisition path, so that on-board events (for example, acquisition and timer output) can start upon different triggers if required. Although a trigger controller might support several trigger input signals, only one signal can drive a trigger controller at any given time. For example, if you set signal A as the trigger input source for acquisition, and signal B as the trigger input source for timer 1, signal A and B must be driving different trigger controllers; if they drive the same trigger controller, an error is generated. Note that you can set a signal (for example, signal A) as the trigger input source for both acquisition and timer 1; in this case, the associated trigger controller triggers both events at the same time. Only those auxiliary/camera control signals that have matching MIL information are included in this section. For information on internal connectors and a comprehensive list of all available input and output signals, refer to the board's installation and hardware reference manual. Board connectors On the Matrox Solios eCL/XCL-B board, there are two interface connectors. On its bracket, there is one Camera Link video input connector and one auxiliary I/O connector (DBHD-15 or DB-9). It does not come with an adapter board/bracket. All of Matrox Solios eCL/XCL-B's connectors have auxiliary/camera control signals with matching MIL information. Connector Name Connector Abbreviation Image Description Camera Link video input connector MDR The Camera Link video input connector is a 26-pin high-density D ribbon connector. It is used to receive video input, timing, and synchronization signals and transmit/receive communication signals between the video source and the frame grabber. External auxiliary I/O connector 0 DB-9 or DBHD-15 External auxiliary I/O connector 0 can be either a standard D-subminiature 9-pin connector or a high-density D-subminiature 15-pin male connector. In either case, the connector is used to transmit timing and synchronization signals, and transmit/receive auxiliary signals. This connector is located on the main bracket. Note that if this external auxiliary connector is a DB-9 connector, some DBHD-15 signals are not available. Signal names and their matching MIL constants The table below lists the auxiliary/camera control signals with their associated MIL information. Note that the MIL constants in this table are those to use with MIL 10 and later. If you are upgrading from a previous version of MIL, you should port your code using the conversion tables for the Matrox Solios eCL/XCL (MILSoliosCameraLinkIOConversionTable) in the MIL release notes. Sort by: MIL I/O information Connector and pin Hardware manual signal name Filter by: Show all Direction: input Direction: output Direction: input/output Timers Triggers Tables: Expanded Collapsed Digitizer device # Description MIL I/O # Pin information Direction User-bit information Trigger information Timer information Hardware manual signal name Digitizer device #: M_DEV0 Indicates the following. MIL I/O #: M_AUX_IO2 TTL auxiliary signal (input/output) for acquisition path 0, which supports: timer output, trigger input, or user input/output. Pin information Connector: DBHD-15&nbsp;Pin: 3 Direction Input/Output User-bit information MIL user-bit #: M_USER_BIT4; Digitizer device #: M_DEV0; (Hardware manual user signal rank 1 : 4 on acq path 0 ) Trigger information M_HARDWARE_PORT2; Digitizer device #: M_DEV0; Trigger controller: 2 on acq path 0. Timer information Timer: M_TIMER2; Digitizer device #: M_DEV0; Hardware manual signal name P0_TTL_AUX_IO_2 MIL I/O #: M_AUX_IO6 Opto-isolated auxiliary signal (input) for acquisition path 0, which supports: trigger input, user input, or field polarity input. Pin information Connector: DB-9&nbsp;Pin: 7+, 2-; Connector: DBHD-15&nbsp;Pin: 15+, 9- Direction Input Trigger information M_HARDWARE_PORT6; Digitizer device #: M_DEV0; Trigger controller: 0 on acq path 0. Hardware manual signal name P0_OPTO_AUX_IN0 MIL I/O #: M_AUX_IO7 Opto-isolated auxiliary signal (input) for acquisition path 0, which supports: trigger input or user input. Pin information Connector: DB-9&nbsp;Pin: 4+, 5-; Connector: DBHD-15&nbsp;Pin: 12+, 11- Direction Input Trigger information M_HARDWARE_PORT7; Digitizer device #: M_DEV0; Trigger controller: 1 on acq path 0. Hardware manual signal name P0_OPTO_AUX_IN1 MIL I/O #: M_AUX_IO8 TTL auxiliary signal (input/output) for acquisition path 0, which supports: timer output, trigger input, user input/output, or field polarity input. Pin information Connector: DB-9&nbsp;Pin: 1; Connector: DBHD-15&nbsp;Pin: 1 Direction Input/Output User-bit information MIL user-bit #: M_USER_BIT2; Digitizer device #: M_DEV0; (Hardware manual user signal rank 1 : 2 on acq path 0 ) Trigger information M_HARDWARE_PORT8; Digitizer device #: M_DEV0; Trigger controller: 0 on acq path 0. Timer information Timer: M_TIMER3; Digitizer device #: M_DEV0; Hardware manual signal name P0_TTL_AUX_IO_0 MIL I/O #: M_AUX_IO9 TTL auxiliary signal (input/output) for acquisition path 0, which supports: timer output, trigger input, or user input/output. Pin information Connector: DBHD-15&nbsp;Pin: 2 Direction Input/Output User-bit information MIL user-bit #: M_USER_BIT3; Digitizer device #: M_DEV0; (Hardware manual user signal rank 1 : 3 on acq path 0 ) Trigger information M_HARDWARE_PORT9; Digitizer device #: M_DEV0; Trigger controller: 1 on acq path 0. Timer information Timer: M_TIMER1/M_TIMER4; Digitizer device #: M_DEV0; Hardware manual signal name P0_TTL_AUX_IO_1 MIL I/O #: M_AUX_IO10 LVDS auxiliary signal (input) for acquisition path 0, which supports: trigger input, user input, field polarity input, or quadrature input bit 0. Pin information Connector: DB-9&nbsp;Pin: 8+, 3-; Connector: DBHD-15&nbsp;Pin: 4+, 5- Direction Input Trigger information M_HARDWARE_PORT10; Digitizer device #: M_DEV0; Trigger controller: 0 on acq path 0. Hardware manual signal name P0_LVDS_AUX_IN0 MIL I/O #: M_AUX_IO11 LVDS auxiliary signal (input) for acquisition path 0, which supports: trigger input, user input, timer clock input, or quadrature input bit 1. Pin information Connector: DBHD-15&nbsp;Pin: 6+, 8- Direction Input Trigger information M_HARDWARE_PORT11; Digitizer device #: M_DEV0; Trigger controller: 1 on acq path 0. Hardware manual signal name P0_LVDS_AUX_IN1 MIL I/O #: M_AUX_IO12 LVDS auxiliary signal (output) for acquisition path 0, which supports: timer output or user output. Pin information Connector: DBHD-15&nbsp;Pin: 13+, 14- Direction Output User-bit information MIL user-bit #: M_USER_BIT0; Digitizer device #: M_DEV0; (Hardware manual user signal rank 1 : 5 on acq path 0 ) Timer information Timer: M_TIMER1; Digitizer device #: M_DEV0; Hardware manual signal name P0_LVDS_AUX_OUT0 MIL I/O #: M_CC_IO1 Camera control output 1 for acquisition path 0, which supports: timer output, user output, VSYNC, HSYNC, clock output, or rerouting of specific auxiliary input signals. Only the following auxiliary input signals can be rerouted to this output signal: M_AUX_IO2 ( P0_TTL_AUX_IO_2 ). M_AUX_IO7 ( P0_OPTO_AUX_IN1 ). M_AUX_IO8 ( P0_TTL_AUX_IO_0 ). M_AUX_IO10 ( P0_LVDS_AUX_IN0 ). Pin information Connector: MDR&nbsp;Pin: 5+, 18- Direction Output User-bit information MIL user-bit #: M_USER_BIT_CC_IO0/M_USER_BIT_CC_IO1; Digitizer device #: M_DEV0; Timer information Timer: M_TIMER1/M_TIMER2; Digitizer device #: M_DEV0; Hardware manual signal name CC1 MIL I/O #: M_CC_IO2 Camera control output 2 for acquisition path 0, which supports: timer output, user output, VSYNC, HSYNC, clock output, or rerouting of specific auxiliary input signals. Only the following auxiliary input signals can be rerouted to this output signal: M_AUX_IO2 ( P0_TTL_AUX_IO_2 ). M_AUX_IO7 ( P0_OPTO_AUX_IN1 ). M_AUX_IO8 ( P0_TTL_AUX_IO_0 ). M_AUX_IO10 ( P0_LVDS_AUX_IN0 ). Pin information Connector: MDR&nbsp;Pin: 17+, 4- Direction Output User-bit information MIL user-bit #: M_USER_BIT_CC_IO0/M_USER_BIT_CC_IO1; Digitizer device #: M_DEV0; Timer information Timer: M_TIMER1/M_TIMER2; Digitizer device #: M_DEV0; Hardware manual signal name CC2 MIL I/O #: M_CC_IO3 Camera control output 3 for acquisition path 0, which supports: timer output, user output, VSYNC, HSYNC, clock output, or rerouting of specific auxiliary input signals. Only the following auxiliary input signals can be rerouted to this output signal: M_AUX_IO2 ( P0_TTL_AUX_IO_2 ). M_AUX_IO7 ( P0_OPTO_AUX_IN1 ). M_AUX_IO8 ( P0_TTL_AUX_IO_0 ). M_AUX_IO10 ( P0_LVDS_AUX_IN0 ). Pin information Connector: MDR&nbsp;Pin: 3+, 16- Direction Output User-bit information MIL user-bit #: M_USER_BIT_CC_IO0/M_USER_BIT_CC_IO1; Digitizer device #: M_DEV0; Timer information Timer: M_TIMER1/M_TIMER2; Digitizer device #: M_DEV0; Hardware manual signal name CC3 MIL I/O #: M_CC_IO4 Camera control output 4 for acquisition path 0, which supports: timer output, user output, VSYNC, HSYNC, clock output, or rerouting of specific auxiliary input signals. Only the following auxiliary input signals can be rerouted to this output signal: M_AUX_IO2 ( P0_TTL_AUX_IO_2 ). M_AUX_IO7 ( P0_OPTO_AUX_IN1 ). M_AUX_IO8 ( P0_TTL_AUX_IO_0 ). M_AUX_IO10 ( P0_LVDS_AUX_IN0 ). Pin information Connector: MDR&nbsp;Pin: 15+, 2- Direction Output User-bit information MIL user-bit #: M_USER_BIT_CC_IO0/M_USER_BIT_CC_IO1; Digitizer device #: M_DEV0; Timer information Timer: M_TIMER1/M_TIMER2; Digitizer device #: M_DEV0; Hardware manual signal name CC4 expandTable(\"mil_io_information_show_all\"); 1 The user-bit number in the Installation and Hardware Reference manual is just a rank; use the MIL user-bit number instead. Matrox Solios eCL/XCL-B connectors and signal names Board connectors Signal names and their matching MIL constants ",
      "wordCount": 1489,
      "subEntries": []
    },
    {
      "id": "BSN_solios_Matrox_Solios_CL_DB_SM_SF_connectors_and_signal_names",
      "version": null,
      "title": "Matrox Solios eCL/XCL dual-Base/single-Medium and cCL/XCL-F connectors and signal names",
      "subTitles": [
        "Board connectors",
        "Signal names and their matching MIL constants"
      ],
      "location": "MIL Hardware-specific Notes",
      "pageURL": "content\\BoardSpecificNotes\\solios\\Matrox_Solios_CL_DB_SM_SF_connectors_and_signal_names.htm",
      "text": " Matrox Solios eCL/XCL dual-Base/single-Medium and cCL/XCL-F connectors and signal names This section serves as a reference to match Matrox Solios eCL/XCL dual-Base/single-Medium's and eCL/XCL-F's connectors and auxiliary/camera control signals with MIL information, such as MIL auxiliary/camera control signal numbers. To set/inquire all the settings for this board's auxiliary/camera control signals (for example, signal routing and timer settings), use MdigControl() / MdigInquire(), respectively. Matrox Solios eCL/XCL dual-Base/single-Medium and eCL/XCL-F have a different number of acquisition paths and auxiliary/camera control signals. For each Matrox Solios eCL/XCL specified below, only the auxiliary/camera control signals associated with the following digitizer device numbers are supported: Matrox Solios type Digitizer device # Matrox Solios eCL/XCL dual-Base M_DEV0 and M_DEV1. Matrox Solios eCL/XCL single-Medium and Matrox Solios eCL/XCL-F M_DEV0. The following table lists the connectors of the auxiliary/control signals that can be used for each digitizer device number: Digitizer device # Matrox Solios eCL/XCL dual-Base and Matrox Solios eCL/XCL-F Matrox Solios eCL/XCL single-Medium M_DEV0 External auxiliary I/O connector 0 and 1, and Camera Link video input connector (MDR0). External auxiliary I/O connector 0 and 1, and Camera Link video input connector (MDR0), M_DEV1 External auxiliary I/O connector 0 and Camera Link video input connector (MDR1). Auxiliary I/O signals and camera control signals can have one or more functionalities (for example, trigger input, timer output, or user output, depending on the signal). Their possible functionalities are described in their description in the pinout table below. Shared input and output signals can be accessed by the digitizers with the specified M_DEV... number. Although a shared signal can be accessed by multiple digitizers, all the functionalities supported by the signal might not be accessible by all these digitizers. In the case of shared output signals, ensure that only one digitizer is driving the output. Matrox Solios eCL/XCL dual-base/single-Medium and eCL/XCL-F have 4 trigger controllers per acquisition path so that on-board events (for example, acquisition and timer output) can start upon different triggers if required. Although a trigger controller might support several trigger input signals, only one signal can drive a trigger controller at any given time. For example, if you set signal A as the trigger input source for acquisition, and signal B as the trigger input source for timer 1, signal A and B must be driving different trigger controllers; if they drive the same trigger controller, an error is generated. Note that you can set a signal (for example, signal A) as the trigger input source for both acquisition and timer 1; in this case, the associated trigger controller triggers both events at the same time. Only those auxiliary/camera control signals that have matching MIL information are included in this section. For information on internal connectors and a comprehensive list of all available input and output signals, refer to the board's installation and hardware reference manual. Board connectors On the Matrox Solios eCL/XCL dual-Base/single-Medium and eCL/XCL-F boards, there are several interface connectors. On their bracket, there are two Camera Link video input connectors. On the bracket of their adapter board, there are two external auxiliary I/O connectors (DBHD-44 and DB-9); these allow you to access the signals of the internal auxiliary I/O connector from outside the computer enclosure. All of Matrox Solios eCL/XCL dual-Base/single-Medium's and eCL/XCL-F's connectors have auxiliary/camera control signals with matching MIL information. Connector Name Connector Abbreviation Image Description Camera Link video input connectors MDR (0 and 1) The two Camera Link video input connectors are 26-pin high-density D ribbon connectors. They are used to receive video input, timing, and synchronization signals and transmit/receive communication signals between the video source and the frame grabber. External auxiliary I/O connector 0 DBHD-44 External auxiliary I/O connector 0 is a high-density D-subminiature 44-pin female connector. It is used to transmit timing and synchronization signals, and transmit/receive auxiliary signals. It is located on the adapter board, interfacing with the internal 50-pin auxiliary I/O connector on the main board. External auxiliary I/O connector 1 DB-9 External auxiliary I/O connector 1 is a standard D-subminiature 9-pin female connector. It is used to transmit/receive auxiliary signals. It is located on the adapter board, interfacing with the internal 50-pin auxiliary I/O connector on the main board. Signal names and their matching MIL constants The table below lists the auxiliary/camera control signals with their associated MIL information. Note that the MIL constants in this table are those to use with MIL 10 and later. If you are upgrading from a previous version of MIL, you should port your code using the conversion tables for the Matrox Solios eCL/XCL (MILSoliosCameraLinkIOConversionTable) in the MIL release notes. Sort by: MIL I/O information Connector and pin Hardware manual signal name Filter by: Show all Direction: input Direction: output Direction: input/output Timers Triggers Tables: Expanded Collapsed Digitizer device # Description MIL I/O # Pin information Direction User-bit information Trigger information Timer information Hardware manual signal name Digitizer device #: M_DEV0 Indicates the following. MIL I/O #: M_AUX_IO0 Shared with: M_DEV1 Opto-isolated auxiliary signal (input), shared between both acquisition paths for trigger input or user input, and dedicated to acquisition path 1 for field polarity input. Pin information Connector: DBHD-44&nbsp;Pin: 24+, 8- Direction Input Trigger information M_HARDWARE_PORT0; Digitizer device #: M_DEV0, M_DEV1; Trigger controller: 2 on acq path 0; 2 or 0 on acq path 1. Hardware manual signal name OPTO_AUX_IN0 MIL I/O #: M_AUX_IO1 Shared with: M_DEV1 Opto-isolated auxiliary signal (input), shared between both acquisition paths for trigger input or user input. Pin information Connector: DBHD-44&nbsp;Pin: 38+, 39- Direction Input Trigger information M_HARDWARE_PORT1; Digitizer device #: M_DEV0, M_DEV1; Trigger controller: 3 on acq path 0; 3 or 1 on acq path 1. Hardware manual signal name OPTO_AUX_IN1 MIL I/O #: M_AUX_IO2 Shared with: M_DEV1 TTL auxiliary signal (input/output), shared between both acquisition paths for trigger input or user input/output, and dedicated to acquisition path 0 for timer output. Pin information Connector: DBHD-44&nbsp;Pin: 43 Direction Input/Output User-bit information MIL user-bit #: M_USER_BIT4; Digitizer device #: M_DEV0, M_DEV1; (Hardware manual user signal rank 1 : 4 on acq path 0 ; 7 on acq path 1 ) Trigger information M_HARDWARE_PORT2; Digitizer device #: M_DEV0, M_DEV1; Trigger controller: 2 on acq path 0; 2 on acq path 1. Timer information Timer: M_TIMER2; Digitizer device #: M_DEV0; Hardware manual signal name TTL_AUX_IO_0 MIL I/O #: M_AUX_IO3 Shared with: M_DEV1 TTL auxiliary signal (input/output), shared between both acquisition paths for trigger input or user input/output, and dedicated to acquisition path 1 for timer output. Pin information Connector: DBHD-44&nbsp;Pin: 15 Direction Input/Output User-bit information MIL user-bit #: M_USER_BIT5; Digitizer device #: M_DEV0, M_DEV1; (Hardware manual user signal rank 1 : 7 on acq path 0 ; 4 on acq path 1 ) Trigger information M_HARDWARE_PORT3; Digitizer device #: M_DEV0, M_DEV1; Trigger controller: 3 on acq path 0; 3 on acq path 1. Timer information Timer: M_TIMER2; Digitizer device #: M_DEV1; Hardware manual signal name TTL_AUX_IO_1 MIL I/O #: M_AUX_IO4 Shared with: M_DEV1 LVDS auxiliary signal (input), shared between both acquisition paths for trigger input or user input, and dedicated to acquisition path 1 for field polarity input or quadrature input bit 0. Pin information Connector: DBHD-44&nbsp;Pin: 32+, 31- Direction Input Trigger information M_HARDWARE_PORT4; Digitizer device #: M_DEV0, M_DEV1; Trigger controller: 2 on acq path 0; 2 or 0 on acq path 1. Hardware manual signal name LVDS_AUX_IN0 MIL I/O #: M_AUX_IO5 Shared with: M_DEV1 LVDS auxiliary signal (input), shared between both acquisition paths for trigger input or user input, and dedicated to acquisition path 1 for timer clock input or quadrature input bit 1. Pin information Connector: DBHD-44&nbsp;Pin: 12+, 28- Direction Input Trigger information M_HARDWARE_PORT5; Digitizer device #: M_DEV0, M_DEV1; Trigger controller: 3 on acq path 0; 3 or 1 on acq path 1. Hardware manual signal name LVDS_AUX_IN1 MIL I/O #: M_AUX_IO6 Opto-isolated auxiliary signal (input) for acquisition path 0, which supports: trigger input, user input, or field polarity input. Pin information Connector: DB-9&nbsp;Pin: 7+, 2- Direction Input Trigger information M_HARDWARE_PORT6; Digitizer device #: M_DEV0; Trigger controller: 0 on acq path 0. Hardware manual signal name P0_OPTO_AUX_IN0 MIL I/O #: M_AUX_IO7 Opto-isolated auxiliary signal (input) for acquisition path 0, which supports: trigger input or user input. Pin information Connector: DB-9&nbsp;Pin: 4+, 5- Direction Input Trigger information M_HARDWARE_PORT7; Digitizer device #: M_DEV0; Trigger controller: 1 on acq path 0. Hardware manual signal name P0_OPTO_AUX_IN1 MIL I/O #: M_AUX_IO8 TTL auxiliary signal (input/output) for acquisition path 0, which supports: timer output, trigger input, user input/output, or field polarity input. Pin information Connector: DB-9&nbsp;Pin: 1 Direction Input/Output User-bit information MIL user-bit #: M_USER_BIT2; Digitizer device #: M_DEV0; (Hardware manual user signal rank 1 : 2 on acq path 0 ) Trigger information M_HARDWARE_PORT8; Digitizer device #: M_DEV0; Trigger controller: 0 on acq path 0. Timer information Timer: M_TIMER3; Digitizer device #: M_DEV0; Hardware manual signal name P0_TTL_AUX_IO_0 MIL I/O #: M_AUX_IO9 TTL auxiliary signal (input/output) for acquisition path 0, which supports: timer output, trigger input, or user input/output. Pin information Connector: DBHD-44&nbsp;Pin: 13 Direction Input/Output User-bit information MIL user-bit #: M_USER_BIT3; Digitizer device #: M_DEV0; (Hardware manual user signal rank 1 : 3 on acq path 0 ) Trigger information M_HARDWARE_PORT9; Digitizer device #: M_DEV0; Trigger controller: 1 on acq path 0. Timer information Timer: M_TIMER1/M_TIMER4; Digitizer device #: M_DEV0; Hardware manual signal name P0_TTL_AUX_IO_1 MIL I/O #: M_AUX_IO10 LVDS auxiliary signal (input) for acquisition path 0, which supports: trigger input, user input, field polarity input, or quadrature input bit 0. Pin information Connector: DB-9&nbsp;Pin: 8+, 3- Direction Input Trigger information M_HARDWARE_PORT10; Digitizer device #: M_DEV0; Trigger controller: 0 on acq path 0. Hardware manual signal name P0_LVDS_AUX_IN0 MIL I/O #: M_AUX_IO11 LVDS auxiliary signal (input) for acquisition path 0, which supports: trigger input, user input, timer clock input, or quadrature input bit 1. Pin information Connector: DBHD-44&nbsp;Pin: 37+, 23- Direction Input Trigger information M_HARDWARE_PORT11; Digitizer device #: M_DEV0; Trigger controller: 1 on acq path 0. Hardware manual signal name P0_LVDS_AUX_IN1 MIL I/O #: M_AUX_IO12 LVDS auxiliary signal (output) for acquisition path 0, which supports: timer output or user output. Pin information Connector: DBHD-44&nbsp;Pin: 20+, 4- Direction Output User-bit information MIL user-bit #: M_USER_BIT0; Digitizer device #: M_DEV0; (Hardware manual user signal rank 1 : 5 on acq path 0 ) Timer information Timer: M_TIMER1; Digitizer device #: M_DEV0; Hardware manual signal name P0_LVDS_AUX_OUT0 MIL I/O #: M_AUX_IO13 LVDS auxiliary signal (output) for acquisition path 0, which supports: timer output or user output. Pin information Connector: DBHD-44&nbsp;Pin: 19+, 3- Direction Output User-bit information MIL user-bit #: M_USER_BIT1; Digitizer device #: M_DEV0; (Hardware manual user signal rank 1 : 6 on acq path 0 ) Timer information Timer: M_TIMER2; Digitizer device #: M_DEV0; Hardware manual signal name P0_LVDS_AUX_OUT1 MIL I/O #: M_CC_IO1 Camera control output 1 for acquisition path 0, which supports: timer output, user output, VSYNC, HSYNC, clock output, or rerouting of specific auxiliary input signals. Only the following auxiliary input signals can be rerouted to this output signal: M_AUX_IO1 on M_DEV0 and M_DEV1 ( OPTO_AUX_IN1 ). M_AUX_IO2 on M_DEV0 and M_DEV1 ( TTL_AUX_IO_0 ). M_AUX_IO5 on M_DEV0 and M_DEV1 ( LVDS_AUX_IN1 ). M_AUX_IO7 on M_DEV0 ( P0_OPTO_AUX_IN1 ). M_AUX_IO8 on M_DEV0 ( P0_TTL_AUX_IO_0 ). M_AUX_IO10 on M_DEV0 ( P0_LVDS_AUX_IN0 ). Pin information Connector: MDR (0)&nbsp;Pin: 5+, 18- Direction Output User-bit information MIL user-bit #: M_USER_BIT_CC_IO0/M_USER_BIT_CC_IO1; Digitizer device #: M_DEV0; Timer information Timer: M_TIMER1/M_TIMER2; Digitizer device #: M_DEV0; Hardware manual signal name CC1 (0) MIL I/O #: M_CC_IO2 Camera control output 2 for acquisition path 0, which supports: timer output, user output, VSYNC, HSYNC, clock output, or rerouting of specific auxiliary input signals. Only the following auxiliary input signals can be rerouted to this output signal: M_AUX_IO1 on M_DEV0 and M_DEV1 ( OPTO_AUX_IN1 ). M_AUX_IO2 on M_DEV0 and M_DEV1 ( TTL_AUX_IO_0 ). M_AUX_IO5 on M_DEV0 and M_DEV1 ( LVDS_AUX_IN1 ). M_AUX_IO7 on M_DEV0 ( P0_OPTO_AUX_IN1 ). M_AUX_IO8 on M_DEV0 ( P0_TTL_AUX_IO_0 ). M_AUX_IO10 on M_DEV0 ( P0_LVDS_AUX_IN0 ). Pin information Connector: MDR (0)&nbsp;Pin: 17+, 4- Direction Output User-bit information MIL user-bit #: M_USER_BIT_CC_IO0/M_USER_BIT_CC_IO1; Digitizer device #: M_DEV0; Timer information Timer: M_TIMER1/M_TIMER2; Digitizer device #: M_DEV0; Hardware manual signal name CC2 (0) MIL I/O #: M_CC_IO3 Camera control output 3 for acquisition path 0, which supports: timer output, user output, VSYNC, HSYNC, clock output, or rerouting of specific auxiliary input signals. Only the following auxiliary input signals can be rerouted to this output signal: M_AUX_IO1 on M_DEV0 and M_DEV1 ( OPTO_AUX_IN1 ). M_AUX_IO2 on M_DEV0 and M_DEV1 ( TTL_AUX_IO_0 ). M_AUX_IO5 on M_DEV0 and M_DEV1 ( LVDS_AUX_IN1 ). M_AUX_IO7 on M_DEV0 ( P0_OPTO_AUX_IN1 ). M_AUX_IO8 on M_DEV0 ( P0_TTL_AUX_IO_0 ). M_AUX_IO10 on M_DEV0 ( P0_LVDS_AUX_IN0 ). Pin information Connector: MDR (0)&nbsp;Pin: 3+, 16- Direction Output User-bit information MIL user-bit #: M_USER_BIT_CC_IO0/M_USER_BIT_CC_IO1; Digitizer device #: M_DEV0; Timer information Timer: M_TIMER1/M_TIMER2; Digitizer device #: M_DEV0; Hardware manual signal name CC3 (0) MIL I/O #: M_CC_IO4 Camera control output 4 for acquisition path 0, which supports: timer output, user output, VSYNC, HSYNC, clock output, or rerouting of specific auxiliary input signals. Only the following auxiliary input signals can be rerouted to this output signal: M_AUX_IO1 on M_DEV0 and M_DEV1 ( OPTO_AUX_IN1 ). M_AUX_IO2 on M_DEV0 and M_DEV1 ( TTL_AUX_IO_0 ). M_AUX_IO5 on M_DEV0 and M_DEV1 ( LVDS_AUX_IN1 ). M_AUX_IO7 on M_DEV0 ( P0_OPTO_AUX_IN1 ). M_AUX_IO8 on M_DEV0 ( P0_TTL_AUX_IO_0 ). M_AUX_IO10 on M_DEV0 ( P0_LVDS_AUX_IN0 ). Pin information Connector: MDR (0)&nbsp;Pin: 15+, 2- Direction Output User-bit information MIL user-bit #: M_USER_BIT_CC_IO0/M_USER_BIT_CC_IO1; Digitizer device #: M_DEV0; Timer information Timer: M_TIMER1/M_TIMER2; Digitizer device #: M_DEV0; Hardware manual signal name CC4 (0) Digitizer device #: M_DEV1 Indicates the following. MIL I/O #: M_AUX_IO0 Shared with: M_DEV0 Opto-isolated auxiliary signal (input), shared between both acquisition paths for trigger input or user input, and dedicated to acquisition path 1 for field polarity input. Pin information Connector: DBHD-44&nbsp;Pin: 24+, 8- Direction Input Trigger information M_HARDWARE_PORT0; Digitizer device #: M_DEV0, M_DEV1; Trigger controller: 2 on acq path 0; 2 or 0 on acq path 1. Hardware manual signal name OPTO_AUX_IN0 MIL I/O #: M_AUX_IO1 Shared with: M_DEV0 Opto-isolated auxiliary signal (input), shared between both acquisition paths for trigger input or user input. Pin information Connector: DBHD-44&nbsp;Pin: 38+, 39- Direction Input Trigger information M_HARDWARE_PORT1; Digitizer device #: M_DEV0, M_DEV1; Trigger controller: 3 on acq path 0; 3 or 1 on acq path 1. Hardware manual signal name OPTO_AUX_IN1 MIL I/O #: M_AUX_IO2 Shared with: M_DEV0 TTL auxiliary signal (input/output), shared between both acquisition paths for trigger input or user input/output, and dedicated to acquisition path 0 for timer output. Pin information Connector: DBHD-44&nbsp;Pin: 43 Direction Input/Output User-bit information MIL user-bit #: M_USER_BIT4; Digitizer device #: M_DEV0, M_DEV1; (Hardware manual user signal rank 1 : 4 on acq path 0 ; 7 on acq path 1 ) Trigger information M_HARDWARE_PORT2; Digitizer device #: M_DEV0, M_DEV1; Trigger controller: 2 on acq path 0; 2 on acq path 1. Timer information Timer: M_TIMER2; Digitizer device #: M_DEV0; Hardware manual signal name TTL_AUX_IO_0 MIL I/O #: M_AUX_IO3 Shared with: M_DEV0 TTL auxiliary signal (input/output), shared between both acquisition paths for trigger input or user input/output, and dedicated to acquisition path 1 for timer output. Pin information Connector: DBHD-44&nbsp;Pin: 15 Direction Input/Output User-bit information MIL user-bit #: M_USER_BIT5; Digitizer device #: M_DEV0, M_DEV1; (Hardware manual user signal rank 1 : 7 on acq path 0 ; 4 on acq path 1 ) Trigger information M_HARDWARE_PORT3; Digitizer device #: M_DEV0, M_DEV1; Trigger controller: 3 on acq path 0; 3 on acq path 1. Timer information Timer: M_TIMER2; Digitizer device #: M_DEV1; Hardware manual signal name TTL_AUX_IO_1 MIL I/O #: M_AUX_IO4 Shared with: M_DEV0 LVDS auxiliary signal (input), shared between both acquisition paths for trigger input or user input, and dedicated to acquisition path 1 for field polarity input or quadrature input bit 0. Pin information Connector: DBHD-44&nbsp;Pin: 32+, 31- Direction Input Trigger information M_HARDWARE_PORT4; Digitizer device #: M_DEV0, M_DEV1; Trigger controller: 2 on acq path 0; 2 or 0 on acq path 1. Hardware manual signal name LVDS_AUX_IN0 MIL I/O #: M_AUX_IO5 Shared with: M_DEV0 LVDS auxiliary signal (input), shared between both acquisition paths for trigger input or user input, and dedicated to acquisition path 1 for timer clock input or quadrature input bit 1. Pin information Connector: DBHD-44&nbsp;Pin: 12+, 28- Direction Input Trigger information M_HARDWARE_PORT5; Digitizer device #: M_DEV0, M_DEV1; Trigger controller: 3 on acq path 0; 3 or 1 on acq path 1. Hardware manual signal name LVDS_AUX_IN1 MIL I/O #: M_AUX_IO8 TTL auxiliary signal (input/output) for acquisition path 1, which supports: timer output, trigger input, user input/output, or field polarity input. Pin information Connector: DBHD-44&nbsp;Pin: 35 Direction Input/Output User-bit information MIL user-bit #: M_USER_BIT2; Digitizer device #: M_DEV1; (Hardware manual user signal rank 1 : 2 on acq path 1 ) Trigger information M_HARDWARE_PORT8; Digitizer device #: M_DEV1; Trigger controller: 0 on acq path 1. Timer information Timer: M_TIMER3; Digitizer device #: M_DEV1; Hardware manual signal name P1_TTL_AUX_IO_0 MIL I/O #: M_AUX_IO9 TTL auxiliary signal (input/output) for acquisition path 1, which supports: timer output, trigger input, or user input/output. Pin information Connector: DBHD-44&nbsp;Pin: 1 Direction Input/Output User-bit information MIL user-bit #: M_USER_BIT3; Digitizer device #: M_DEV1; (Hardware manual user signal rank 1 : 3 on acq path 1 ) Trigger information M_HARDWARE_PORT9; Digitizer device #: M_DEV1; Trigger controller: 1 on acq path 1. Timer information Timer: M_TIMER1; Digitizer device #: M_DEV1; Hardware manual signal name P1_TTL_AUX_IO_1 MIL I/O #: M_AUX_IO12 LVDS auxiliary signal (output) for acquisition path 1, which supports: timer output or user output. Pin information Connector: DBHD-44&nbsp;Pin: 33+, 18- Direction Output User-bit information MIL user-bit #: M_USER_BIT0; Digitizer device #: M_DEV1; (Hardware manual user signal rank 1 : 5 on acq path 1 ) Timer information Timer: M_TIMER1; Digitizer device #: M_DEV1; Hardware manual signal name P1_LVDS_AUX_OUT0 MIL I/O #: M_AUX_IO13 LVDS auxiliary signal (output) for acquisition path 1, which supports: timer output or user output. Pin information Connector: DBHD-44&nbsp;Pin: 2+, 17- Direction Output User-bit information MIL user-bit #: M_USER_BIT1; Digitizer device #: M_DEV1; (Hardware manual user signal rank 1 : 6 on acq path 1 ) Timer information Timer: M_TIMER2; Digitizer device #: M_DEV1; Hardware manual signal name P1_LVDS_AUX_OUT1 MIL I/O #: M_CC_IO1 Camera control output 1 for acquisition path 1, which supports: timer output, user output, VSYNC, HSYNC, clock output, or rerouting of specific auxiliary input signals. Only the following auxiliary input signals can be rerouted to this output signal: M_AUX_IO0 on M_DEV0 and M_DEV1 ( OPTO_AUX_IN0 ). M_AUX_IO1 on M_DEV0 and M_DEV1 ( OPTO_AUX_IN1 ). M_AUX_IO2 on M_DEV0 and M_DEV1 ( TTL_AUX_IO_0 ). M_AUX_IO4 on M_DEV0 and M_DEV1 ( LVDS_AUX_IN0 ). M_AUX_IO5 on M_DEV0 and M_DEV1 ( LVDS_AUX_IN1 ). M_AUX_IO8 on M_DEV1 ( P1_TTL_AUX_IO_0 ). Pin information Connector: MDR (1)&nbsp;Pin: 5+, 18- Direction Output User-bit information MIL user-bit #: M_USER_BIT_CC_IO0/M_USER_BIT_CC_IO1; Digitizer device #: M_DEV1; Timer information Timer: M_TIMER1/M_TIMER2; Digitizer device #: M_DEV1; Hardware manual signal name CC1 (1) MIL I/O #: M_CC_IO2 Camera control output 2 for acquisition path 1, which supports: timer output, user output, VSYNC, HSYNC, clock output, or rerouting of specific auxiliary input signals. Only the following auxiliary input signals can be rerouted to this output signal: M_AUX_IO0 on M_DEV0 and M_DEV1 ( OPTO_AUX_IN0 ). M_AUX_IO1 on M_DEV0 and M_DEV1 ( OPTO_AUX_IN1 ). M_AUX_IO2 on M_DEV0 and M_DEV1 ( TTL_AUX_IO_0 ). M_AUX_IO4 on M_DEV0 and M_DEV1 ( LVDS_AUX_IN0 ). M_AUX_IO5 on M_DEV0 and M_DEV1 ( LVDS_AUX_IN1 ). M_AUX_IO8 on M_DEV1 ( P1_TTL_AUX_IO_0 ). Pin information Connector: MDR (1)&nbsp;Pin: 17+, 4- Direction Output User-bit information MIL user-bit #: M_USER_BIT_CC_IO0/M_USER_BIT_CC_IO1; Digitizer device #: M_DEV1; Timer information Timer: M_TIMER1/M_TIMER2; Digitizer device #: M_DEV1; Hardware manual signal name CC2 (1) MIL I/O #: M_CC_IO3 Camera control output 3 for acquisition path 1, which supports: timer output, user output, VSYNC, HSYNC, clock output, or rerouting of specific auxiliary input signals. Only the following auxiliary input signals can be rerouted to this output signal: M_AUX_IO0 on M_DEV0 and M_DEV1 ( OPTO_AUX_IN0 ). M_AUX_IO1 on M_DEV0 and M_DEV1 ( OPTO_AUX_IN1 ). M_AUX_IO2 on M_DEV0 and M_DEV1 ( TTL_AUX_IO_0 ). M_AUX_IO4 on M_DEV0 and M_DEV1 ( LVDS_AUX_IN0 ). M_AUX_IO5 on M_DEV0 and M_DEV1 ( LVDS_AUX_IN1 ). M_AUX_IO8 on M_DEV1 ( P1_TTL_AUX_IO_0 ). Pin information Connector: MDR (1)&nbsp;Pin: 3+, 16- Direction Output User-bit information MIL user-bit #: M_USER_BIT_CC_IO0/M_USER_BIT_CC_IO1; Digitizer device #: M_DEV1; Timer information Timer: M_TIMER1/M_TIMER2; Digitizer device #: M_DEV1; Hardware manual signal name CC3 (1) MIL I/O #: M_CC_IO4 Camera control output 4 for acquisition path 1, which supports: timer output, user output, VSYNC, HSYNC, clock output, or rerouting of specific auxiliary input signals. Only the following auxiliary input signals can be rerouted to this output signal: M_AUX_IO0 on M_DEV0 and M_DEV1 ( OPTO_AUX_IN0 ). M_AUX_IO1 on M_DEV0 and M_DEV1 ( OPTO_AUX_IN1 ). M_AUX_IO2 on M_DEV0 and M_DEV1 ( TTL_AUX_IO_0 ). M_AUX_IO4 on M_DEV0 and M_DEV1 ( LVDS_AUX_IN0 ). M_AUX_IO5 on M_DEV0 and M_DEV1 ( LVDS_AUX_IN1 ). M_AUX_IO8 on M_DEV1 ( P1_TTL_AUX_IO_0 ). Pin information Connector: MDR (1)&nbsp;Pin: 15+, 2- Direction Output User-bit information MIL user-bit #: M_USER_BIT_CC_IO0/M_USER_BIT_CC_IO1; Digitizer device #: M_DEV1; Timer information Timer: M_TIMER1/M_TIMER2; Digitizer device #: M_DEV1; Hardware manual signal name CC4 (1) expandTable(\"mil_io_information_show_all\"); 1 The user-bit number in the Installation and Hardware Reference manual is just a rank; use the MIL user-bit number instead. Matrox Solios eCL/XCL dual-Base/single-Medium and cCL/XCL-F connectors and signal names Board connectors Signal names and their matching MIL constants ",
      "wordCount": 3526,
      "subEntries": []
    },
    {
      "id": "BSN_solios_Matrox_Solios_XA_connectors_and_signal_names",
      "version": null,
      "title": "Matrox Solios eA/XA connectors and signal names",
      "subTitles": [
        "Board connectors",
        "Signal names and their matching MIL constants"
      ],
      "location": "MIL Hardware-specific Notes",
      "pageURL": "content\\BoardSpecificNotes\\solios\\Matrox_Solios_XA_connectors_and_signal_names.htm",
      "text": " Matrox Solios eA/XA connectors and signal names This section serves as a reference to match Matrox Solios eA/XA's connectors and auxiliary signals with MIL information, such as MIL auxiliary signal numbers. To set/inquire all the settings for this board's auxiliary signals (for example, signal routing and timer settings), use MdigControl() / MdigInquire(), respectively. Matrox Solios eA/XA has three versions, each with a different number of acquisitions paths and auxiliary signals. For each version of Matrox Solios eA/XA, only the auxiliary signals associated with he following digitizer device numbers are supported: Matrox Solios type Digitizer device # Matrox Solios eA/xA (Single) M_DEV0. Matrox Solios eA/xA (Dual) M_DEV0 and M_DEV1. Matrox Solios eA/xA (Quad) M_DEV0, M_DEV1, M_DEV2, and M_DEV3. The following table lists the connectors of the auxiliary signals that can be used for each digitizer device number: Digitizer device # Matrox Solios eA/xA Single Matrox Solios eA/xA Dual Matrox Solios eA/xA Quad M_DEV0 External auxiliary I/O connector 0 and 1, and analog video input connector 0. External auxiliary I/O connector 0 and 1, and analog video input connector 0. External auxiliary I/O connector 0 and 1, and analog video input connector 0. M_DEV1 External auxiliary I/O connector 0 and 1, and analog video input connector 0. External auxiliary I/O connector 0 and 1, and analog video input connector 0. M_DEV2 External auxiliary I/O connector 0 and 1, and analog video input connector 1. M_DEV3 External auxiliary I/O connector 0 and 1, and analog video input connector 1. Auxiliary I/O signals can have one or more functionalities (for example, trigger input, timer output, or user output, depending on the signal). Their possible functionalities are described in their description in the pinout table below. Shared input and output signals can be accessed by the digitizers with the specified M_DEV... number. Although a shared signal can be accessed by multiple digitizers, all the functionalities supported by the signal might not be accessible by all these digitizers. In the case of shared output signals, ensure that only one digitizer is driving the output. This board has 4 trigger controllers per acquisition path so that on-board events (for example, acquisition and timer output) can start upon different triggers if required. Although a trigger controller might support several trigger input signals, only one signal can drive a trigger controller at any given time. For example, if you set signal A as the trigger input source for acquisition, and signal B as the trigger input source for timer 1, signal A and B must be driving different trigger controllers; if they drive the same trigger controller, an error is generated. Note that you can set a signal (for example, signal A) as the trigger input source for both acquisition and timer 1; in this case, the associated trigger controller triggers both events at the same time. Only those auxiliary signals that have matching MIL information are included in this section. For information on internal connectors and a comprehensive list of all available input and output signals, refer to the board's installation and hardware reference manual. Board connectors On Matrox Solios eA/XA, there are two DVI analog video input connectors. On the bracket of the LVDS cable adapter board, there are two external auxiliary I/O connectors (DBHD-44 and DB-9); these allow you to access the signals of the 50-pin internal auxiliary I/O connector from outside the computer enclosure. All of Matrox Solios eA/XA's connectors have auxiliary signals with matching MIL information. Connector Name Connector Abbreviation Image Description Analog video input connectors DVI (0 and 1) The two analog video input connectors are DVI connectors. They are used to receive video input signals and transmit/receive timing, synchronization, and communication signals between the video source and the frame grabber. External auxiliary I/O connector 0 DBHD-44 External auxiliary I/O connector 0 is a high-density D-subminiature 44-pin female connector, located on the bracket of the LVDS cable adapter board. This connector is used to transmit/receive auxiliary signals. External auxiliary I/O connector 1 DB-9 External auxiliary I/O connector 1 is a standard D-subminiature 9-pin female connector, located on the bracket of the LVDS cable adapter board. This connector is used to receive opto-isolated auxiliary input signals. Signal names and their matching MIL constants The table below lists the auxiliary signals with their associated MIL information. Note that the MIL constants in this table are those to use with MIL 10 and later. If you are upgrading from a previous version of MIL, you should port your code using the conversion tables (MilSoliosAnalogIOConversionTable) for Matrox Solios eA/XA in the MIL release notes. Sort by: MIL I/O information Connector and pin Hardware manual signal name Filter by: Show all Direction: input Direction: output Direction: input/output Timers Triggers Tables: Expanded Collapsed Digitizer device # Description MIL I/O # Pin information Direction User-bit information Trigger information Timer information Hardware manual signal name Digitizer device #: M_DEV0 Indicates the following. MIL I/O #: M_AUX_IO0 Opto-isolated auxiliary signal (input) for acquisition path 0, which supports: trigger input or user input. Pin information Connector: DB-9&nbsp;Pin: 7+, 2- Direction Input Trigger information M_HARDWARE_PORT0; Digitizer device #: M_DEV0; Trigger controller: 1 on acq path 0. Hardware manual signal name P0_OPTO_AUX(TRIG)_IN MIL I/O #: M_AUX_IO1 TTL auxiliary signal (input) for acquisition path 0, which supports: trigger input, field polarity input, or user input. Pin information Connector: DVI (0)&nbsp;Pin: 14 Direction Input Trigger information M_HARDWARE_PORT1; Digitizer device #: M_DEV0; Trigger controller: 0 on acq path 0. Hardware manual signal name P0_TTL_AUX(TRIG)_IN MIL I/O #: M_AUX_IO2 Shared with: M_DEV1, M_DEV2, M_DEV3 LVDS or TTL auxiliary signal (input), shared between all acquisition paths for trigger or user input, and dedicated to acquisition path 0 for field polarity, data valid, CSYNC, or HSYNC input. Pin information Connector: DBHD-44&nbsp;Pin: 35+, 34- Direction Input Trigger information M_HARDWARE_PORT2; Digitizer device #: M_DEV0, M_DEV1, M_DEV2, M_DEV3; Trigger controller: 2 on acq path 0; 2 on acq path 1; 2 on acq path 2; 2 on acq path 3. Hardware manual signal name LVDS/TTL_AUX_IN0 MIL I/O #: M_AUX_IO3 Shared with: M_DEV1, M_DEV2, M_DEV3 LVDS or TTL auxiliary signal (input), shared between all acquisition paths for trigger or user input, and dedicated to acquisition path 0 for timer clock or VSYNC input. Pin information Connector: DBHD-44&nbsp;Pin: 12+, 28- Direction Input Trigger information M_HARDWARE_PORT3; Digitizer device #: M_DEV0, M_DEV1, M_DEV2, M_DEV3; Trigger controller: 3 on acq path 0; 3 on acq path 1; 3 on acq path 2; 3 on acq path 3. Hardware manual signal name LVDS/TTL_AUX_IN1 MIL I/O #: M_AUX_IO4 Shared with: M_DEV1, M_DEV2, M_DEV3 LVDS or TTL auxiliary signal (input), shared between all acquisition paths for trigger or user input, and dedicated to acquisition path 1 for field polarity, data valid, CSYNC, or HSYNC input. Pin information Connector: DBHD-44&nbsp;Pin: 8+, 24- Direction Input Trigger information M_HARDWARE_PORT4; Digitizer device #: M_DEV0, M_DEV1, M_DEV2, M_DEV3; Trigger controller: 2 on acq path 0; 2 on acq path 1; 2 on acq path 2; 2 on acq path 3. Hardware manual signal name LVDS/TTL_AUX_IN2 MIL I/O #: M_AUX_IO5 Shared with: M_DEV1, M_DEV2, M_DEV3 LVDS or TTL auxiliary signal (input), shared between all acquisition paths for trigger or user input, and dedicated to acquisition path 1 for field polarity, data valid, CSYNC, or HSYNC input. Pin information Connector: DBHD-44&nbsp;Pin: 39+, 38- Direction Input Trigger information M_HARDWARE_PORT5; Digitizer device #: M_DEV0, M_DEV1, M_DEV2, M_DEV3; Trigger controller: 3 on acq path 0; 3 on acq path 1; 3 on acq path 2; 3 on acq path 3. Hardware manual signal name LVDS/TTL_AUX_IN3 MIL I/O #: M_AUX_IO6 Shared with: M_DEV1, M_DEV2, M_DEV3 LVDS or TTL auxiliary signal (input), shared between all acquisition paths for trigger or user input, and dedicated to acquisition path 2 for field polarity, data valid, CSYNC, or HSYNC input. Pin information Connector: DBHD-44&nbsp;Pin: 7+, 22- Direction Input Trigger information M_HARDWARE_PORT6; Digitizer device #: M_DEV0, M_DEV1, M_DEV2, M_DEV3; Trigger controller: 2 on acq path 0; 2 on acq path 1; 2 on acq path 2; 2 on acq path 3. Hardware manual signal name LVDS/TTL_AUX_IN4 MIL I/O #: M_AUX_IO7 Shared with: M_DEV1, M_DEV2, M_DEV3 LVDS or TTL auxiliary signal (input), shared between all acquisition paths for trigger or user input, and dedicated to acquisition path 2 for field polarity, data valid, CSYNC, or HSYNC input. Pin information Connector: DBHD-44&nbsp;Pin: 6+, 5- Direction Input Trigger information M_HARDWARE_PORT7; Digitizer device #: M_DEV0, M_DEV1, M_DEV2, M_DEV3; Trigger controller: 3 on acq path 0; 3 on acq path 1; 3 on acq path 2; 3 on acq path 3. Hardware manual signal name LVDS/TTL_AUX_IN5 MIL I/O #: M_AUX_IO8 Shared with: M_DEV1, M_DEV2, M_DEV3 LVDS or TTL auxiliary signal (input), shared between all acquisition paths for trigger or user input, and dedicated to acquisition path 3 for field polarity, data valid, CSYNC, or HSYNC input. Pin information Connector: DBHD-44&nbsp;Pin: 32+, 31- Direction Input Trigger information M_HARDWARE_PORT8; Digitizer device #: M_DEV0, M_DEV1, M_DEV2, M_DEV3; Trigger controller: 2 on acq path 0; 2 on acq path 1; 2 on acq path 2; 2 on acq path 3. Hardware manual signal name LVDS/TTL_AUX_IN6 MIL I/O #: M_AUX_IO9 Shared with: M_DEV1, M_DEV2, M_DEV3 LVDS or TTL auxiliary signal (input), shared between all acquisition paths for trigger or user input, and dedicated to acquisition path 3 for field polarity, data valid, CSYNC, or HSYNC input. Pin information Connector: DBHD-44&nbsp;Pin: 1+, 16- Direction Input Trigger information M_HARDWARE_PORT9; Digitizer device #: M_DEV0, M_DEV1, M_DEV2, M_DEV3; Trigger controller: 3 on acq path 0; 3 on acq path 1; 3 on acq path 2; 3 on acq path 3. Hardware manual signal name LVDS/TTL_AUX_IN7 MIL I/O #: M_AUX_IO10 LVDS or TTL auxiliary signal (output) for acquisition path 0, which supports: user output, timer output, or HSYNC output. Pin information Connector: DBHD-44&nbsp;Pin: 15+, 30- Direction Output User-bit information MIL user-bit #: M_USER_BIT0; Digitizer device #: M_DEV0; (Hardware manual user signal rank 1 : 0 on acq path 0 ) Timer information Timer: M_TIMER1; Digitizer device #: M_DEV0; Hardware manual signal name P0_LVDS/TTL_AUX_OUT0 MIL I/O #: M_AUX_IO11 LVDS or TTL auxiliary signal (output) for acquisition path 0, which supports: user output, timer output, or VSYNC output. Pin information Connector: DBHD-44&nbsp;Pin: 44+, 29- Direction Output User-bit information MIL user-bit #: M_USER_BIT1; Digitizer device #: M_DEV0; (Hardware manual user signal rank 1 : 1 on acq path 0 ) Timer information Timer: M_TIMER2; Digitizer device #: M_DEV0; Hardware manual signal name P0_LVDS/TTL_AUX_OUT1 MIL I/O #: M_AUX_IO12 TTL auxiliary signal (output) for acquisition path 0, which supports: timer output or user output. Pin information Connector: DVI (0)&nbsp;Pin: 23 Direction Output User-bit information MIL user-bit #: M_USER_BIT2; Digitizer device #: M_DEV0; (Hardware manual user signal rank 1 : 2 on acq path 0 ) Timer information Timer: M_TIMER1; Digitizer device #: M_DEV0; Hardware manual signal name P0_TTL_AUX(EXP)_OUT Digitizer device #: M_DEV1 Indicates the following. MIL I/O #: M_AUX_IO0 Opto-isolated auxiliary signal (input) for acquisition path 1, which supports: trigger input or user input. Pin information Connector: DB-9&nbsp;Pin: 4+, 5- Direction Input Trigger information M_HARDWARE_PORT0; Digitizer device #: M_DEV1; Trigger controller: 1 on acq path 1. Hardware manual signal name P1_OPTO_AUX(TRIG)_IN MIL I/O #: M_AUX_IO1 TTL auxiliary signal (input) for acquisition path 1, which supports: trigger input, field polarity input, or user input. Pin information Connector: DVI (0)&nbsp;Pin: 22 Direction Input Trigger information M_HARDWARE_PORT1; Digitizer device #: M_DEV1; Trigger controller: 0 on acq path 1. Hardware manual signal name P1_TTL_AUX(TRIG)_IN MIL I/O #: M_AUX_IO2 Shared with: M_DEV0, M_DEV2, M_DEV3 LVDS or TTL auxiliary signal (input), shared between all acquisition paths for trigger or user input, and dedicated to acquisition path 0 for field polarity, data valid, CSYNC, or HSYNC input. Pin information Connector: DBHD-44&nbsp;Pin: 35+, 34- Direction Input Trigger information M_HARDWARE_PORT2; Digitizer device #: M_DEV0, M_DEV1, M_DEV2, M_DEV3; Trigger controller: 2 on acq path 0; 2 on acq path 1; 2 on acq path 2; 2 on acq path 3. Hardware manual signal name LVDS/TTL_AUX_IN0 MIL I/O #: M_AUX_IO3 Shared with: M_DEV0, M_DEV2, M_DEV3 LVDS or TTL auxiliary signal (input), shared between all acquisition paths for trigger or user input, and dedicated to acquisition path 0 for timer clock or VSYNC input. Pin information Connector: DBHD-44&nbsp;Pin: 12+, 28- Direction Input Trigger information M_HARDWARE_PORT3; Digitizer device #: M_DEV0, M_DEV1, M_DEV2, M_DEV3; Trigger controller: 3 on acq path 0; 3 on acq path 1; 3 on acq path 2; 3 on acq path 3. Hardware manual signal name LVDS/TTL_AUX_IN1 MIL I/O #: M_AUX_IO4 Shared with: M_DEV0, M_DEV2, M_DEV3 LVDS or TTL auxiliary signal (input), shared between all acquisition paths for trigger or user input, and dedicated to acquisition path 1 for field polarity, data valid, CSYNC, or HSYNC input. Pin information Connector: DBHD-44&nbsp;Pin: 8+, 24- Direction Input Trigger information M_HARDWARE_PORT4; Digitizer device #: M_DEV0, M_DEV1, M_DEV2, M_DEV3; Trigger controller: 2 on acq path 0; 2 on acq path 1; 2 on acq path 2; 2 on acq path 3. Hardware manual signal name LVDS/TTL_AUX_IN2 MIL I/O #: M_AUX_IO5 Shared with: M_DEV0, M_DEV2, M_DEV3 LVDS or TTL auxiliary signal (input), shared between all acquisition paths for trigger or user input, and dedicated to acquisition path 1 for field polarity, data valid, CSYNC, or HSYNC input. Pin information Connector: DBHD-44&nbsp;Pin: 39+, 38- Direction Input Trigger information M_HARDWARE_PORT5; Digitizer device #: M_DEV0, M_DEV1, M_DEV2, M_DEV3; Trigger controller: 3 on acq path 0; 3 on acq path 1; 3 on acq path 2; 3 on acq path 3. Hardware manual signal name LVDS/TTL_AUX_IN3 MIL I/O #: M_AUX_IO6 Shared with: M_DEV0, M_DEV2, M_DEV3 LVDS or TTL auxiliary signal (input), shared between all acquisition paths for trigger or user input, and dedicated to acquisition path 2 for field polarity, data valid, CSYNC, or HSYNC input. Pin information Connector: DBHD-44&nbsp;Pin: 7+, 22- Direction Input Trigger information M_HARDWARE_PORT6; Digitizer device #: M_DEV0, M_DEV1, M_DEV2, M_DEV3; Trigger controller: 2 on acq path 0; 2 on acq path 1; 2 on acq path 2; 2 on acq path 3. Hardware manual signal name LVDS/TTL_AUX_IN4 MIL I/O #: M_AUX_IO7 Shared with: M_DEV0, M_DEV2, M_DEV3 LVDS or TTL auxiliary signal (input), shared between all acquisition paths for trigger or user input, and dedicated to acquisition path 2 for field polarity, data valid, CSYNC, or HSYNC input. Pin information Connector: DBHD-44&nbsp;Pin: 6+, 5- Direction Input Trigger information M_HARDWARE_PORT7; Digitizer device #: M_DEV0, M_DEV1, M_DEV2, M_DEV3; Trigger controller: 3 on acq path 0; 3 on acq path 1; 3 on acq path 2; 3 on acq path 3. Hardware manual signal name LVDS/TTL_AUX_IN5 MIL I/O #: M_AUX_IO8 Shared with: M_DEV0, M_DEV2, M_DEV3 LVDS or TTL auxiliary signal (input), shared between all acquisition paths for trigger or user input, and dedicated to acquisition path 3 for field polarity, data valid, CSYNC, or HSYNC input. Pin information Connector: DBHD-44&nbsp;Pin: 32+, 31- Direction Input Trigger information M_HARDWARE_PORT8; Digitizer device #: M_DEV0, M_DEV1, M_DEV2, M_DEV3; Trigger controller: 2 on acq path 0; 2 on acq path 1; 2 on acq path 2; 2 on acq path 3. Hardware manual signal name LVDS/TTL_AUX_IN6 MIL I/O #: M_AUX_IO9 Shared with: M_DEV0, M_DEV2, M_DEV3 LVDS or TTL auxiliary signal (input), shared between all acquisition paths for trigger or user input, and dedicated to acquisition path 3 for field polarity, data valid, CSYNC, or HSYNC input. Pin information Connector: DBHD-44&nbsp;Pin: 1+, 16- Direction Input Trigger information M_HARDWARE_PORT9; Digitizer device #: M_DEV0, M_DEV1, M_DEV2, M_DEV3; Trigger controller: 3 on acq path 0; 3 on acq path 1; 3 on acq path 2; 3 on acq path 3. Hardware manual signal name LVDS/TTL_AUX_IN7 MIL I/O #: M_AUX_IO10 LVDS or TTL auxiliary signal (output) for acquisition path 1, which supports: user output, timer output, or HSYNC output. Pin information Connector: DBHD-44&nbsp;Pin: 43+, 42- Direction Output User-bit information MIL user-bit #: M_USER_BIT0; Digitizer device #: M_DEV1; (Hardware manual user signal rank 1 : 0 on acq path 1 ) Timer information Timer: M_TIMER1; Digitizer device #: M_DEV1; Hardware manual signal name P1_LVDS/TTL_AUX_OUT0 MIL I/O #: M_AUX_IO11 LVDS or TTL auxiliary signal (output) for acquisition path 1, which supports: user output, timer output, or VSYNC output. Pin information Connector: DBHD-44&nbsp;Pin: 11+, 27- Direction Output User-bit information MIL user-bit #: M_USER_BIT1; Digitizer device #: M_DEV1; (Hardware manual user signal rank 1 : 1 on acq path 1 ) Timer information Timer: M_TIMER2; Digitizer device #: M_DEV1; Hardware manual signal name P1_LVDS/TTL_AUX_OUT1 MIL I/O #: M_AUX_IO12 TTL auxiliary signal (output) for acquisition path 1, which supports: timer output or user output. Pin information Connector: DVI (0)&nbsp;Pin: 6 Direction Output User-bit information MIL user-bit #: M_USER_BIT2; Digitizer device #: M_DEV1; (Hardware manual user signal rank 1 : 2 on acq path 1 ) Timer information Timer: M_TIMER1; Digitizer device #: M_DEV1; Hardware manual signal name P1_TTL_AUX(EXP)_OUT Digitizer device #: M_DEV2 Indicates the following. MIL I/O #: M_AUX_IO0 Opto-isolated auxiliary signal (input) for acquisition path 2, which supports: trigger input or user input. Pin information Connector: DB-9&nbsp;Pin: 1+, 6- Direction Input Trigger information M_HARDWARE_PORT0; Digitizer device #: M_DEV2; Trigger controller: 1 on acq path 2. Hardware manual signal name P2_OPTO_AUX(TRIG)_IN MIL I/O #: M_AUX_IO1 TTL auxiliary signal (input) for acquisition path 2, which supports: trigger input, field polarity input, or user input. Pin information Connector: DVI (1)&nbsp;Pin: 14 Direction Input Trigger information M_HARDWARE_PORT1; Digitizer device #: M_DEV2; Trigger controller: 0 on acq path 2. Hardware manual signal name P2_TTL_AUX(TRIG)_IN MIL I/O #: M_AUX_IO2 Shared with: M_DEV0, M_DEV1, M_DEV3 LVDS or TTL auxiliary signal (input), shared between all acquisition paths for trigger or user input, and dedicated to acquisition path 0 for field polarity, data valid, CSYNC, or HSYNC input. Pin information Connector: DBHD-44&nbsp;Pin: 35+, 34- Direction Input Trigger information M_HARDWARE_PORT2; Digitizer device #: M_DEV0, M_DEV1, M_DEV2, M_DEV3; Trigger controller: 2 on acq path 0; 2 on acq path 1; 2 on acq path 2; 2 on acq path 3. Hardware manual signal name LVDS/TTL_AUX_IN0 MIL I/O #: M_AUX_IO3 Shared with: M_DEV0, M_DEV1, M_DEV3 LVDS or TTL auxiliary signal (input), shared between all acquisition paths for trigger or user input, and dedicated to acquisition path 0 for timer clock or VSYNC input. Pin information Connector: DBHD-44&nbsp;Pin: 12+, 28- Direction Input Trigger information M_HARDWARE_PORT3; Digitizer device #: M_DEV0, M_DEV1, M_DEV2, M_DEV3; Trigger controller: 3 on acq path 0; 3 on acq path 1; 3 on acq path 2; 3 on acq path 3. Hardware manual signal name LVDS/TTL_AUX_IN1 MIL I/O #: M_AUX_IO4 Shared with: M_DEV0, M_DEV1, M_DEV3 LVDS or TTL auxiliary signal (input), shared between all acquisition paths for trigger or user input, and dedicated to acquisition path 1 for field polarity, data valid, CSYNC, or HSYNC input. Pin information Connector: DBHD-44&nbsp;Pin: 8+, 24- Direction Input Trigger information M_HARDWARE_PORT4; Digitizer device #: M_DEV0, M_DEV1, M_DEV2, M_DEV3; Trigger controller: 2 on acq path 0; 2 on acq path 1; 2 on acq path 2; 2 on acq path 3. Hardware manual signal name LVDS/TTL_AUX_IN2 MIL I/O #: M_AUX_IO5 Shared with: M_DEV0, M_DEV1, M_DEV3 LVDS or TTL auxiliary signal (input), shared between all acquisition paths for trigger or user input, and dedicated to acquisition path 1 for field polarity, data valid, CSYNC, or HSYNC input. Pin information Connector: DBHD-44&nbsp;Pin: 39+, 38- Direction Input Trigger information M_HARDWARE_PORT5; Digitizer device #: M_DEV0, M_DEV1, M_DEV2, M_DEV3; Trigger controller: 3 on acq path 0; 3 on acq path 1; 3 on acq path 2; 3 on acq path 3. Hardware manual signal name LVDS/TTL_AUX_IN3 MIL I/O #: M_AUX_IO6 Shared with: M_DEV0, M_DEV1, M_DEV3 LVDS or TTL auxiliary signal (input), shared between all acquisition paths for trigger or user input, and dedicated to acquisition path 2 for field polarity, data valid, CSYNC, or HSYNC input. Pin information Connector: DBHD-44&nbsp;Pin: 7+, 22- Direction Input Trigger information M_HARDWARE_PORT6; Digitizer device #: M_DEV0, M_DEV1, M_DEV2, M_DEV3; Trigger controller: 2 on acq path 0; 2 on acq path 1; 2 on acq path 2; 2 on acq path 3. Hardware manual signal name LVDS/TTL_AUX_IN4 MIL I/O #: M_AUX_IO7 Shared with: M_DEV0, M_DEV1, M_DEV3 LVDS or TTL auxiliary signal (input), shared between all acquisition paths for trigger or user input, and dedicated to acquisition path 2 for field polarity, data valid, CSYNC, or HSYNC input. Pin information Connector: DBHD-44&nbsp;Pin: 6+, 5- Direction Input Trigger information M_HARDWARE_PORT7; Digitizer device #: M_DEV0, M_DEV1, M_DEV2, M_DEV3; Trigger controller: 3 on acq path 0; 3 on acq path 1; 3 on acq path 2; 3 on acq path 3. Hardware manual signal name LVDS/TTL_AUX_IN5 MIL I/O #: M_AUX_IO8 Shared with: M_DEV0, M_DEV1, M_DEV3 LVDS or TTL auxiliary signal (input), shared between all acquisition paths for trigger or user input, and dedicated to acquisition path 3 for field polarity, data valid, CSYNC, or HSYNC input. Pin information Connector: DBHD-44&nbsp;Pin: 32+, 31- Direction Input Trigger information M_HARDWARE_PORT8; Digitizer device #: M_DEV0, M_DEV1, M_DEV2, M_DEV3; Trigger controller: 2 on acq path 0; 2 on acq path 1; 2 on acq path 2; 2 on acq path 3. Hardware manual signal name LVDS/TTL_AUX_IN6 MIL I/O #: M_AUX_IO9 Shared with: M_DEV0, M_DEV1, M_DEV3 LVDS or TTL auxiliary signal (input), shared between all acquisition paths for trigger or user input, and dedicated to acquisition path 3 for field polarity, data valid, CSYNC, or HSYNC input. Pin information Connector: DBHD-44&nbsp;Pin: 1+, 16- Direction Input Trigger information M_HARDWARE_PORT9; Digitizer device #: M_DEV0, M_DEV1, M_DEV2, M_DEV3; Trigger controller: 3 on acq path 0; 3 on acq path 1; 3 on acq path 2; 3 on acq path 3. Hardware manual signal name LVDS/TTL_AUX_IN7 MIL I/O #: M_AUX_IO10 LVDS or TTL auxiliary signal (output) for acquisition path 2, which supports: user output, timer output, or HSYNC output. Pin information Connector: DBHD-44&nbsp;Pin: 40+, 25- Direction Output User-bit information MIL user-bit #: M_USER_BIT0; Digitizer device #: M_DEV2; (Hardware manual user signal rank 1 : 0 on acq path 2 ) Timer information Timer: M_TIMER1; Digitizer device #: M_DEV2; Hardware manual signal name P2_LVDS/TTL_AUX_OUT0 MIL I/O #: M_AUX_IO11 LVDS or TTL auxiliary signal (output) for acquisition path 2, which supports: user output, timer output, or VSYNC output. Pin information Connector: DBHD-44&nbsp;Pin: 20+, 4- Direction Output User-bit information MIL user-bit #: M_USER_BIT1; Digitizer device #: M_DEV2; (Hardware manual user signal rank 1 : 1 on acq path 2 ) Timer information Timer: M_TIMER2; Digitizer device #: M_DEV2; Hardware manual signal name P2_LVDS/TTL_AUX_OUT1 MIL I/O #: M_AUX_IO12 TTL auxiliary signal (output) for acquisition path 2, which supports: timer output or user output. Pin information Connector: DVI (1)&nbsp;Pin: 23 Direction Output User-bit information MIL user-bit #: M_USER_BIT2; Digitizer device #: M_DEV2; (Hardware manual user signal rank 1 : 2 on acq path 2 ) Timer information Timer: M_TIMER1; Digitizer device #: M_DEV2; Hardware manual signal name P2_TTL_AUX(EXP)_OUT Digitizer device #: M_DEV3 Indicates the following. MIL I/O #: M_AUX_IO0 Opto-isolated auxiliary signal (input) for acquisition path 3, which supports: trigger input or user input. Pin information Connector: DB-9&nbsp;Pin: 8+, 3- Direction Input Trigger information M_HARDWARE_PORT0; Digitizer device #: M_DEV3; Trigger controller: 1 on acq path 3. Hardware manual signal name P3_OPTO_AUX(TRIG)_IN MIL I/O #: M_AUX_IO1 TTL auxiliary signal (input) for acquisition path 3, which supports: trigger input, field polarity input, or user input. Pin information Connector: DVI (1)&nbsp;Pin: 22 Direction Input Trigger information M_HARDWARE_PORT1; Digitizer device #: M_DEV3; Trigger controller: 0 on acq path 3. Hardware manual signal name P3_TTL_AUX(TRIG)_IN MIL I/O #: M_AUX_IO2 Shared with: M_DEV0, M_DEV1, M_DEV2 LVDS or TTL auxiliary signal (input), shared between all acquisition paths for trigger or user input, and dedicated to acquisition path 0 for field polarity, data valid, CSYNC, or HSYNC input. Pin information Connector: DBHD-44&nbsp;Pin: 35+, 34- Direction Input Trigger information M_HARDWARE_PORT2; Digitizer device #: M_DEV0, M_DEV1, M_DEV2, M_DEV3; Trigger controller: 2 on acq path 0; 2 on acq path 1; 2 on acq path 2; 2 on acq path 3. Hardware manual signal name LVDS/TTL_AUX_IN0 MIL I/O #: M_AUX_IO3 Shared with: M_DEV0, M_DEV1, M_DEV2 LVDS or TTL auxiliary signal (input), shared between all acquisition paths for trigger or user input, and dedicated to acquisition path 0 for timer clock or VSYNC input. Pin information Connector: DBHD-44&nbsp;Pin: 12+, 28- Direction Input Trigger information M_HARDWARE_PORT3; Digitizer device #: M_DEV0, M_DEV1, M_DEV2, M_DEV3; Trigger controller: 3 on acq path 0; 3 on acq path 1; 3 on acq path 2; 3 on acq path 3. Hardware manual signal name LVDS/TTL_AUX_IN1 MIL I/O #: M_AUX_IO4 Shared with: M_DEV0, M_DEV1, M_DEV2 LVDS or TTL auxiliary signal (input), shared between all acquisition paths for trigger or user input, and dedicated to acquisition path 1 for field polarity, data valid, CSYNC, or HSYNC input. Pin information Connector: DBHD-44&nbsp;Pin: 8+, 24- Direction Input Trigger information M_HARDWARE_PORT4; Digitizer device #: M_DEV0, M_DEV1, M_DEV2, M_DEV3; Trigger controller: 2 on acq path 0; 2 on acq path 1; 2 on acq path 2; 2 on acq path 3. Hardware manual signal name LVDS/TTL_AUX_IN2 MIL I/O #: M_AUX_IO5 Shared with: M_DEV0, M_DEV1, M_DEV2 LVDS or TTL auxiliary signal (input), shared between all acquisition paths for trigger or user input, and dedicated to acquisition path 1 for field polarity, data valid, CSYNC, or HSYNC input. Pin information Connector: DBHD-44&nbsp;Pin: 39+, 38- Direction Input Trigger information M_HARDWARE_PORT5; Digitizer device #: M_DEV0, M_DEV1, M_DEV2, M_DEV3; Trigger controller: 3 on acq path 0; 3 on acq path 1; 3 on acq path 2; 3 on acq path 3. Hardware manual signal name LVDS/TTL_AUX_IN3 MIL I/O #: M_AUX_IO6 Shared with: M_DEV0, M_DEV1, M_DEV2 LVDS or TTL auxiliary signal (input), shared between all acquisition paths for trigger or user input, and dedicated to acquisition path 2 for field polarity, data valid, CSYNC, or HSYNC input. Pin information Connector: DBHD-44&nbsp;Pin: 7+, 22- Direction Input Trigger information M_HARDWARE_PORT6; Digitizer device #: M_DEV0, M_DEV1, M_DEV2, M_DEV3; Trigger controller: 2 on acq path 0; 2 on acq path 1; 2 on acq path 2; 2 on acq path 3. Hardware manual signal name LVDS/TTL_AUX_IN4 MIL I/O #: M_AUX_IO7 Shared with: M_DEV0, M_DEV1, M_DEV2 LVDS or TTL auxiliary signal (input), shared between all acquisition paths for trigger or user input, and dedicated to acquisition path 2 for field polarity, data valid, CSYNC, or HSYNC input. Pin information Connector: DBHD-44&nbsp;Pin: 6+, 5- Direction Input Trigger information M_HARDWARE_PORT7; Digitizer device #: M_DEV0, M_DEV1, M_DEV2, M_DEV3; Trigger controller: 3 on acq path 0; 3 on acq path 1; 3 on acq path 2; 3 on acq path 3. Hardware manual signal name LVDS/TTL_AUX_IN5 MIL I/O #: M_AUX_IO8 Shared with: M_DEV0, M_DEV1, M_DEV2 LVDS or TTL auxiliary signal (input), shared between all acquisition paths for trigger or user input, and dedicated to acquisition path 3 for field polarity, data valid, CSYNC, or HSYNC input. Pin information Connector: DBHD-44&nbsp;Pin: 32+, 31- Direction Input Trigger information M_HARDWARE_PORT8; Digitizer device #: M_DEV0, M_DEV1, M_DEV2, M_DEV3; Trigger controller: 2 on acq path 0; 2 on acq path 1; 2 on acq path 2; 2 on acq path 3. Hardware manual signal name LVDS/TTL_AUX_IN6 MIL I/O #: M_AUX_IO9 Shared with: M_DEV0, M_DEV1, M_DEV2 LVDS or TTL auxiliary signal (input), shared between all acquisition paths for trigger or user input, and dedicated to acquisition path 3 for field polarity, data valid, CSYNC, or HSYNC input. Pin information Connector: DBHD-44&nbsp;Pin: 1+, 16- Direction Input Trigger information M_HARDWARE_PORT9; Digitizer device #: M_DEV0, M_DEV1, M_DEV2, M_DEV3; Trigger controller: 3 on acq path 0; 3 on acq path 1; 3 on acq path 2; 3 on acq path 3. Hardware manual signal name LVDS/TTL_AUX_IN7 MIL I/O #: M_AUX_IO10 LVDS or TTL auxiliary signal (output) for acquisition path 3, which supports: user output, timer output, or HSYNC output. Pin information Connector: DBHD-44&nbsp;Pin: 33+, 18- Direction Output User-bit information MIL user-bit #: M_USER_BIT0; Digitizer device #: M_DEV3; (Hardware manual user signal rank 1 : 0 on acq path 3 ) Timer information Timer: M_TIMER1; Digitizer device #: M_DEV3; Hardware manual signal name P3_LVDS/TTL_AUX_OUT0 MIL I/O #: M_AUX_IO11 LVDS or TTL auxiliary signal (output) for acquisition path 3, which supports: user output, timer output, or VSYNC output. Pin information Connector: DBHD-44&nbsp;Pin: 2+, 17- Direction Output User-bit information MIL user-bit #: M_USER_BIT1; Digitizer device #: M_DEV3; (Hardware manual user signal rank 1 : 1 on acq path 3 ) Timer information Timer: M_TIMER2; Digitizer device #: M_DEV3; Hardware manual signal name P3_LVDS/TTL_AUX_OUT1 MIL I/O #: M_AUX_IO12 TTL auxiliary signal (output) for acquisition path 3, which supports: timer output or user output. Pin information Connector: DVI (1)&nbsp;Pin: 6 Direction Output User-bit information MIL user-bit #: M_USER_BIT2; Digitizer device #: M_DEV3; (Hardware manual user signal rank 1 : 2 on acq path 3 ) Timer information Timer: M_TIMER1; Digitizer device #: M_DEV3; Hardware manual signal name P3_TTL_AUX(EXP)_OUT expandTable(\"mil_io_information_show_all\"); 1 The user-bit number in the Installation and Hardware Reference manual is just a rank; use the MIL user-bit number instead. Matrox Solios eA/XA connectors and signal names Board connectors Signal names and their matching MIL constants ",
      "wordCount": 4748,
      "subEntries": []
    },
    {
      "id": "BSN_solios_Matrox_Solios_board_flow_diagrams",
      "version": null,
      "title": "Matrox Solios board flow diagrams",
      "subTitles": [
        "Matrox Solios eCL/XCL",
        "Matrox Solios eA/XA"
      ],
      "location": "MIL Hardware-specific Notes",
      "pageURL": "content\\BoardSpecificNotes\\solios\\Matrox_Solios_board_flow_diagrams.htm",
      "text": " Matrox Solios board flow diagrams This section contains data flow diagrams for Matrox Solios boards. Matrox Solios eCL/XCL The following diagram illustrates the data flow of Matrox Solios eCL/XCL-B. The following diagram illustrates the data flow of the Matrox Solios eCL/XCL dual-Base/single-Medium in dual-Base mode. The following diagram illustrates the data flow of the Matrox Solios eCL/XCL dual-Base/single-Medium in single-Medium mode. The following diagram illustrates the data flow of Matrox Solios eCL/XCL-F. Matrox Solios eA/XA The following diagram illustrates the data flow of Matrox Solios eA/XA Single. The following diagram illustrates the data flow of Matrox Solios eA/XA Dual. The following diagram illustrates the data flow of Matrox Solios eA/XA Quad. Matrox Solios board flow diagrams Matrox Solios eCL/XCL Matrox Solios eA/XA ",
      "wordCount": 124,
      "subEntries": []
    }
  ]
}]