[{
  "id": "BSN_indio-u53",
  "version": "2024020714",
  "title": "Matrox Indio",
  "subTitles": null,
  "location": "MIL Hardware-specific Notes",
  "pageURL": "content\\BoardSpecificNotes\\indio-u53\\ChapterInformation.htm",
  "text": " Matrox Indio This section discusses features of MIL that are particular to Matrox Indio and ways that optimize the board's performance. Matrox Indio information regarding specific functions is integrated into the functions' reference topics. Refer to the Matrox Indio release notes for any additions/modifications to the MIL Hardware-specific Notes in this chapter or in the MIL Reference. Matrox Indio overview Summary of Matrox Indio features Using Matrox Indio with MIL Using the Advanced I/O Engine of Matrox Indio Using EtherNet/IP, Modbus, or PROFINET Matrox Indio connectors and signal names Board connectors Signal names and their matching MIL constants Matrox Indio board flow diagram ",
  "wordCount": 105,
  "subEntries": [
    {
      "id": "BSN_indio-u53_Matrox_Indio_specific_features",
      "version": null,
      "title": "Matrox Indio overview",
      "subTitles": [
        "Summary of Matrox Indio features"
      ],
      "location": "MIL Hardware-specific Notes",
      "pageURL": "content\\BoardSpecificNotes\\indio-u53\\Matrox_Indio_specific_features.htm",
      "text": " Matrox Indio overview Matrox Indio is a versatile, industrial I/O and communications, PCIe board. It has an Advanced I/O Engine that provides 16 optically-isolated, digital auxiliary I/O signals (8 inputs and 8 outputs), and includes I/O command lists, timers, quadrature decoders, and user outputs. It also supports GigE Vision capture, as well as Industrial communication using the PROFINET, EtherNet/IP, or Modbus/TCP industrial protocol. To support PROFINET communication, Matrox Indio also includes a Matrox PROFINET Engine. In addition to being prelicensed for use with the MIL drivers for GigE Vision cameras, the Matrox Indio board can act as a fingerprint for licensing supplemental MIL functionality. The board can also store a supplemental MIL license, which facilitates the process of moving to a new computer. Summary of Matrox Indio features The following table outlines the features currently available on Matrox Indio. Features Matrox Indio Can access GenICam camera features using MdigControlFeature() / MdigInquireFeature() 1 Yes On-board memory 128 MBytes DDR3 SDRAM Number of acquisition ports 1 Number of auxiliary signals 16 (8 in, 8 out) Matrox PROFINET Engine Yes Number of timers 16 Number of quadrature decoders for input from linear or rotary encoders 2 Number of I/O command lists 2 Number of reference latches per I/O command list 4 Power-over-Ethernet (PoE) support Yes 1 When using a GigE Vision system (M_SYSTEM_GIGE_VISION, using MsysAlloc()). Matrox Indio overview Summary of Matrox Indio features ",
      "wordCount": 232,
      "subEntries": []
    },
    {
      "id": "BSN_indio-u53_Using_Matrox_Indio_with_MIL",
      "version": null,
      "title": "Using Matrox Indio with MIL",
      "subTitles": [
        "Using the Advanced I/O Engine of Matrox Indio",
        "Using EtherNet/IP, Modbus, or PROFINET"
      ],
      "location": "MIL Hardware-specific Notes",
      "pageURL": "content\\BoardSpecificNotes\\indio-u53\\Using_Matrox_Indio_with_MIL.htm",
      "text": " Using Matrox Indio with MIL Matrox Indio allows you to use a GigE Vision-compliant camera for acquisition. To use a GigE Vision-compliant camera for acquisition with Matrox Indio and MIL, you must allocate a MIL GigE Vision system (M_SYSTEM_GIGE_VISION), using MsysAlloc(). This allocation opens communication with GigE Vision compliant cameras. You can then access and grab from multiple connected GigE Vision cameras by allocating a digitizer for each connected camera (using MdigAlloc() with M_DEVn). Each process (executable) can allocate only one MIL GigE Vision system. Each camera can be used by one process (executable) at a time. For additional information, refer to the Matrox GigE Vision driver chapter in the MIL Hardware-specific Notes. To use other functionality available on Matrox Indio (for example, I/O signals and industrial communication) or to inquire about the status (for example, board type) of the board, you must allocate a MIL Indio system, using MsysAlloc() with M_SYSTEM_INDIO. Matrox Indio is preinstalled with a runtime license for MIL, which includes the Industrial and Robot Communication module (Mcom) and interface module. Be aware that to access the MIL license that is included on the Matrox Indio board, you must install the Matrox Indio driver. Refer to the Matrox Indio release notes for any additions/modifications to the MIL Hardware-specific Notes in this chapter or in the MIL Reference. Using the Advanced I/O Engine of Matrox Indio Matrox Indio has an Advanced I/O Engine that controls the auxiliary I/O interface. The engine includes 16 timers, 2 rotary decoders, 2 I/O command lists, a user-output register, 8 auxiliary output signals, and 8 auxiliary input signals. To route auxiliary I/O signals and configure interrupts, use MsysControl(). To inquire this information, use MsysInquire(). For more information on some of these features, refer to Chapter 56: I/O signals and communicating with external devices. Using EtherNet/IP, Modbus, or PROFINET You can use the Gigabit Ethernet port for communication with external devices using the EtherNet/IP, Modbus (over TCP/IP), or PROFINET industrial protocol. In this case, you should not use the port for acquisition. Unless using PROFINET, you should not use the port for general network traffic. Both EtherNet/IP and Modbus over TCP/IP communication require installation of the Intel i210 Network Adapter Driver available from https://downloadcenter.intel.com/. When PROFINET is used, communication is assisted using the Matrox PROFINET Engine; its interface is recognized as a second network device with its own IP and MAC seetings (when the PROFINET service is enabled) even though it shares the same LAN connection. For more information, see the Steps to perform industrial communication section of Chapter 57: Industrial communication. Using Matrox Indio with MIL Using the Advanced I/O Engine of Matrox Indio Using EtherNet/IP, Modbus, or PROFINET ",
      "wordCount": 448,
      "subEntries": []
    },
    {
      "id": "BSN_indio-u53_Matrox_Indio_connectors_and_signal_names",
      "version": null,
      "title": "Matrox Indio connectors and signal names",
      "subTitles": [
        "Board connectors",
        "Signal names and their matching MIL constants"
      ],
      "location": "MIL Hardware-specific Notes",
      "pageURL": "content\\BoardSpecificNotes\\indio-u53\\Matrox_Indio_connectors_and_signal_names.htm",
      "text": " Matrox Indio connectors and signal names This section serves as a reference to match Matrox Indio's connectors and auxiliary signals with MIL information, such as MIL auxiliary signal numbers. To set/inquire all the settings for this board's auxiliary signals (for example, signal routing and timer settings), use MsysControl() / MsysInquire(), respectively. Auxiliary I/O signals can have one or more functionalities (for example, outputting the state of an I/O command register bit, timer output, or user output, depending on the signal). Their possible functionalities are described in their description in the pinout table below. Note that, unlike some other Matrox frame grabbers, there is no limit to the number of events that can be triggered simultaneously using the auxiliary input signals, nor is there a restriction on which auxiliary signal can be used to trigger the event. Only those auxiliary signals that have matching MIL information are included in this section. For information on internal connectors and a comprehensive list of all available input and output signals, refer to the board's installation and hardware reference manual. Board connectors The Matrox Indio board provides an auxiliary I/O connector and a Gigabit Ethernet connector. Only the following connectors have auxiliary signals with matching MIL information. Connector Name Connector Abbreviation Image Description Auxiliary I/O connector DB-37 The external auxiliary I/O connector is a D-subminiature 37-pin female connector. It is used to transmit/receive auxiliary signals. Signal names and their matching MIL constants The table below lists the auxiliary signals with their associated MIL information. Sort by: MIL I/O information Connector and pin Hardware manual signal name Filter by: Show all Direction: input Direction: output Direction: input/output Timers Triggers Tables: Expanded Collapsed System Description MIL I/O # Pin information Direction User-bit information Trigger information Timer information Hardware manual signal name System Indicates the following. MIL I/O #: M_AUX_IO0 Industrial auxiliary signal (output), which supports: user output, timer output, and outputting the state of an I/O command register bit. Pin information Connector: DB-37&nbsp;Pin: 2+, 1- Direction Output User-bit information MIL user-bit #: M_USER_BIT0; Timer information Timer: M_TIMERn Hardware manual signal name AUX_OPTOIND_OUT0 MIL I/O #: M_AUX_IO1 Industrial auxiliary signal (output), which supports: user output, timer output, and outputting the state of an I/O command register bit. Pin information Connector: DB-37&nbsp;Pin: 4+, 3- Direction Output User-bit information MIL user-bit #: M_USER_BIT1; Timer information Timer: M_TIMERn Hardware manual signal name AUX_OPTOIND_OUT1 MIL I/O #: M_AUX_IO2 Industrial auxiliary signal (output), which supports: user output, timer output, and outputting the state of an I/O command register bit. Pin information Connector: DB-37&nbsp;Pin: 7+, 6- Direction Output User-bit information MIL user-bit #: M_USER_BIT2; Timer information Timer: M_TIMERn Hardware manual signal name AUX_OPTOIND_OUT2 MIL I/O #: M_AUX_IO3 Industrial auxiliary signal (output), which supports: user output, timer output, and outputting the state of an I/O command register bit. Pin information Connector: DB-37&nbsp;Pin: 9+, 8- Direction Output User-bit information MIL user-bit #: M_USER_BIT3; Timer information Timer: M_TIMERn Hardware manual signal name AUX_OPTOIND_OUT3 MIL I/O #: M_AUX_IO4 Industrial auxiliary signal (output), which supports: user output, timer output, and outputting the state of an I/O command register bit. Pin information Connector: DB-37&nbsp;Pin: 12+, 11- Direction Output User-bit information MIL user-bit #: M_USER_BIT4; Timer information Timer: M_TIMERn Hardware manual signal name AUX_OPTOIND_OUT4 MIL I/O #: M_AUX_IO5 Industrial auxiliary signal (output), which supports: user output, timer output, and outputting the state of an I/O command register bit. Pin information Connector: DB-37&nbsp;Pin: 14+, 13- Direction Output User-bit information MIL user-bit #: M_USER_BIT5; Timer information Timer: M_TIMERn Hardware manual signal name AUX_OPTOIND_OUT5 MIL I/O #: M_AUX_IO6 Industrial auxiliary signal (output), which supports: user output, timer output, and outputting the state of an I/O command register bit. Pin information Connector: DB-37&nbsp;Pin: 17+, 16- Direction Output User-bit information MIL user-bit #: M_USER_BIT6; Timer information Timer: M_TIMERn Hardware manual signal name AUX_OPTOIND_OUT6 MIL I/O #: M_AUX_IO7 Industrial auxiliary signal (output), which supports: user output, timer output, and outputting the state of an I/O command register bit. Pin information Connector: DB-37&nbsp;Pin: 19+, 18- Direction Output User-bit information MIL user-bit #: M_USER_BIT7; Timer information Timer: M_TIMERn Hardware manual signal name AUX_OPTOIND_OUT7 MIL I/O #: M_AUX_IO8 Industrial auxiliary signal (input), which supports: user input, I/O command list counter source, timer clock, timer arm, I/O command list reference latch trigger, quadrature input bit 0 or 1, or quadrature decoder counter reset source. Pin information Connector: DB-37&nbsp;Pin: 21+, 20- Direction Input Timer information Timer: M_TIMERn Hardware manual signal name AUX_OPTOIND_IN8 MIL I/O #: M_AUX_IO9 Industrial auxiliary signal (input), which supports: user input, I/O command list counter source, timer clock, timer arm, I/O command list reference latch trigger, quadrature input bit 0 or 1, or quadrature decoder counter reset source. Pin information Connector: DB-37&nbsp;Pin: 23+, 22- Direction Input Timer information Timer: M_TIMERn Hardware manual signal name AUX_OPTOIND_IN9 MIL I/O #: M_AUX_IO10 Industrial auxiliary signal (input), which supports: user input, I/O command list counter source, timer clock, timer arm, I/O command list reference latch trigger, quadrature input bit 0 or 1, or quadrature decoder counter reset source. Pin information Connector: DB-37&nbsp;Pin: 26+, 25- Direction Input Timer information Timer: M_TIMERn Hardware manual signal name AUX_OPTOIND_IN10 MIL I/O #: M_AUX_IO11 Industrial auxiliary signal (input), which supports: user input, I/O command list counter source, timer clock, timer arm, I/O command list reference latch trigger, quadrature input bit 0 or 1, or quadrature decoder counter reset source. Pin information Connector: DB-37&nbsp;Pin: 28+, 27- Direction Input Timer information Timer: M_TIMERn Hardware manual signal name AUX_OPTOIND_IN11 MIL I/O #: M_AUX_IO12 Industrial auxiliary signal (input), which supports: user input, I/O command list counter source, timer clock, timer arm, I/O command list reference latch trigger, quadrature input bit 0 or 1, or quadrature decoder counter reset source. Pin information Connector: DB-37&nbsp;Pin: 30+, 29- Direction Input Timer information Timer: M_TIMERn Hardware manual signal name AUX_OPTOIND_IN12 MIL I/O #: M_AUX_IO13 Industrial auxiliary signal (input), which supports: user input, I/O command list counter source, timer clock, timer arm, I/O command list reference latch trigger, quadrature input bit 0 or 1, or quadrature decoder counter reset source. Pin information Connector: DB-37&nbsp;Pin: 32+, 31- Direction Input Timer information Timer: M_TIMERn Hardware manual signal name AUX_OPTOIND_IN13 MIL I/O #: M_AUX_IO14 Industrial auxiliary signal (input), which supports: user input, I/O command list counter source, timer clock, timer arm, I/O command list reference latch trigger, quadrature input bit 0 or 1, or quadrature decoder counter reset source. Pin information Connector: DB-37&nbsp;Pin: 35+, 34- Direction Input Timer information Timer: M_TIMERn Hardware manual signal name AUX_OPTOIND_IN14 MIL I/O #: M_AUX_IO15 Industrial auxiliary signal (input), which supports: user input, I/O command list counter source, timer clock, timer arm, I/O command list reference latch trigger, quadrature input bit 0 or 1, or quadrature decoder counter reset source. Pin information Connector: DB-37&nbsp;Pin: 37+, 36- Direction Input Timer information Timer: M_TIMERn Hardware manual signal name AUX_OPTOIND_IN15 expandTable(\"mil_io_information_show_all\"); Matrox Indio connectors and signal names Board connectors Signal names and their matching MIL constants ",
      "wordCount": 1140,
      "subEntries": []
    },
    {
      "id": "BSN_indio-u53_Matrox_Indio_board_flow_diagram",
      "version": null,
      "title": "Matrox Indio board flow diagram",
      "subTitles": null,
      "location": "MIL Hardware-specific Notes",
      "pageURL": "content\\BoardSpecificNotes\\indio-u53\\Matrox_Indio_board_flow_diagram.htm",
      "text": " Matrox Indio board flow diagram The following diagram illustrates the data flow of Matrox Indio. Matrox Indio board flow diagram ",
      "wordCount": 22,
      "subEntries": []
    }
  ]
}]