[{
  "id": "Readme_lastminute",
  "version": "2024020716",
  "title": "tmp_lastminute",
  "wordCount": 0,
  "subEntries": [
    {
      "id": "Readme_lastminute_lastminute",
      "title": "lastminute",
      "location": "MIL Release Notes",
      "pageURL": "\\tmp_lastminute\\lastminute.htm",
      "text": " -------------------------------------------------------------------------------------- Matrox Imaging Library (MIL) X SP7 Release Notes (lastminute) January, 2024 (c) Copyright Matrox Electronic Systems Ltd., 1992-2024 -------------------------------------------------------------------------------------- This file presents last minute information that did not make it into the MIL help, except for last minute hardware-specific information. A more up-to-date and complete version of the help is available at MIL Help is available online at zebra.com/aurora-imaging-library-help. For hardware-specific information, see the release note specific for your driver. The information found in this file overrides your formally documented material. ------------------------------------------------------------------------------- Contents 1. Matrox Intellicam limitations 2. Matrox Performance Monitor 3. MIL Classification module now supports the statistical analysis of datasets 4. Support of Zhang method for camera calibration 5. 2D Image processing module - extra functionality 6. 3D Image processing module - extra functionality 7. Measurement module - MmeasGetResult() with M_SUB_REGIONS_EDGE_VALUES ------------------------------------------------------------------------------ 1. Matrox Intellicam limitations - When using Matrox Intellicam to grab images from a camera, the frame rate displayed might be lower than the actual grab rate, especially when grabbing at high frame rates. To obtain the grab rate, you should grab into an image that does not have a display attribute. Note that when grabbing into an image without a display attribute, the frame rate might still be lower than the grab rate due to limitations of the hardware being used. - An exception can occur when using Matrox Intellicam with a Camera Link camera accessed using the GenICam CLProtocol, and you try modifying the DCF while the feature browser is open. To modify the DCF, ensure the feature browser is not open. ------------------------------------------------------------------------------- 2. Matrox Performance Monitor utility - When using the Matrox Performance Monitor utility (MilPerfViewer) under a non US-English operating system, it is possible that you are not able to see Matrox performance counters. In such cases, it is possible to use the Microsoft PerfMon utility to see the Matrox performance counters. ------------------------------------------------------------------------------- 3. MIL Classification module now supports the statistical analysis of datasets - The MIL Classification module now supports the statistical analysis of datasets to help analyze classifier performance. For the most recent documentation of this functionality, check for an updated version of the MIL Help online at zebra.com/aurora-imaging-library-help. - The statistical analysis of datasets in the MIL Classification module includes 2 new functions: MclassStatCalculate() and MclassGetResultStat(). Subsequent releases after MIL X Service Pack 7 will support these functions with the MIL.NET wrapper and the MIL Python wrapper. These wrappers will allow you to make use of these functions while writing applications in a MIL-supported .NET language (C#), or in Python. ------------------------------------------------------------------------------- 4. Support of Zhang method for camera calibration - The MIL Calibration module now supports a Zhang-based 3D calibration mode. It allows you to calibrate a 3D camera model using multiple grids with unknown poses. Allocate a camera calibration context that uses this mode using McalAlloc() with M_ZHANG_BASED. It is currently only documented in the MIL Reference. For the most recent documentation of this functionality, check for an updated version of the MIL Help online at zebra.com/aurora-imaging-library-help. - For an example, see 2dcamerato3dcameramapping.cpp. ------------------------------------------------------------------------------- 5. 2D Image processing module - extra functionality - MimRemap()can now be used with a context. This allows you to choose the start and end values on the source and destination buffers. It is currently only documented in the MIL Reference. For the most recent documentation of this functionality, check for an updated version of the MIL Help online at zebra.com/aurora-imaging-library-help. - For an example, see polarizationimaging.cpp. ------------------------------------------------------------------------------- 6. 3D Image processing module - extra functionality - M3dimLattice() computes a 3D voxel grid or a 2D projection grid. It can be used to setup a grid subsampling context. It is documented in the MIL Reference. For the most recent documentation of this functionality, check for an updated version of the MIL Help online at zebra.com/aurora-imaging-library-help. - Subsequent releases after MIL X Service Pack 7 will support this functionality with the MIL.NET wrapper and the MIL Python wrapper. These wrappers will allow you to make use of this functionality while writing applications in a MIL-supported .NET language (C#), or in Python. - For examples, see pointcloudneighborhoodpreparation.cpp and pointcloudsubsamplingmodes.cpp. ------------------------------------------------------------------------------- 7. Measurement module - MmeasGetResult() with M_SUB_REGIONS_EDGE_VALUES - MmeasGetResult() with M_SUB_REGIONS_EDGE_VALUES allows you to retrieve edge values for each sub region. The edges' values are copied in the first result parameter (if not null) as a concatenated array. For its documentation, check for an updated version of the MIL Help online at zebra.com/aurora-imaging-library-help. ",
      "wordCount": 740,
      "subEntries": []
    }
  ]
}]