[{
  "id": "Readme_milRapixoCLPro",
  "version": "2023100322",
  "title": "milRapixoCLPro",
  "wordCount": 0,
  "subEntries": [
    {
      "id": "Readme_milRapixoCLPro_milRapixoCLPro",
      "title": "milRapixoCLPro",
      "location": "MIL Release Notes",
      "pageURL": "\\milRapixoCLPro\\milRapixoCLPro.htm",
      "text": " Matrox Imaging Library (MIL) X Update 96 Matrox Rapixo CL Pro release notes November 2020 ?(c) Copyright Matrox Electronic Systems Ltd., 1992-2020. &nbsp; This document outlines what is new with the MIL X driver for the Matrox Rapixo CL Pro and explains the current limitations and particularities. It also presents last-minute information that did not make it into the manual or on-line help. Note that this help file serves to complement your manual. The information found in this file overrides your formally documented material. Contents 1.???? MIL X driver for Matrox Rapixo CL Pro 1.1???????? What?s new in MIL X Update 96 1.1.1????? Standards compliance 1.1.2????? Summary of new features 1.1.3????? Matrox FDK support 1.1.4????? Mfpga API enhancements 1.1.5????? Known limitations and particularities 2.???? Location of examples (in the help file) &nbsp; 1.&nbsp;&nbsp; MIL X driver for Matrox Rapixo CL Pro 1.1&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; What?s new in MIL X Update 96 MIL X Update 96 requires MIL X Service Pack 4 (SP4). 1.1.1&nbsp;&nbsp;&nbsp; Standards compliance The MIL X driver for Matrox Rapixo CL Pro supports the following standards: ?&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Camera Link? version 2.1, except for the following: o&nbsp;&nbsp;&nbsp; 3 taps 8-bit RGB o&nbsp;&nbsp;&nbsp; 9 taps 8-bit mono o&nbsp;&nbsp;&nbsp; 2 taps 10-bit RGB. o&nbsp;&nbsp;&nbsp; 6 taps 10-bit mono. ?&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; GenICam? GenApi version 3.2.0. ?&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; GenICam? GenCP Camera Link Module version 1.3. ?&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; GenICam? for Camera Link? (CLProtocol) version 1.2. Note that this requires a third-party CLProtocol communication library (DLL) which is supplied by the camera vendor. 1.1.2&nbsp;&nbsp;&nbsp; Summary of new features ?&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Added 2 tools to the MILConfig Rapixo CL page: o&nbsp;&nbsp;&nbsp; Board Information: Used to display details for each processing FPGA IP present in the current firmware. o&nbsp;&nbsp;&nbsp; Deserializer Setup tool: Used to calibrate the deserializer when using cables longer than 7 meters or when acquired images are corrupt. 1.1.3&nbsp;&nbsp;&nbsp; Matrox FDK support Support for Matrox FPGA Development Kit (FDK) version 20.1 and later. 1.1.4&nbsp;&nbsp;&nbsp; Mfpga API enhancements MfpgaSetDestination: changed the returned value from void to MIL_INT. It now returns the stream route number to be programmed in the PU to reach the specified destination. Additions to MfpgaInquire and MfpgaCommandInquire: MfpgaInquire Type Description M_PU_NAME + n MIL_STRING Used with M_NUMBER_OF_PU to get the name of the PU at index n. M_PU_FID + n MIL_INT Returns the function ID of the PU at index n. M_TU_NAME + n MIL_STRING Returns the name of the TU at index n. M_TU_FID + n MIL_INT Returns the function ID of the TU at index n. &nbsp; MfpgaCommandInquire Type Description M_NUMBER_OF_INPUTS MIL_INT Returns the number of stream input ports. M_NUMBER_OF_OUTPUTS MIL_INT Returns the number of stream output ports. M_PORT_NAME + M_INPUTn MIL_STRING Returns the name (as a string) of the nth stream input port. M_PORT_NAME + M_OUTPUTn MIL_STRING Returns the name (as a string) of the nth stream output port. &nbsp; 1.1.5&nbsp;&nbsp;&nbsp; Known limitations and particularities ?&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; When using JAI? cameras, the Camera Link Camera Control bits on the Matrox Rapixo CL Pro must be activated for stable communication with the camera (either with JAI or Matrox software). They can be activated using Matrox Intellicam in the ?Other? tab of the DCF dialog. ?&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Editing a DCF for Camera Link using Matrox Intellicam will close an open Feature Browser window. Subsequently re-opening a Feature Browser window may be subject to a noticeable delay due to camera initialization. To avoid this behavior, uncheck the ?Automatically compute registers?? checkbox from the ?Preferences ? Register Compute? menu tab. However, a manual DCF compute from ?DCF ? Compute Registers? will be required thereafter. ?&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Minimizing the Feature Browser window hides it from view but it can be re-opened for viewing by clicking on the Feature Browser icon. ?&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; DCFs with manually edited register values for OPTO_AUX_IN0, OPTO_AUX_IN1, LVDS_AUX_IN2, LVDS_AUX_IN3, TTL_AUX_IO_4, TTL_AUX_IO_5, TTL_AUX_IO_6, OPTO_AUX_IN8, OPTO_AUX_IN9, LVDS_AUX_IN10, LVDS_AUX_IN11, TTL_AUX_IO_12, TTL_AUX_IO_13, TTL_AUX_IO_14 will need to have these values adjusted by adding 0x1000 (ex. 0x64 becomes 0x1064).. 2.&nbsp;&nbsp; Location of examples (in the help file) In the MIL online help, the location information written at the top of examples might not be up-to-date. Use MIL Example Launcher to find an example on disk. ",
      "wordCount": 680,
      "subEntries": []
    },
    {
      "id": "milRapixoCLPro_files",
      "wordCount": 0
    }
  ]
}]