[{
  "id": "Readme_milIrisGTR",
  "version": "2022112813",
  "title": "milIrisGTR",
  "wordCount": 0,
  "subEntries": [
    {
      "id": "Readme_milIrisGTR_MILIrisGTR",
      "title": "MILIrisGTR",
      "location": "MIL Release Notes",
      "pageURL": "\\milIrisGTR\\MILIrisGTR.htm",
      "text": " Matrox Imaging Library (MIL) 10 Update 72 Release Notes (MILIrisGTR) March, 2019 (c) Copyright Matrox Electronic Systems Ltd., 1992-2019. This document outlines what is new and explains the current limitations and particularities when using MIL with Matrox Iris GTR. It also presents last-minute information that did not make it into the manual or on-line help. Note that this help file serves to complement your manual. The information found in this file overrides your formally documented material. Contents &nbsp; 1.????? Overview of functionality 2.????? Behavior changes 3.????? Known Limitations &nbsp; 1.&nbsp;&nbsp; Overview of functionality &nbsp; The MIL Reference in MIL Help now documents Matrox Iris GTR specific values in the Mdig and Msys functions. The help for this product should be readily available, as installed boards are displayed by default. To display only the Matrox Iris GTR information in this help file, go to the Customize MIL Help section of Chapter 0: About MIL help. Select the Matrox Iris GTR option from the MIL Systems drop-down list. Unselect all others. Select the Non-Matrox computer option from the Computer drop-down list. &nbsp; 2.&nbsp;&nbsp; Behavior changes &nbsp; MIL 10 Update 72 ?&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; MIL 10 Update 72 is a cumulative update, including all content from MIL 10 Update 65. ?&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Fixed MdigInquire M_GRAB_PERIOD ?&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Fixed programming invalid focus value when the persistence is enable without a value ?&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; MdigControl with M_IO_INTERRUPT_ACTIVATION + M_ANY_EDGE now allows to receive interrupt whenever the IO level changes for rising and falling edges. MIL 10 Update 65 ?&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; MIL 10 Update 65 is a cumulative update, including all content from MIL 10 Update 28. ?&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Using M_WHITE_BALANCE with M_ENABLE for the first time after MdigAlloc now behaves as described in the MIL Help (i.e., it internally calculates the white balance coefficients). Also, inquiring M_BAYER_COEFFICIENTS_ID before enabling the white balance will return M_NULL, as described in the MIL documentation.? ?&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; MdigControl with M_SOURCE_OFFSET_Y or with M_GRAB_SCALE_Y now generates a MIL error if executed on a color sensor and M_GRAB_SCALE_Y is set to 0.5 and M_SOURCE_OFFSET_Y is not a multiple of 4. This is a sensor limitation and the previous behavior was causing buffer corruption. ?&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Added M_FOCUS_TEMPERATURE MdigInquire to read the Varioptic lens temperature. Varioptic firmware should be version 36 or better. The return value is MIL_DOUBLE and represents the lens temperature in Celsius from the ADC lens read register and calculation. When the ADC temperature register read is impossible (lens not present) or not implemented for the lens connected, MIL will return the M_UNKNOWN value. ?&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Added M_FOCUS_LENGTH MdigInquire to read the Varioptic lens focal length. Varioptic firmware should be version 36 or better. The return value is MIL_INT and represents the lens focal length as reported in the lens EEPROM information. When the data read is impossible (lens not present) or not implemented for the lens connected, MIL will return the M_UNKNOWN value. MIL 10 Update 28 ?&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; MdigControl with M_GAIN is a range from 0 to 255. ?&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; The default image orientation of an image grabbed using Matrox Iris GTR was set so that it is the same orientation as an image grabbed using Matrox Iris GT. ?&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; MdigControl and MdigInquire have two new control/inquire types: M_FOCUS_PERSISTENCE and M_FOCUS_PERSISTENT_VALUE. The M_FOCUS_PERSISTENCE control/inquire type can accept M_DISABLE (M_DEFAULT) or M_ENABLE as values. The M_FOCUS_PERSISTENT_VALUE control/inquire type can accept the same values as M_FOCUS. If M_FOCUS_PERSISTENCE is set to M_ENABLE, then MdigAlloc() initializes the auto-focus position, if present, to the position determined by M_FOCUS_PERSISTENT_VALUE. &nbsp; 3.&nbsp;&nbsp; Known Limitations &nbsp; ?&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Building the MIL examples using Visual Studio 2015 or 2017 also requires the presence of Windows SDK version 8.1, which is installed from the Visual Studio setup. ?&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Windows' automatic 8.3 file name creation needs to be enabled in order for the MIL installer to access the temp folder when the user name contains a space. This option allows Windows to create short file/folder name aliases for ones with long names for programs, such as the MIL installer, that don't support spaces in the file/folder names. Alternatively, the MIL installer needs to run from a user account that belongs to the administrators group and has no spaces in it. Note that the same applies for uninstalling MIL. ?&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; DCFs are not supported for the IrisGTR. ",
      "wordCount": 708,
      "subEntries": []
    }
  ]
}]