[{
  "id": "Readme_milIrisGTX",
  "version": "2023100322",
  "title": "milIrisGTX",
  "wordCount": 0,
  "subEntries": [
    {
      "id": "Readme_milIrisGTX_MILIrisGTX",
      "title": "MILIrisGTX",
      "location": "MIL Release Notes",
      "pageURL": "\\milIrisGTX\\MILIrisGTX.htm",
      "text": " Matrox Imaging Library (MIL) X Update 132 Release Notes (MILIrisGTX) February, 2022 (c) Copyright Matrox Electronic Systems Ltd., 1992-2022. This document outlines what is new and explains the current limitations and particularities when using MIL with Matrox Iris GTX. It also presents last-minute information that did not make it into the manual or on-line help. Note that this document serves to complement your manual. The information found in this document overrides your formally documented material. Contents &nbsp; 1.????? Overview of functionality 2.????? Behavior changes 3.????? Known Limitations &nbsp; 1.&nbsp;&nbsp; Overview of functionality &nbsp; The MIL Reference in MIL Help for Matrox Iris GTX specific values in the Mdig and Msys functions are not yet documented. For now, rely on the Iris GTR documentation when using the MIL Reference. In this document, we will highlight the specifics for the Matrox Iris GTX. The help for this product should be readily available, as installed MIL systems are displayed by default. To display only the Matrox Iris GTX information in the help file, go to the Customize MIL Help section About MIL help in Part 1 of the MIL User Guide. Select the Matrox Iris GTX option from the MIL Systems drop-down list. Unselect all others. Also select the Non-Matrox computer option from the Computer drop-down list. &nbsp; 2.&nbsp;&nbsp; Behavior changes &nbsp; MIL X Update 125 ?&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; First support for the Matrox Iris GTX. ?&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; To allocate a Matrox Iris GTX system, use the M_SYSTEM_IRIS_GTX with the MsysAlloc() function. ?&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; The Matrox Iris GTX color models are not supported with Update 125. ?&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; The Matrox Iris GTX does not support 10-bit grab resolution.? Therefore, you cannot allocate a grab buffer with M_MONO16 attribute. ?&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; The minimum supported exposure time that can be set using MdigControl() with M_EXPOSURE_TIME is 50 microseconds for monochrome sensors. The inquire of (M_EXPOSURE_TIME + M_MIN_VALUE) also returns 50 microseconds. ?&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; The Matrox Iris GTX supports M_GRAB_SCALE_X for all values from 1 to 1/16.? M_GRAB_SCALE_Y supports 1 and 1/2. ?&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; The value for M_SOURCE_SIZE_Y or M_SOURCE_OFFSET_Y must be a multiple of 4.? Also, only M_SOURCE_SIZE_Y has an effect on the frame rate or grab period.? The M_SOURCE_SIZE_X does not have an effect on the grab period.? ?&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; M_SOURCE_SIZE_Y can be set to 4 only if M_GRAB_SCALE_Y is set to 1. &nbsp; MIL X Update 132 ?&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Added support for the Matrox Iris GTX 2000C 5000C 8000C and 16000C. &nbsp; 3.&nbsp;&nbsp; Known Limitations &nbsp; ?&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Building the MIL examples using Visual Studio 2015 or 2017 also requires the presence of Windows SDK version 8.1, which is installed from the Visual Studio setup. ?&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Windows' automatic 8.3 file name creation needs to be enabled in order for the MIL installer to access the temp folder when the user name contains a space. This option allows Windows to create short file/folder name aliases for ones with long names for programs, such as the MIL installer, that don't support spaces in the file/folder names. Alternatively, the MIL installer needs to run from a user account that belongs to the administrators group and has no spaces in it. Note that the same applies for uninstalling MIL. ?&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; DCFs are not supported for the Matrox Iris GTX. ",
      "wordCount": 533,
      "subEntries": []
    }
  ]
}]