[{
  "id": "Reference_thr",
  "version": "2024020714",
  "title": "thr",
  "subTitles": null,
  "location": "MIL Reference",
  "pageURL": "content\\Reference\\thr\\ModuleInformation.htm",
  "text": " Mthr functions Synopsis The functions prefixed with Mthr make up the Thread module. The Thread module supports allocation of MIL thread contexts and synchronization events. Using the functions of the Thread module, you can also control the created MIL thread contexts and events, inquire about various settings, and synchronize execution of multiple threads. Functions MthrAlloc MthrControl MthrControlMp MthrFree MthrInquire MthrInquireMp MthrWait MthrWaitMultiple ",
  "wordCount": 64,
  "subEntries": [
    {
      "id": "Reference_thr_MthrAlloc",
      "version": null,
      "title": "MthrAlloc",
      "subTitles": null,
      "location": "MIL Reference",
      "pageURL": "content\\Reference\\thr\\MthrAlloc.htm",
      "text": " MthrAlloc Synopsis Allocate a MIL thread context, event, or mutex. Syntax MIL_ID MthrAlloc( MIL_ID&nbsp;SystemId, //in MIL_INT64&nbsp;ObjectType, //in MIL_INT64&nbsp;ControlFlag, //in MIL_THREAD_FUNCTION_PTR&nbsp;ThreadFctPtr, //in void&nbsp;*UserDataPtr, //in-out MIL_ID&nbsp;*ThreadEventOrMutexIdPtr //out ) Description This function allocates a MIL thread context, event, or mutex. Threads are function streams, used to ensure sequential execution of operations within the same thread, while allowing simultaneous yet independent execution of operations in other threads. MthrAlloc() can allocate threads using two different methods: With the first method (M_THREAD), MthrAlloc() creates a MIL thread context for the new thread, and allows you to specify a pointer to a function that will be executed by the thread. When a thread contains a function call whose target processor is an on-board processor that supports multi-threading, MIL automatically creates a corresponding thread on that system's on-board processor. The functions of the Thread module allow you to synchronize threads running on the Host and/or various MIL systems. With the second method, MthrAlloc() creates a selectable thread (M_SELECTABLE_THREAD). Selectable threads are threads executed on an on-board processor that supports multi-threading but can be controlled from a single corresponding thread on the Host. Use MthrControl() with M_THREAD_SELECT to send MIL functions to be executed by a selectable thread. For more information on these two types of threads, see the Multi-threading section of Chapter 65: Multi-processing, multi-core, and multi-threading. A MIL event is a synchronization marker that can signal the completion of a required set of functions in one thread to other threads. MthrAlloc() can allocate MIL events, or map a new MIL event to an existing MIL event. A mutex is a mutual exclusion object that allows threads to synchronize access to shared resources. Once a mutex is allocated on the specified system, you can lock and unlock critical sections of code. Locking a critical section of code ensures that no two threads can access the same data at the same time. To lock a MIL mutex, you must call MthrControl() with M_LOCK or M_LOCK_TRY immediately preceding the section of code to lock. If you lock a mutex, you must unlock it at the end of the critical section of code using MthrControl() with M_UNLOCK. To control or inquire about a MIL thread context, event, or mutex, use the MthrControl() or MthrInquire() function, respectively. To synchronize the execution of threads, use MthrWait(). After allocating the thread context, event, or mutex you should check if the operation was successful, using MappGetError() or by verifying that the thread context, event, or mutex identifier returned is not M_NULL (or nullptr if M_UNIQUE_ID was specified). When the thread context, event, or mutex is no longer required, release it using MthrFree() unless M_UNIQUE_ID was specified during allocation; if M_UNIQUE_ID was specified, the smart identifier manages the thread context, event, or mutex's lifetime and you must not manually free it. Parameters Parameters SystemId Specifies the identifier of the system on which to allocate a MIL thread context, event, or mutex. This parameter should be set to one of the following values: For specifying the system Value Description MIL system identifier Specifies the MIL identifier of the required system, previously allocated using MsysAlloc(). ObjectType Specifies the type of object to allocate. This parameter should be set to one of the following values: See the Parameter associations section for possible values that can be specified. ControlFlag Specifies the initialization state of the MIL thread context, event, mutex, or the identifier of an existing MIL event. This parameter should be set to one of the following values: See the Parameter associations section for possible values that can be specified. ThreadFctPtr Specifies the address of the function that will be executed by the new thread (M_THREAD). For all other objects, this parameter should be set to M_NULL. The function must include calls to all functions that you consider as being part of one thread, and be declared as follows: MIL_UINT32 MFTYPE FunctionToCall( void *UserDataPtr ) Parameters UserDataPtr Specifies a pointer to user data that is passed to the UserDataPtr parameter of MthrAlloc(). UserDataPtr Specifies the address of user data necessary to execute the FunctionToCall function of the new thread (M_THREAD). For all other objects, this parameter should be set to M_NULL. ThreadEventOrMutexIdPtr Specifies the address of the variable in which to write the thread context, event or mutex identifier or specifies the data type that the function should use to return the context identifier. For retrieving the identifier or specifying how to return it Value Description M_NULL Specifies that you will use this function's return value to obtain the identifier of the allocated thread context, event, or mutex ; in this case, a standard MIL identifier of type MIL_ID is returned. M_UNIQUE_ID Specifies that you will use this function's return value to obtain the identifier of the allocated thread context, event, or mutex ; in this case, a MIL smart identifier of type MIL_UNIQUE_THR_ID is returned instead of a standard MIL identifier. This setting is only available when using C++11 (or later). A MIL smart identifier manages the lifespan of the MIL object it owns (similar to a std::unique_ptr). Note, you can use a MIL smart identifier as though it were a standard MIL identifier, except that you cannot use it to manually free the thread context, event, or mutex (it is freed automatically). For more information, see the MIL smart identifiers subsection of the MIL custom data types, void pointers, extensions, and portability functions section of Chapter 2: Building an application. Address in which to write the event identifier Specifies the address of a MIL_ID in which to write the identifier of the allocated event. If allocation fails, M_NULL is written as the identifier. Address in which to write the mutex identifier Specifies the address of a MIL_ID in which to write the identifier of the allocated mutex. If allocation fails, M_NULL is written as the identifier. Address in which to write the thread context identifier Specifies the address of a MIL_ID in which to write the identifier of the allocated thread context. If allocation fails, M_NULL is written as the identifier. Parameter associations The table below lists possible values for the ObjectType and ControlFlag parameters. For specifying the type of object to allocate and its initiation state For specifying the type of object to allocate and its initiation state ObjectType Description ControlFlag M_EVENT Allocates a new MIL synchronization event on the specified system. M_NOT_SIGNALED Initializes the event as not signaled. You must specify a combination value from the following table: To set how the event is reset M_SIGNALED Initializes the event as signaled. You must specify a combination value from the following table: To set how the event is reset M_MUTEX Allocates a MIL mutex on the specified system. M_DEFAULT Specifies the default initialization state. This is the only setting available for threads and mutexes. For events, M_DEFAULT is the same as M_NOT_SIGNALED + M_AUTO_RESET. M_SELECTABLE_THREAD Allocates a selectable thread on the specified multi-threaded system. This allows you to synchronize the execution of functions on an on-board processor without creating a Host thread. Use MthrControl() with M_THREAD_SELECT to select the on-board thread to which to send the functions. M_DEFAULT Specifies the default initialization state. This is the only setting available for threads and mutexes. For events, M_DEFAULT is the same as M_NOT_SIGNALED + M_AUTO_RESET. M_TRACE_LOG_DISABLE Specifies to disable the creation of trace logs on this thread by any external program, such as Matrox Profiler or the MILConfig utility Interactive Troubleshooting. A trace-disabled thread can still log trace information when explicitly enabled with MIL code. To enable a trace log on a trace-disabled thread, use MappControl() with M_TRACE + M_THREAD_CURRENT set to M_LOG_ENABLE. The trace log will generate trace information starting from the point in the code that the function appears. You can disable generating further trace information in this thread with M_LOG_DISABLE. This creates a trace-enabled block of code in this thread, which is otherwise not generating any trace information. Disabling trace logs with M_TRACE_LOG_DISABLE helps to protect intellectual property because no external program will be able to generate a trace for this application. A trace-enabled block will protect sensitive intellectual property while still examining a specific section of code. M_THREAD Allocates a thread and associates it with a MIL thread context. If the target processor is an on-board processor of a system that supports multi-threading, MIL automatically creates, and eventually terminates, an on-board thread for each thread that sends commands to the board. M_DEFAULT Specifies the default initialization state. This is the only setting available for threads and mutexes. For events, M_DEFAULT is the same as M_NOT_SIGNALED + M_AUTO_RESET. M_TRACE_LOG_DISABLE Specifies to disable the creation of trace logs on this thread by any external program, such as Matrox Profiler or the MILConfig utility Interactive Troubleshooting. A trace-disabled thread can still log trace information when explicitly enabled with MIL code. To enable a trace log on a trace-disabled thread, use MappControl() with M_TRACE + M_THREAD_CURRENT set to M_LOG_ENABLE. The trace log will generate trace information starting from the point in the code that the function appears. You can disable generating further trace information in this thread with M_LOG_DISABLE. This creates a trace-enabled block of code in this thread, which is otherwise not generating any trace information. Disabling trace logs with M_TRACE_LOG_DISABLE helps to protect intellectual property because no external program will be able to generate a trace for this application. A trace-enabled block will protect sensitive intellectual property while still examining a specific section of code. Combination values for [when ObjectType=M_EVENT and ControlFlag=M_NOT_SIGNALED: M_NOT_SIGNALED ], [when ObjectType=M_EVENT and ControlFlag=M_SIGNALED: M_SIGNALED]. You must add one of the following values to the above-mentioned values to set how the event is reset. For M_SIGNALED or M_NOT_SIGNALED Combination value Description M_AUTO_RESET Specifies that the event is reset automatically. The state of this type of event is automatically reset to M_NOT_SIGNALED upon the return of a call to MthrWait() with M_EVENT_SYNCHRONIZE or M_EVENT_WAIT. Events that are reset automatically are useful in applications where only one thread waits on a specific event. M_MANUAL_RESET Specifies that the event is reset manually. The state of this type of event remains unchanged until a call to MthrControl() with M_EVENT_SET is issued. Events that are reset manually are useful when multiple threads wait on a specific event. Return value The returned value is the thread context, event, or mutex identifier either as a standard identifier (MIL_ID) or a smart identifier (MIL_UNIQUE_THR_ID). If allocation fails, M_NULL is returned (or nullptr if M_UNIQUE_ID was specified). Compilation information Header Include mil.h. Library Use mil.lib. DLL Requires mil.dll. Syntax Description Parameters - SystemId For specifying the system - ObjectType - ControlFlag - ThreadFctPtr - UserDataPtr - ThreadEventOrMutexIdPtr For retrieving the identifier or specifying how to return it Parameter Associations For specifying the type of object to allocate and its initiation state + For M_EVENTM_SIGNALED or M_EVENTM_NOT_SIGNALED Return value Compilation information ",
      "wordCount": 1801,
      "subEntries": []
    },
    {
      "id": "Reference_thr_MthrControl",
      "version": null,
      "title": "MthrControl",
      "subTitles": null,
      "location": "MIL Reference",
      "pageURL": "content\\Reference\\thr\\MthrControl.htm",
      "text": " MthrControl Synopsis Control a MIL thread context, MIL event, or MIL mutex setting. Syntax void MthrControl( MIL_ID&nbsp;ThreadEventOrMutexId, //in MIL_INT64&nbsp;ControlType, //in MIL_DOUBLE&nbsp;ControlValue //in ) Description This function controls a MIL thread context, MIL event, or MIL mutex setting. Most of these control type settings can be inquired using MthrInquire(). Note that when using a C compiler (not a C++ or other compiler) in 64-bit mode, MthrControl() internally calls the MIL_INT64 version of this function (MthrControlInt64()). If you need to pass large integer values (including pointers), call the MIL_INT64 version of this function (MthrControlDouble()). Parameters Parameters ThreadEventOrMutexId Specifies the identifier of a user-allocated MIL thread context, event, or mutex, allocated using MthrAlloc(). This parameter can also be set to the MIL identifier of a system. For specifying the identifier of a user-allocated MIL thread context, event, or mutex Value Description M_DEFAULT Specifies the default MIL thread context identifier associated with the current Host thread. MIL event identifier Specifies the identifier of a user-allocated MIL event (MthrAlloc()). MIL mutex identifier Specifies the identifier of a user-allocated MIL mutex (MthrAlloc()). MIL system identifier Specifies the identifier of a valid system identifier (MsysAlloc()). When the parameter is set to the MIL identifier of a system, the function inquires about the current thread on the particular system. MIL thread context identifier Specifies the identifier of a user-allocated MIL thread context (MthrAlloc()). ControlType Specifies the type of setting to control. See the Parameter associations section for possible values that can be specified. ControlValue Specifies the new value to assign to the setting specified by the ControlType parameter. See the Parameter associations section for possible values that can be specified. Parameter associations The tables below list possible values for the ControlType and ControlValue parameters. For thread contexts For controlling MIL events For controlling a MIL mutex The following ControlType and corresponding ControlValue settings can be specified to control MIL thread contexts: For thread contexts ControlType Description MIL system-specifictooltip (‡) ControlValue M_ACCELERATOR Sets whether the thread uses hardware acceleration. Hardware acceleration speeds up the execution of certain functions in a thread. Use MsysInquire() with M_ACCELERATOR_PRESENT to learn if your Matrox imaging board has an accelerator. ‡ M_DISABLE Specifies not to use hardware acceleration. ‡ M_ENABLE Specifies to use hardware acceleration. This is the default value. ‡ M_BUS_MASTER_COPY_MODE Sets the synchronization mode for copy operations when they are driven by your imaging board (bus master). In this case, the current setting for M_THREAD_MODE does not effect the synchronization mode. ‡ M_DEFAULT Same as M_SYNCHRONOUS. ‡ M_ASYNCHRONOUS Specifies that when possible, control will be returned to the imaging board (bus master) immediately after a copy operation is launched. ‡ M_SYNCHRONOUS Specifies that the execution of a copy operation must be completed before returning control to the imaging board (bus master). ‡ M_NODE_SELECT Sets the MIL system where MIL functions will run in the thread, when running multiple systems in DMIL. ‡ M_DEFAULT Specifies that the MIL system on which the MIL functions will run is selected automatically. ‡ MIL system identifier Specifies a valid system identifier, which forces all MIL functions to run on this system. When running a monitoring model DMIL setup, to specify that MIL functions must run on a monitored computer, the monitored computer must first publish its system identifier, using MobjControl(). Once the system identifier is published, the monitoring computer must inquire it, using MobjInquire(), before using it with this control value. ‡ M_THREAD_COMMANDS_ABORT Cancels all calls queued in the thread. The remainder of the application is executed. ‡ M_DEFAULT Implements the default behavior. ‡ M_THREAD_MODE Sets the execution mode of the thread. Note that a thread can only work in asynchronous mode if threads allocated on the same system can execute in asynchronous mode (MsysControl() with M_THREAD_MODE). If they can only execute in synchronous mode, the specified thread will work in synchronous mode regardless of this setting. ‡ MIL system specific Note that the specified synchronization mode does not affect copy operations. Use M_BUS_MASTER_COPY_MODE to specify the required mode for copying. ‡ M_DEFAULT Same as M_ASYNCHRONOUS. ‡ M_ASYNCHRONOUS Specifies that the thread will execute in asynchronous mode, if possible. In this mode, control is returned to the Host immediately after a MIL function is sent to the processor of the thread's associated system (when the system and function allow an immediate return). ‡ M_SYNCHRONOUS Specifies that the thread will execute in synchronous mode. In this mode, the execution of a MIL function sent to the processor of the thread's associated system must be completed (execution terminated) before returning control to the Host. ‡ M_THREAD_PRIORITY Sets the priority status of the thread. ‡ M_ABOVE_NORMAL Specifies that the thread is above normal priority. Only time critical threads will be executed before it. ‡ M_BELOW_NORMAL Specifies that the thread is below normal priority. Threads of normal, above normal, and time critical priority will be executed before it. ‡ M_IDLE Specifies that the thread is idle. The thread will remain idle until its priority status is changed. ‡ M_LOWEST Specifies that the thread is of the lowest priority. All other non-idle threads will be executed before it. ‡ M_NORMAL Specifies that the thread is of normal priority. Threads of above normal and time critical priority will be executed before it. This is the default value. ‡ M_TIME_CRITICAL Specifies that the thread is time critical. Time critical threads will be executed before all other threads that are not time critical. ‡ M_THREAD_SELECT Sets the selectable thread, specified by the ThreadEventOrMutexId parameter, as the destination for subsequent MIL functions. This allows MIL functions to be executed on systems with on-board processors. Before calling MthrControl() with M_THREAD_SELECT you should inquire and save the identifier of the on-board thread that is by default associated with the Host thread, using MsysInquire() with M_CURRENT_THREAD_ID. This allows you to return control to this on-board thread. If the ThreadEventOrMutexId parameter is set to an identifier of a thread that is not selectable, changing the settings of this control will generate an error. ‡ M_DEFAULT Implements the default behavior. ‡ The following ControlType and corresponding ControlValue setting can be specified to control MIL events: For controlling MIL events ControlType Description ControlValue M_EVENT_SET Sets an event to the specified state. M_NOT_SIGNALED Sets the event to the not-signaled state. M_SIGNALED Sets the event to the signaled state. The following ControlType and corresponding ControlValue setting can be specified to control a MIL mutex: For controlling a MIL mutex ControlType Description ControlValue M_LOCK Forces the current thread to wait until the specified MIL mutex is available and then locks it. Locking the mutex blocks all other threads from accessing the current critical section of code. Note that the current thread can lock the same mutex several times without an error occurring. However, the current thread must unlock (M_UNLOCK) the mutex as many times as it was locked. For example, if the current thread previously locked the mutex twice, the mutex must be unlocked twice after the critical section of code has completed. M_DEFAULT Specifies the default behavior. M_LOCK_TRY Locks the specified MIL mutex if it is currently unlocked. Locking the mutex blocks all other threads from accessing the current critical section of code. If the mutex is locked by another thread, M_LOCK_TRY does not force the thread to wait for the mutex to become unlocked; the thread continues executing without executing the critical section of code protected by the mutex. To determine whether the current thread has successfully locked the mutex, use MthrInquire() with M_LOCK_TRY. M_DEFAULT Implements the default behavior. M_UNLOCK Unlocks the specified mutex. M_DEFAULT Implements the default behavior. Type-specific versions of the function when using a C compiler under 64-bit void MthrControlDouble (MIL_ID ThreadEventOrMutexId, MIL_INT64 ControlType, MIL_DOUBLE ControlValue) Details Parameters ThreadEventOrMutexId See ThreadEventOrMutexId of the main function for a description. ControlType See ControlType of the main function for a description. ControlValue See ControlValue of the main function for a description. void MthrControlInt64 (MIL_ID ThreadEventOrMutexId, MIL_INT64 ControlType, MIL_INT64 ControlValue) Details Parameters ThreadEventOrMutexId See ThreadEventOrMutexId of the main function for a description. ControlType See ControlType of the main function for a description. ControlValue See ControlValue of the main function for a description. Compilation information Header Include mil.h. Library Use mil.lib. DLL Requires mil.dll. Syntax Description Parameters - ThreadEventOrMutexId For specifying the identifier of a user-allocated MIL thread context, event, or mutex - ControlType - ControlValue Parameter Associations For thread contexts For controlling MIL events For controlling a MIL mutex Type-specific versions of the function when using a C compiler under 64-bit Compilation information ",
      "wordCount": 1412,
      "subEntries": []
    },
    {
      "id": "Reference_thr_MthrControlMp",
      "version": null,
      "title": "MthrControlMp",
      "subTitles": null,
      "location": "MIL Reference",
      "pageURL": "content\\Reference\\thr\\MthrControlMp.htm",
      "text": " MthrControlMp Synopsis Control a MIL multi-core processing setting of a thread context. Syntax void MthrControlMp( MIL_ID&nbsp;ThrId, //in MIL_INT64&nbsp;ControlType, //in MIL_INT64&nbsp;TypeFlag, //in MIL_INT64&nbsp;TypeValue, //in void&nbsp;*ValuePtr //in ) Description This function controls a MIL multi-core processing setting of a thread context. It establishes whether MIL can use multi-core processing to execute certain parts of MIL functions on the specified thread. It also sets how multi-core processing is performed for the specified thread. MthrControlMp() always takes precedence over MappControlMp(). Parameters Parameters ThrId Specifies the identifier of a user-allocated MIL thread context allocated using MthrAlloc(). For specifying the identifier of a user-allocated MIL thread context Value Description M_DEFAULT Specifies the default MIL thread context identifier associated with the current Host thread. MIL thread context identifier Specifies the identifier of a user-allocated MIL thread context. ControlType Specifies the type of multi-core processing setting to control. See the Parameter associations section for possible values that can be specified. TypeFlag Reserved for future expansion. This parameter must be set to M_DEFAULT. TypeValue Specifies the setting's new value. See the Parameter associations section for possible values that can be specified. ValuePtr Accepts the address of one of the following (see the Parameter associations section for specifics on which is expected): array of type MIL_UINT64 [optionally, in C++: a reference to a constant std::vector&lt;MIL_UINT64&gt; ] Specifies the address which contains more information about the setting's new value. Set this parameter to M_NULL if not used. See the Parameter associations section for possible values that can be specified. Parameter associations The table below lists possible values for the ControlType, TypeValue, and ValuePtr parameters. For specifying multi-core processing thread context settings Note, if unused, the ValuePtr parameter must be set to M_NULL. For specifying multi-core processing thread context settings ControlType Description TypeValue ValuePtr M_CORE_AFFINITY_MASK Sets the core affinity bit-mask, which indicates on which CPU core(s) (processor(s)) to run the multi-core processing part of MIL functions. Essentially, the core affinity mask defines the preferred processing CPU core(s) to use for MIL multi-core processing. The number of CPU cores actually used for multi-core processing will be affected by M_CORE_MAX (or M_CORE_MAX_FOR_COPY for copy type functions such as MbufCopy()) and M_CORE_AFFINITY_MASK. Typically, the number of cores used for multi-processing will be the lesser of the two values. If M_CORE_MAX (or M_CORE_MAX_FOR_COPY) specifies a larger number than the number of CPU cores enabled with M_CORE_AFFINITY_MASK, only the CPU cores enabled with the core affinity mask will be used for multi-core processing. If M_CORE_MAX (or M_CORE_MAX_FOR_COPY) specifies a smaller number than the number of CPU cores enabled with M_CORE_AFFINITY_MASK, MIL will restrict multi-core processing to the number of CPU cores specified with M_CORE_MAX (or M_CORE_MAX_FOR_COPY), but only from those enabled with the core affinity mask. To establish which CPU cores are assigned to the process running your MIL application, call MappInquireMp() with M_CORE_AFFINITY_MASK_PROCESS. TypeValue Specifies how to define the mask. M_DEFAULT Specifies the default value. This is the same as the value specified using MappControlMp() with M_CORE_AFFINITY_MASK. M_ALL Specifies to use all CPU cores available to the process running the MIL application, as per the operating system. M_USER_DEFINED Specifies to use a user-defined core affinity bit-mask. ValuePtr Data type info: Data type: array of type MIL_UINT64 [optionally, in C++: a reference to a constant std::vector&lt;MIL_UINT64&gt; ] MORE Data type: array of type MIL_UINT64 [optionally, in C++: a reference to a constant std::vector&lt;MIL_UINT64&gt; ] Required array size: MthrInquireMp ( M_CORE_AFFINITY_MASK_ARRAY_SIZE ) Specifies the core affinity bit-mask to use when defining a M_USER_DEFINED mask. M_NULL Specifies that a user-defined mask is not used. Non-zero initialized bit-mask array Specifies a bit-mask array in which each bit represents one CPU core. The first element of the array represents the first 64 CPU cores. The least-significant bit of the first element represents CPU core 0. The most-significant bit of the first element represents CPU core 63. The least-significant bit of the second element represents CPU core 64 and so on. CPU cores can be used for multi-core processing if their corresponding bit is enabled (1). If their corresponding bit is disabled (0), multi-core processing is not allowed to occur on those CPU cores. CPU cores always have the same indices, as long as the hardware in your computer and the operating system does not change. A normal core affinity bit-mask should have at least one bit enabled so that at least one CPU core is enabled for processing. A core affinity bit-mask whose bits are all set to zero is therefore a special case and represents the default setting of all CPU cores being enabled for processing. M_CORE_MAX Sets the maximum number of CPU cores to use to process the multi-core processing part of each MIL function on the specified thread, when multi-core processing is enabled. Multi-core processing can be enabled using the MILConfig utility, MappControlMp() with M_MP_USE, or MthrControlMp() with M_MP_USE. Note that this control type overrides the value set with the MILConfig utility and MappControlMp(). The number of CPU cores actually used for multi-core processing will be affected by M_CORE_MAX (or M_CORE_MAX_FOR_COPY for copy type functions such as MbufCopy()) and M_CORE_AFFINITY_MASK. Typically, the number of cores used for multi-processing will be the lesser of the two values. If M_CORE_MAX (or M_CORE_MAX_FOR_COPY) specifies a larger number than the number of CPU cores enabled with M_CORE_AFFINITY_MASK, only the CPU cores enabled with the core affinity mask will be used for multi-core processing. If M_CORE_MAX (or M_CORE_MAX_FOR_COPY) specifies a smaller number than the number of CPU cores enabled with M_CORE_AFFINITY_MASK, MIL will restrict multi-core processing to the number of CPU cores specified with M_CORE_MAX (or M_CORE_MAX_FOR_COPY), but only from those enabled with the core affinity mask. The effective number of CPU cores available to MIL is limited by the number of CPU cores installed in your computer and any limits imposed by the operating system. To establish the number of CPU cores assigned to the process running your MIL application, call MappInquireMp() with M_CORE_NUM_PROCESS. Note that the first call to MappAlloc() or MappAllocDefault() determines the number of CPU cores available from the operating system. This information is stored in MIL and not updated dynamically. Changing the number of processors available at the operating-system level, after your application is allocated in MIL, can result in erratic and unpredictable behavior. TypeValue Specifies one of the following. M_DEFAULT Specifies the default value. This is the same as the value specified using MappControlMp() with M_CORE_MAX. 1 &lt;= Value &lt;= 65535 Specifies the maximum number of CPU cores to use. To use only one CPU core and disable multi-core processing, set the value to 1 or use the M_MP_USE control type. Note that specifying the number of cores to use as 1 is effectively the equivalent of setting M_MP_USE to M_DISABLE. M_CORE_MAX_FOR_COPY Sets the maximum number of CPU cores to use to process the multi-core processing part of copy type functions, such as MbufCopy(), on the specified thread, when multi-core processing is enabled. Multi-core processing can be enabled using the MILConfig utility, MappControlMp() with M_MP_USE, or MthrControlMp() with M_MP_USE. Note that this control type overrides the value set with the MILConfig utility and MappControlMp(). The number of cores set with M_CORE_MAX_FOR_COPY only affects copy type functions, and supercedes the number of cores set with M_CORE_MAX. For instance, if M_CORE_MAX specifies to use 4 cores, then all functions will use 4 cores. If afterwards M_CORE_MAX_FOR_COPY specifies 2 cores, all copy type functions will use 2 cores, while the remaining functions will still use 4. The number of CPU cores actually used for multi-core processing will be affected by M_CORE_MAX (or M_CORE_MAX_FOR_COPY for copy type functions such as MbufCopy()) and M_CORE_AFFINITY_MASK. Typically, the number of cores used for multi-processing will be the lesser of the two values. If M_CORE_MAX (or M_CORE_MAX_FOR_COPY) specifies a larger number than the number of CPU cores enabled with M_CORE_AFFINITY_MASK, only the CPU cores enabled with the core affinity mask will be used for multi-core processing. If M_CORE_MAX (or M_CORE_MAX_FOR_COPY) specifies a smaller number than the number of CPU cores enabled with M_CORE_AFFINITY_MASK, MIL will restrict multi-core processing to the number of CPU cores specified with M_CORE_MAX (or M_CORE_MAX_FOR_COPY), but only from those enabled with the core affinity mask. The effective number of CPU cores available to MIL is limited by the number of CPU cores installed in your computer and any limits imposed by the operating system. To establish the number of CPU cores assigned to the process running your MIL application, call MappInquireMp() with M_CORE_NUM_PROCESS. Note that the first call to MappAlloc() or MappAllocDefault() determines the number of CPU cores available from the operating system. This information is stored in MIL and not updated dynamically. Changing the number of processors available at the operating-system level, after your application is allocated in MIL, can result in erratic and unpredictable behavior. TypeValue Specifies one of the following. M_DEFAULT Specifies the default value. This is the same as the value specified using MappControlMp() with M_CORE_MAX_FOR_COPY. M_FOLLOW_CORE_MAX Specifies to use the current value of M_CORE_MAX. 1 &lt;= Value &lt;= 65535 Specifies the maximum number of CPU cores to use. To use only one CPU core and disable multi-core processing for copy type functions, set the value to 1. M_CORE_SHARING Sets whether MIL multi-core processing can use multiple logical cores per physical CPU core, when hyper-threading is enabled and supported. An Intel processor's hyper-threading technology allows each of its physical CPU cores to be represented by multiple logical CPU cores, typically improving parallelization of computations. However, depending on the processing operation, this might reduce the processing speed. If you disable M_CORE_SHARING, MIL multi-core processing executes as if hyper-threading was disabled and restricts multi-core processing to one logical core per physical CPU core, minimizing logical core interactions. Note that a thread might not have exclusive access to a CPU core; other processes or threads might still use the other logical cores of a physical CPU core and might impede multi-core processing restricted this way. This control type only affects how the multi-core processing part of MIL functions is performed. TypeValue Specifies one of the following. M_DEFAULT Specifies the default value. This is the same as the value specified using MappControlMp() with M_CORE_SHARING. M_DISABLE Uses only one logical core per physical CPU core, if hyper-threading is enabled. M_ENABLE Uses all the logical cores of a physical CPU core, if hyper-threading is enabled. M_MP_PRIORITY Controls the processing priority of the multi-core processing part of MIL functions. TypeValue Specifies one of the following. M_DEFAULT Specifies the default value. This is the same as the value specified using MappControlMp() with M_MP_PRIORITY. M_ABOVE_NORMAL Specifies that the multi-core processing part of MIL functions will be executed with above normal priority. M_BELOW_NORMAL Specifies that the multi-core processing part of MIL functions will be executed with below normal priority. M_HIGHEST Specifies that the multi-core processing part of MIL functions will be executed with high priority. Only M_TIME_CRITICAL assigns a higher priority. M_IDLE Specifies that the multi-core processing part of MIL functions will be executed with idle priority. All idle priority processing objects are only executed when a CPU core is idle. M_LOWEST Specifies that the multi-core processing part of MIL functions will be executed with low priority. M_NORMAL Specifies that the multi-core processing part of MIL functions will be executed with normal priority. M_TIME_CRITICAL Specifies that the multi-core processing part of MIL functions will be executed with time critical priority. Time critical processing objects have highest priority. M_MP_USE Sets whether multi-core processing can be used to execute certain parts of MIL functions. Note that the MILConfig utility can override and disable all MIL multi-core processing. To inquire whether the MILConfig utility has disabled MIL multi-core processing, use MappInquireMp() with M_MP_FORCED_DISABLE. TypeValue Specifies one of the following. M_DEFAULT Specifies the default value. This is the same as the value specified using MappControlMp() with M_MP_USE. M_DISABLE Specifies that multi-core processing cannot be used for MIL functions on the specified thread. M_ENABLE Specifies that multi-core processing can be used for MIL functions on the specified thread. Compilation information Header Include mil.h. Library Use mil.lib. DLL Requires mil.dll, milmp.dll. Syntax Description Parameters - ThrId For specifying the identifier of a user-allocated MIL thread context - ControlType - TypeFlag - TypeValue - ValuePtr Parameter Associations For specifying multi-core processing thread context settings Compilation information ",
      "wordCount": 2034,
      "subEntries": []
    },
    {
      "id": "Reference_thr_MthrFree",
      "version": null,
      "title": "MthrFree",
      "subTitles": null,
      "location": "MIL Reference",
      "pageURL": "content\\Reference\\thr\\MthrFree.htm",
      "text": " MthrFree Synopsis Free a MIL thread context, event, or mutex. Syntax void MthrFree( MIL_ID&nbsp;ThreadEventorMutexId //in ) Description This function deallocates a MIL thread context, event, or mutex previously allocated with MthrAlloc(). To free a MIL thread allocated by MthrAlloc(), you must call MthrFree() from another thread. MthrFree() will wait indefinitely for that thread to terminate it's execution before returning. All MIL thread contexts, events, or mutexes allocated on a particular system must be freed before the system can be freed, unless M_UNIQUE_ID was specified during allocation. Parameters Parameter ThreadEventorMutexId Specifies the identifier of the MIL thread context/event/mutex to free. Compilation information Header Include mil.h. Library Use mil.lib. DLL Requires mil.dll. Syntax Description Parameters - ThreadEventorMutexId Compilation information ",
      "wordCount": 119,
      "subEntries": []
    },
    {
      "id": "Reference_thr_MthrInquire",
      "version": null,
      "title": "MthrInquire",
      "subTitles": null,
      "location": "MIL Reference",
      "pageURL": "content\\Reference\\thr\\MthrInquire.htm",
      "text": " MthrInquire Synopsis Inquire about a MIL thread context, event, or mutex setting. Syntax MIL_INT MthrInquire( MIL_ID&nbsp;ThreadEventOrMutexId, //in MIL_INT64&nbsp;InquireType, //in void&nbsp;*UserVarPtr //out ) Description This function inquires about the specified MIL thread context, event setting, or mutex setting. Parameters Parameters ThreadEventOrMutexId Specifies the identifier of a user-allocated MIL thread context, event, or mutex, allocated using MthrAlloc(). This parameter should be set to one of the following values: For a user-allocated thread context or event Value Description M_DEFAULT Specifies the default MIL thread context identifier associated with the current Host thread. MIL event identifier Specifies the identifier of a user-allocated MIL event (MthrAlloc()). MIL mutex identifier Specifies the identifier of a user-allocated MIL mutex (MthrAlloc()). MIL system identifier Specifies the identifier of a valid system identifier (MsysAlloc()). When the parameter is set to the MIL identifier of a system, the function inquires about the current thread on the particular system. MIL thread context identifier Specifies the identifier of a user-allocated MIL thread context (MthrAlloc()). InquireType Specifies the type of information about which to inquire. This parameter can be set to one of the values below. See MthrControl() for more information about these values. See the Parameter associations section for possible values that can be specified. UserVarPtr Accepts the address of one of the following (see the Parameter associations section for specifics on which is expected): MIL_INT Specifies the address in which to write the requested information. Since the MthrInquire() function also returns the requested information, you can set this parameter to M_NULL. See the Parameter associations section for possible values that can be returned. Parameter associations The tables below list possible values for the InquireType parameter and possible values returned to the UserVarPtr parameter. For thread contexts For MIL events For mutexes The following InquireType settings can be specified to inquire about MIL thread contexts. For thread contexts InquireType Description MIL system-specifictooltip (‡) UserVarPtr - Possible values returned M_ACCELERATOR Inquires whether the thread uses hardware acceleration. ‡ UserVarPtr extra info Data type info: Data type: address of a MIL_INT Data type: address of a MIL_INT ‡ M_DISABLE Specifies not to use hardware acceleration. ‡ M_ENABLE Specifies to use hardware acceleration. ‡ M_BUS_MASTER_COPY_MODE Inquires the synchronization mode for copy operations when they are driven by your imaging board (bus master). ‡ UserVarPtr extra info Data type info: Data type: address of a MIL_INT Data type: address of a MIL_INT ‡ M_ASYNCHRONOUS Specifies that when possible, control will be returned to the imaging board (bus master) immediately after a copy operation is launched. ‡ M_SYNCHRONOUS Specifies that the execution of a copy operation must be completed before returning control to the imaging board (bus master). ‡ M_THREAD_MODE Inquires the thread's execution mode. ‡ UserVarPtr extra info Data type info: Data type: address of a MIL_INT Data type: address of a MIL_INT ‡ M_ASYNCHRONOUS Specifies that the thread will execute in asynchronous mode, if possible. ‡ M_SYNCHRONOUS Specifies that the thread will execute in synchronous mode. ‡ M_THREAD_PRIORITY Inquires the priority setting of the thread. ‡ UserVarPtr extra info Data type info: Data type: address of a MIL_INT Data type: address of a MIL_INT ‡ M_ABOVE_NORMAL Specifies that the thread is above normal priority. ‡ M_BELOW_NORMAL Specifies that the thread is below normal priority. ‡ M_IDLE Specifies that the thread is idle. ‡ M_LOWEST Specifies that the thread is of the lowest priority. ‡ M_NORMAL Specifies that the thread is of normal priority. ‡ M_TIME_CRITICAL Specifies that the thread is time critical. ‡ The following InquireType settings can be specified to inquire about MIL events. For MIL events InquireType Description UserVarPtr - Possible values returned M_EVENT_MODE Inquires the reset mode of the event. UserVarPtr extra info Data type info: Data type: address of a MIL_INT Data type: address of a MIL_INT M_AUTO_RESET Specifies that the event is reset automatically. M_MANUAL_RESET Specifies that the event is reset manually. M_EVENT_STATE Inquires the state of the event. UserVarPtr extra info Data type info: Data type: address of a MIL_INT Data type: address of a MIL_INT M_NOT_SIGNALED Specifies the not-signaled state. M_SIGNALED Specifies the signaled state. The following InquireType settings can be specified to inquire about MIL mutexes. For mutexes InquireType Description UserVarPtr - Possible values returned M_LOCK_TRY Inquires whether the specified MIL mutex is locked by the current thread. UserVarPtr extra info Data type info: Data type: address of a MIL_INT Data type: address of a MIL_INT M_NO Specifies that the current thread has not locked the specified mutex. M_YES Specifies that the current thread has locked the specified mutex. Return value The returned value is the requested information, cast to a MIL_INT. If the requested information does not fit into a MIL_INT, this function will return M_NULL or truncate the information. Compilation information Header Include mil.h. Library Use mil.lib. DLL Requires mil.dll. Syntax Description Parameters - ThreadEventOrMutexId For a user-allocated thread context or event - InquireType - UserVarPtr Parameter Associations For thread contexts For MIL events For mutexes Return value Compilation information ",
      "wordCount": 827,
      "subEntries": []
    },
    {
      "id": "Reference_thr_MthrInquireMp",
      "version": null,
      "title": "MthrInquireMp",
      "subTitles": null,
      "location": "MIL Reference",
      "pageURL": "content\\Reference\\thr\\MthrInquireMp.htm",
      "text": " MthrInquireMp Synopsis Inquires about a MIL multi-core processing setting of a thread context. Syntax MIL_INT MthrInquireMp( MIL_ID&nbsp;ThrId, //in MIL_INT64&nbsp;InquireType, //in MIL_INT64&nbsp;TypeFlag, //in MIL_INT64&nbsp;TypeValue, //in void&nbsp;*ResultPtr //out ) Description This function inquires about a MIL multi-core processing setting of a thread context. This function can return whether multi-core processing is used to execute the MIL functions on the specified thread. It can also return how multi-core processing is performed for the specified thread. MthrInquireMp() always takes precedence over MappInquireMp(). Parameters Parameters ThrId Specifies the identifier of a user-allocated MIL thread context allocated using MthrAlloc(). For specifying the identifier of a user-allocated MIL thread context Value Description M_DEFAULT Specifies the default MIL thread context identifier associated with the current Host thread. MIL thread context identifier Specifies the identifier of a user-allocated MIL thread context. InquireType Specifies the type of multi-core processing setting about which to inquire. See the Parameter associations section for possible values that can be specified. TypeFlag Reserved for future expansion. This parameter must be set to M_DEFAULT. TypeValue Reserved for future expansion. This parameter must be set to M_DEFAULT. ResultPtr Accepts the address of one of the following (see the Parameter associations section for specifics on which is expected): array of type MIL_UINT64 [optionally, in C++: a reference to a std::vector&lt;MIL_UINT64&gt; ] MIL_INT Specifies the address in which to write the requested information. Since the MthrInquireMp() function also returns the requested information, you can set this parameter to M_NULL. See the Parameter associations section for possible values that can be returned. Parameter associations The table below lists possible values for the InquireType parameter and possible values returned to the ResultPtr parameter. For inquiring about general types of thread settings For inquiring about general types of thread settings InquireType Description ResultPtr - Possible values returned M_CORE_AFFINITY_MASK Inquires the core affinity bit-mask, which indicates the CPU cores that can be used to run the multi-core processing part of MIL functions. The first element of the array represents the first 64 CPU cores. The least-significant bit of the first element represents CPU core 0. The most-significant bit of the first element represents CPU core 63. The least-significant bit of the second element represents CPU core 64 and so on. A CPU core is available if its corresponding bit is enabled (1). If its corresponding bit is disabled (0), the CPU core is not available. CPU cores always have the same indices, as long as the hardware in your computer and the operating system does not change. ResultPtr extra info Data type info: Data type: array of type MIL_UINT64 [optionally, in C++: a reference to a std::vector&lt;MIL_UINT64&gt; ] MORE Data type: array of type MIL_UINT64 [optionally, in C++: a reference to a std::vector&lt;MIL_UINT64&gt; ] Required array size: MthrInquireMp ( M_CORE_AFFINITY_MASK_ARRAY_SIZE ) Non-zero initialized bit-mask array Specifies a bit-mask array in which each bit represents one CPU core. Zero-initialized bit-mask Specifies that all CPU cores that are available to the process running your MIL application can be used (M_CORE_AFFINITY_MASK is set to M_ALL). M_CORE_AFFINITY_MASK_ARRAY_SIZE Inquires the size of the array required to store the core affinity bit-mask. See M_CORE_AFFINITY_MASK in MthrControlMp() for more details. The size of the array might represent a larger number of CPU cores than there are available in your computer. This is because the CPU cores might not be indexed by the operating system successively and/or are less than a multiple of 64. ResultPtr extra info Data type info: Data type: address of a MIL_INT Data type: address of a MIL_INT Value &gt;= 1 Specifies the size of the core affinity mask array. M_CORE_MAX Inquires the maximum number of CPU cores to use to process the multi-core processing part of each MIL function on the specified thread. ResultPtr extra info Data type info: Data type: address of a MIL_INT Data type: address of a MIL_INT M_DEFAULT Specifies the default value. 1 &lt;= Value &lt;= 65535 Specifies the maximum number of CPU cores to use. M_CORE_MAX_FOR_COPY Inquires the maximum number of CPU cores to use to process the multi-core processing part of copy type functions on the specified thread. ResultPtr extra info Data type info: Data type: address of a MIL_INT Data type: address of a MIL_INT M_DEFAULT Specifies the default value. M_FOLLOW_CORE_MAX Specifies to use the current value of M_CORE_MAX. 1 &lt;= Value &lt;= 65535 Specifies the maximum number of CPU cores to use. M_CORE_NUM_EFFECTIVE Inquires the number of CPU cores available for executing the multi-core processing part of MIL functions on the specified thread. ResultPtr extra info Data type info: Data type: address of a MIL_INT Data type: address of a MIL_INT Value &gt;= 1 Specifies the number of CPU cores available. M_CORE_SHARING Inquires whether MIL multi-core processing can use multiple logical cores per physical CPU core, when hyper-threading is enabled and supported. ResultPtr extra info Data type info: Data type: address of a MIL_INT Data type: address of a MIL_INT M_DEFAULT Specifies the default value. M_DISABLE Specifies only one logical core per physical CPU core, if hyper-threading is enabled. M_ENABLE Specifies all the logical cores of a physical CPU core, if hyper-threading is enabled. M_MP_PRIORITY Inquires the processing priority of the multi-core processing part of MIL functions. ResultPtr extra info Data type info: Data type: address of a MIL_INT Data type: address of a MIL_INT M_DEFAULT Specifies the default value. M_ABOVE_NORMAL Specifies that the multi-core processing part of MIL functions will be executed with above normal priority. M_BELOW_NORMAL Specifies that the multi-core processing part of MIL functions will be executed with below normal priority. M_HIGHEST Specifies that the multi-core processing part of MIL functions will be executed with high priority. M_IDLE Specifies that the multi-core processing part of MIL functions will be executed with idle priority. M_LOWEST Specifies that the multi-core processing part of MIL functions will be executed with low priority. M_NORMAL Specifies that the multi-core processing part of MIL functions will be executed with normal priority. M_TIME_CRITICAL Specifies that the multi-core processing part of MIL functions will be executed with time critical priority. M_MP_USE Inquires whether multi-core processing can be used to execute certain parts of MIL functions. MappInquireMp() with M_MP_FORCED_DISABLE takes precedence over this setting. ResultPtr extra info Data type info: Data type: address of a MIL_INT Data type: address of a MIL_INT M_DEFAULT Specifies the default value. M_DISABLE Specifies that multi-core processing cannot be used for MIL functions on the specified thread. M_ENABLE Specifies that multi-core processing can be used for MIL functions on the specified thread. Return value The returned value is the requested information cast to a MIL_INT, except for M_CORE_AFFINITY_MASK. In this case, the returned value is undefined. If the requested information does not fit into a MIL_INT, this function will return M_NULL or truncate the information. Compilation information Header Include mil.h. Library Use mil.lib. DLL Requires mil.dll, milmp.dll. Syntax Description Parameters - ThrId For specifying the identifier of a user-allocated MIL thread context - InquireType - TypeFlag - TypeValue - ResultPtr Parameter Associations For inquiring about general types of thread settings Return value Compilation information ",
      "wordCount": 1167,
      "subEntries": []
    },
    {
      "id": "Reference_thr_MthrWait",
      "version": null,
      "title": "MthrWait",
      "subTitles": null,
      "location": "MIL Reference",
      "pageURL": "content\\Reference\\thr\\MthrWait.htm",
      "text": " MthrWait Synopsis Perform a wait operation on a MIL thread or event. Syntax MIL_INT MthrWait( MIL_ID&nbsp;ThreadOrEventId, //in MIL_INT64&nbsp;WaitOption, //in MIL_INT&nbsp;*StatePtr //out ) Description This function allows you to synchronize the execution of threads by forcing the current thread to wait for the completion of the specified thread or the change of state of the specified event. Parameters Parameters ThreadOrEventId Specifies the identifier of the MIL thread context or event with which to be synchronized. This parameter can also be set to the MIL identifier of a system. This parameter should be set to one of the following values: For specifying the thread context or event identifier Value Description M_DEFAULT Specifies the default MIL thread context identifier associated with the current Host thread. MIL event identifier Specifies the identifier of a user-allocated MIL event (MthrAlloc()). MIL system identifier Specifies the identifier of a valid system identifier (MsysAlloc()). MIL thread context identifier Specifies the identifier of a user-allocated MIL thread context (MthrAlloc()). WaitOption Specifies the wait option. The following wait options are available for threads. For specifying the wait option for threads Value Description M_THREAD_END_WAIT Forces the current thread to wait for the end (the death) of the specified thread. The thread currently running cannot be the thread for which you are waiting. This option can only be used for a thread allocated using MthrAlloc() with M_THREAD. If the ThreadOrEventId parameter is set to a MIL system identifier, using this wait option results in an error. M_THREAD_WAIT Forces the current thread to wait for the completion of all functions that are not asynchronous grab commands, in the specified thread's command queue. If the ThreadOrEventId parameter was set to a MIL system identifier, the current thread waits for the completion of the current thread on the specified system. Combination value for M_THREAD_END_WAIT. You can add the following value to the above-mentioned value to set the time interval after which a thread is considered to be timed out. For threads Combination value Description M_THREAD_TIMEOUT( MIL_INT ThreadTimeOut ) Specifies the time interval after which a thread is considered to be timed out. Parameters ThreadTimeOut Sets the required timeout interval, in msecs. Set this parameter to the following: M_INFINITE Specifies an infinitely long timeout interval. 0 Same as M_INFINITE. Value &gt; 0 Sets the timeout interval to a user-defined value, in msecs. The following wait options are available for events. For specifying the wait option for events Value Description M_EVENT_SYNCHRONIZE Allows the current thread to continue with execution while forcing its corresponding on-board thread, located on the same board as the specified event, to wait for the specified event to be in an M_SIGNALED state. If the specified event is allocated on a board that supports asynchronous calls, MIL issues the wait command to that board and allows the current thread to proceed executing while its corresponding thread on that board is waiting for the specified event to change to a signaled state. Any subsequent calls issued on that on-board thread are executed only after the event is signaled. If the specified event is not allocated on a board that supports asynchronous calls, this value behaves like M_EVENT_WAIT in that it forces the current thread to wait until the event is signaled or timed out. MthrWait() set to M_EVENT_SYNCHRONIZE always returns M_UNKNOWN. If the event is of the type that is reset automatically (M_AUTO_RESET), the state of the event is reset to M_NOT_SIGNALED, after the wait operation. M_EVENT_WAIT Forces the current thread to wait for the specified event to be in an M_SIGNALED state or for the event to be timed out. The current thread will not proceed with execution until the specified event has changed to a signaled state or timed out. If the event is of the type that is reset automatically (M_AUTO_RESET), after the wait operation, the state of the event is reset to M_NOT_SIGNALED. Combination value for the values listed in For specifying the wait option for events. You can add the following value to the above-mentioned values to set the time interval after which an event is considered to be timed out. For events Combination value Description M_EVENT_TIMEOUT( MIL_INT EventTimeOut ) Specifies the time interval after which an event is considered to be timed out. Parameters EventTimeOut Sets the required timeout interval, in msecs. Set this parameter to the following: M_INFINITE Specifies an infinitely long timeout interval. 0 Same as M_INFINITE. Value &gt; 0 Sets the timeout interval to a user-defined value, in msecs. StatePtr Specifies the address of the variable in which to write the state of the specified thread or event. Since the MthrWait() function also returns the requested information, you can set this parameter to M_NULL. For writing the state of the specified thread or event Value Description M_SIGNALED Specifies that the specified thread has successfully completed or the state of the specified event has changed. This state applies for M_THREAD_END_WAIT, M_THREAD_WAIT, and M_EVENT_WAIT. M_TIMEOUT Specifies that the thread or event on which the current thread was waiting timed out. This state applies for M_THREAD_END_WAIT and M_EVENT_WAIT. M_UNKNOWN Specifies that the specified thread is set to M_EVENT_SYNCHRONIZE. Return value The returned value for M_THREAD_END_WAIT, M_THREAD_WAIT, and M_EVENT_WAIT is M_SIGNALED if the specified thread has successfully completed or if the state of the specified event has changed; it is M_TIMEOUT if the thread or event on which the current thread was waiting timed out. For M_EVENT_SYNCHRONIZE, the returned value is M_UNKNOWN. Compilation information Header Include mil.h. Library Use mil.lib. DLL Requires mil.dll. Syntax Description Parameters - ThreadOrEventId For specifying the thread context or event identifier - WaitOption For specifying the wait option for threads + For threads For specifying the wait option for events + For events - StatePtr For writing the state of the specified thread or event Return value Compilation information ",
      "wordCount": 966,
      "subEntries": []
    },
    {
      "id": "Reference_thr_MthrWaitMultiple",
      "version": null,
      "title": "MthrWaitMultiple",
      "subTitles": null,
      "location": "MIL Reference",
      "pageURL": "content\\Reference\\thr\\MthrWaitMultiple.htm",
      "text": " MthrWaitMultiple Synopsis Perform a wait operation on multiple MIL events. Syntax MIL_INT MthrWaitMultiple( const MIL_ID&nbsp;*EventArrayIdPtr, //in MIL_INT&nbsp;EventArraySize, //in MIL_INT64&nbsp;WaitOption, //in MIL_INT&nbsp;*StatePtr //out ) Description This function allows you to synchronize the execution of threads by forcing the current thread to wait for one of the MIL events identified in a user-supplied array to change state. To force the current thread to wait for all events identified in the user-supplied array to change state, add M_ALL_OBJECTS to M_EVENT_WAIT or M_EVENT_SYNCHRONIZE when setting the WaitOption parameter. Parameters Parameters EventArrayIdPtr Accepts the address of one of the following (see the Parameter associations section for specifics on which is expected): array of type MIL_ID [optionally, in C++: a reference to a constant std::vector&lt;MIL_ID&gt; ] (and a maximum array rank for C# of 1) Required array size:(EventArraySize) Specifies the address of a user-supplied array that contains the identifiers of the MIL events for which to wait. All MIL event identifiers must be allocated, using MthrAlloc(), on the same system. EventArraySize Specifies the number of events in the user-supplied array. When using a standard vector (std::vector) overload function in C++, you can pass M_DEFAULT to this parameter and MIL will automatically determine the size based on the number of items in the vector passed to the EventArrayIdPtr parameter. WaitOption Specifies the wait option. See the Parameter associations section for possible values that can be specified. StatePtr Specifies the address in which to write the returned value. Since the MthrWaitMultiple() function also returns the requested information, you can set this parameter to M_NULL. See the Parameter associations section for possible values that can be returned. Parameter associations The table below lists possible values for the WaitOption parameter and possible values returned to the StatePtr parameter. For specifying the wait option For specifying the wait option WaitOption Description StatePtr - Possible values returned M_EVENT_SYNCHRONIZE Allows the current thread to continue executing while forcing its corresponding on-board thread, located on the same board as the events identified in the user-supplied array, to wait for one of the events to be in an M_SIGNALED state or for a time out to occur. If the events are allocated on a board that supports asynchronous calls, MIL issues the wait command to that board and allows the current thread to continue executing. Its corresponding thread, on that board, waits for an event identified in the array to change to a signaled state. Any subsequent calls issued on that on-board thread are executed only after an event is signaled. If the specified event is not allocated on a board that supports asynchronous calls, this value behaves like M_EVENT_WAIT in that it forces the current thread to wait until the event is signaled or timed out. MthrWaitMultiple() set to M_EVENT_SYNCHRONIZE always returns M_UNKNOWN. If the event that changes state is of the type that is reset automatically (M_AUTO_RESET), the state of the event is reset to M_NOT_SIGNALED, after the wait operation. M_UNKNOWN Specifies that WaitOption parameter is set to M_EVENT_SYNCHRONIZE. M_EVENT_WAIT Forces the current thread to wait for an event, identified in the user-supplier array, to change to the M_SIGNALED state or for the events to timeout. The current thread will not continue until one of the specified events has changed to a signaled state or timed out. If the event that changed state is of the type that is reset automatically (M_AUTO_RESET), after the wait operation, the state of the event is reset to M_NOT_SIGNALED. M_TIMEOUT Specifies that none of the events in the array have changed state before the time out interval is reached. Value Specifies the index of the event that changed to the M_SIGNALED state. Combination value for the values listed in For specifying the wait option. You can add the following value to the above-mentioned values to specify that the current thread must wait for all events to change state or for a timeout to occur. For specifying that the thread must wait for all the events to change state WaitOption Description StatePtr - Possible values returned M_ALL_OBJECTS Waits for all the events identified in the user-supplied array to be in a M_SIGNALED state or for the events to time out. M_SIGNALED Specifies that all the events have changed state. M_TIMEOUT Specifies that the time out interval has been reached before all the events in the array have changed state. M_UNKNOWN Specifies that WaitOption parameter is set to M_EVENT_SYNCHRONIZE. Combination value for the values listed in For specifying the wait option. You can add the following value to the above-mentioned values to set the time interval after which an event is considered to be timed out. For events Combination value Description M_EVENT_TIMEOUT( MIL_INT EventTimeOut ) Specifies the time interval after which an event is considered to be timed out. Parameters EventTimeOut Sets the required timeout interval, in msecs. Set this parameter to the following: M_INFINITE Specifies an infinitely long timeout interval. 0 Same as M_INFINITE. Value &gt; 0 Sets the timeout interval to a user-defined value, in msecs. Return value The returned value for M_EVENT_WAIT is the index of the event that changed to the M_SIGNALED state, or M_TIMEOUT if none of the events in the array changed state before the time out interval is reached. For M_EVENT_WAIT + M_ALL_OBJECTS, the returned value is M_SIGNALED if all the events specified in the array changed state, or M_TIMEOUT if the time out interval is reached before all the events in the array have changed state. For M_EVENT_SYNCHRONIZE, the returned value is M_UNKNOWN. Compilation information Header Include mil.h. Library Use mil.lib. DLL Requires mil.dll. Syntax Description Parameters - EventArrayIdPtr - EventArraySize - WaitOption - StatePtr Parameter Associations For specifying the wait option + For specifying that the thread must wait for all the events to change state + For events Return value Compilation information ",
      "wordCount": 965,
      "subEntries": []
    }
  ]
}]