[{
  "id": "Reference_gen",
  "version": "2024020714",
  "title": "gen",
  "subTitles": null,
  "location": "MIL Reference",
  "pageURL": "content\\Reference\\gen\\ModuleInformation.htm",
  "text": " Mgen functions Synopsis The functions prefixed with Mgen make up the Data Generation module. The basic Data Generation module provides a limited set of data generation tools that can be used to automatically generate predefined data in a data buffer (for example, generating ramp in a LUT buffer). Functions MgenLutFunction MgenLutRamp MgenRamp MgenWarpParameter ",
  "wordCount": 55,
  "subEntries": [
    {
      "id": "Reference_gen_MgenLutFunction",
      "version": null,
      "title": "MgenLutFunction",
      "subTitles": null,
      "location": "MIL Reference",
      "pageURL": "content\\Reference\\gen\\MgenLutFunction.htm",
      "text": " MgenLutFunction Synopsis Generate data into a LUT buffer using a specified standard mathematical function, or a specified colormap (pseudo-color palette). Syntax void MgenLutFunction( MIL_ID&nbsp;LutBufId, //in MIL_INT&nbsp;Func, //in MIL_DOUBLE&nbsp;a, //in MIL_DOUBLE&nbsp;b, //in MIL_DOUBLE&nbsp;c, //in MIL_INT&nbsp;StartIndex, //in MIL_DOUBLE&nbsp;StartXValue, //in MIL_INT&nbsp;EndIndex //in ) Description This function generates a value for each LUT index according to the specified mathematical function or colormap (pseudo-color palette). When generating values based on a mathematical function, you can limit generation to a specified range of LUT indices (StartIndex to EndIndex inclusive). The supported mathematical functions take a single variable (x). The StartXValue parameter specifies the initial x value. The remaining entries of the index range are generated by incrementing the value of x by 1 for each index. All results are converted to integer by truncation, except when using a floating-point LUT buffer. Note, if the given parameters cause an overflow or underflow, indeterminate results will be written in the destination LUT. When generating a colormap LUT, you can specify a replacement value for the color assigned to index 0 of the LUT and for the color assigned to the highest index of the LUT (M_FIRST_GRAY and M_LAST_GRAY, respectively). This helps to highlight invalid pixels when working with images produced from cameras or 3D sensors that set such pixels to 0 or to the highest possible intensity value. You can also specify the number of times the basic colormap pattern is to be repeated (c parameter). This is useful to visualize small local intensity variations in depth maps or 3D data. It is best to use a colormap that has the same color on both ends (cyclic) for a seamless transition between the repeating colormap pattern (for example, M_COLORMAP_WHEEL). Parameters Parameters LutBufId Specifies the identifier of the LUT in which to generate values. This parameter must be given a valid LUT buffer identifier, allocated using MbufAlloc1d() or MbufAllocColor() with M_LUT. If the LUT is a multi-band LUT (allocated with MbufAllocColor()), the same data is written to all bands, except when filling the LUT buffer with a colormap. For a LUT buffer allocated with MbufAllocColor(), the buffer height (SizeY parameter) must have been set to a value of 1. When filling the LUT buffer with a colormap, the buffer must be a 3-band, unsigned or floating-point LUT buffer. Func Specifies the mathematical function or colormap to use for calculations. To fill the LUT using a mathematical function, set this parameter to one of the following: For specifying the mathematical function Value Description M_COS Uses the following formula for calculation: a cos (b x) + c . x is considered to be in degrees. M_EXP Uses the following formula for calculation: a bx + c . M_LOG Uses the following formula for calculation: a log b (x) + c . M_POWER Uses the following formula for calculation: a x b + c . M_QUAD Uses the following formula for calculation: a x 2 + b x + c . M_SIGMOID Uses the following formula for calculation: b + ((c - b) / (1 + e- a x )) . Note that b and c are, respectively, the minimum and maximum possible values of the destination LUT buffer. If a is positive, the sigmoidal curve increases from b to c. If a is negative, the sigmoidal curve decreases from c to b. If b and c are not equal, a must not be 0. Note that you can set the StartXValue parameter such that the curve shifts left or right (that is, in the negative or positive X directions, respectively). M_SIN Uses the following formula for calculation: a sin (b x) + c . x is considered to be in degrees. M_TAN Uses the following formula for calculation: a tan (b x) + c . x is considered to be in degrees. M_TONE_MAPPING Uses the following formula for calculation. This mathematical function generates a LUT mapping that distributes pixel intensity values within the specified range. MaxDstVal and MinDstVal represent the highest and lowest possible values of the destination LUT buffer. For example, for an 8-bit buffer, the maximum and minimum values are 255 and 0, respectively. For a floating-point LUT buffer, the maximum and minimum values are 1.0 and 0.0, respectively. a is the highest source value that maps to 0 in the destination LUT. This removes unnecessary intensity levels at the near-zero end (below the a threshold), and allows more intensity distribution elsewhere in the LUT. b is the lowest source value that maps to the highest value in the destination LUT. This removes unnecessary intensity levels at the saturated end (above the b threshold), and allows more intensity distribution elsewhere in the LUT. c is the tone mapping coefficient, which affects the intensity distribution in the destination LUT buffer. In terms of pixel values, a higher coefficient (closer to 1.0) gives a broader intensity range to bright areas, which improves bright area detail and lowers the overall brightness of the final image. Conversely, a lower coefficient (closer to 0.0), gives a broader intensity range to dark areas, improving dark area detail and increasing the overall brightness of the final image. To use this mathematical function, you must set the StartIndex, StartXValue, and EndIndex parameters to M_DEFAULT. Note that you can use the M_TONE_MAPPING formula to map a 16-bit image to an 8-bit image. To fill the LUT with a colormap (pseudo-color palette), set this parameter to one of the following: For specifying a colormap Value Description M_COLORMAP_DISTINCT_256 Fills the LUT buffer with a distinct colormap. This colormap is designed to maximize the visual difference between consecutive colors. This colormap can be useful for colorizing images containing discrete objects, such as labeled blobs. Note that this colormap is periodic, meaning that if the given LUT buffer has more than 256 entries, the remaining entries will be filled starting from the first color in the colormap. M_COLORMAP_GRAYSCALE Fills the LUT buffer with a grayscale colormap. This colormap transitions from black to white as the indices increase. To transition from white to black, add the M_FLIP combination value. M_COLORMAP_HOT Fills the LUT buffer with a hot colormap. This colormap transitions from black, to red, to yellow, and then, to white along the RGB cube as the indices increase. This colormap can be useful for displaying infrared images. M_COLORMAP_HUE Fills the LUT buffer with a hue colormap. This colormap is cyclic and transitions from red, to yellow, to green, to cyan, to blue, to magenta, and then, to red along the edge of the hue circle as the indices increase. This colormap is suitable to be repeated. This colormap is useful for displaying the hue component of an HSL image. M_COLORMAP_JET Fills the LUT buffer with a jet colormap. This colormap transitions from dark blue, to blue, to cyan, to yellow, to red, and then, to dark red along the RGB cube as the indices increase. This colormap can be useful for displaying 3D elevation maps and thermal imaging. M_COLORMAP_SPECTRUM Fills the LUT buffer with a spectrum colormap. This colormap transitions from red, to yellow, to green, to blue, and then, to violet along the RGB cube as the indices increase. This colormap is a representation of the visual spectrum according to wavelengths. It can also be useful for displaying 3D elevation maps and thermal imaging. M_COLORMAP_TURBO Fills the LUT buffer with a turbo colormap. This colormap is an improved version of the jet colormap, with smoother color transitions. It transitions from dark blue, to blue, to cyan, to yellow, to red, and then, to dark red along the RGB cube as the indices increase. This colormap can be useful for displaying 3D elevation maps and thermal imaging. M_COLORMAP_WHEEL Fills the LUT buffer with a colorwheel colormap. This colormap is cyclic and transitions from blue, to magenta, to yellow, to green and to blue again as the indices increase. This colormap is designed to be perceptually uniform (a given change in data is designed to be visually perceived as an equal change in color). This colormap is suitable to be repeated. This colormap can be useful for displaying 3D elevation maps. Combination values for the values listed in For specifying a colormap. You can add one or more of the following values to the above-mentioned values to specify a replacement value for the colormap's first and/or last color value, or to reverse the colors in the colormap. For specifying to replace the colormap's first and/or last color value, or to reverse the colors Combination value Description M_FIRST_GRAY Specifies to replace the value for the color assigned to index 0 of the LUT with the value specified with the a parameter. M_FLIP Specifies to reverse the sequence of colors in the colormap. M_LAST_GRAY Specifies to replace the value for the color assigned to the highest index of the LUT with the value specified with the b parameter. a Specifies the constant a for the specified mathematical function, or specifies a replacement value for the color assigned to index 0 of the LUT, if filling the LUT with a colormap. For specifying the first constant or color replacement value Value Description M_DEFAULT Specifies that this parameter is not used. This setting is only applicable when filling the LUT with a colormap, and M_FIRST_GRAY is not specified. M_RGB888( MIL_INT Red, MIL_INT Green, MIL_INT Blue ) Specifies an RGB color replacement value. Each value (red, green, or blue) must not exceed 8 bits. This setting is suitable only if the image to which the LUT is applied is stored in an unsigned, 3-band image buffer, where the data depth per band is 8-bit (MIL_UINT8). Parameters Red Specifies the red component, as a value between 0 and 255. Green Specifies the green component, as a value between 0 and 255. Blue Specifies the blue component, as a value between 0 and 255. Value Specifies the first constant's value, or specifies the color replacement value. b Specifies the constant b for the specified mathematical function, or specifies a replacement value for the color assigned to the highest index of the LUT, if filling the LUT with a colormap. For specifying the second constant or color replacement value Value Description M_DEFAULT Specifies that this parameter is not used. This setting is only applicable when filling the LUT with a colormap, and M_LAST_GRAY is not specified. M_RGB888( MIL_INT Red, MIL_INT Green, MIL_INT Blue ) Specifies an RGB color replacement value. Each value (red, green, or blue) must not exceed 8 bits. This setting is suitable only if the image to which the LUT is applied is stored in an unsigned, 3-band image buffer, where the data depth per band is 8-bit (MIL_UINT8). Parameters Red Specifies the red component, as a value between 0 and 255. Green Specifies the green component, as a value between 0 and 255. Blue Specifies the blue component, as a value between 0 and 255. Value Specifies the second constant's value, or specifies the color replacement value. c Specifies the constant c for the specified mathematical function, or specifies a value for the number of times the basic pattern is to be repeated, if filling the LUT with a colormap. For specifying the third constant or the value for the number of times the basic pattern is to be repeated Value Description M_DEFAULT Specifies the default value; the default value is 1 and the colormap will not repeat. This setting is only applicable when filling the LUT with a colormap. Value Specifies the third constant's value, or specifies the value for the number of times the basic pattern is to be repeated. If filling the LUT with a M_COLORMAP_DISTINCT_256 colormap, the value must be set to M_DEFAULT. If filling the LUT with a colormap other than M_COLORMAP_DISTINCT_256, the value must be set to a number greater than 0. For values greater than 1, it is best to use a cyclic colormap (for example, M_COLORMAP_WHEEL). Example LUTs filled with M_COLORMAP_WHEEL colormap and varying number of basic pattern repeat values. Value = 1 (M_DEFAULT) ? Value = 0.5 ? Value = 3.0 ? Value = 6.2 ? StartIndex Specifies the first LUT index entry for which to generate values. If filling the LUT with a colormap, this parameter must be set to M_DEFAULT. If filling the LUT using the M_TONE_MAPPING mathematical function, this parameter must be set to M_DEFAULT. For specifying the first index Value Description M_DEFAULT Specifies the first index entry of the LUT (index 0). 0 &lt; = Value &lt; LUT size Specifies the first index entry to affect. StartXValue Specifies the initial value of x in the mathematical function. If filling the LUT with a colormap, this parameter must be set to M_DEFAULT. If filling the LUT using the M_TONE_MAPPING mathematical function, this parameter must be set to M_DEFAULT. For specifying the initial x value Value Description M_DEFAULT Specifies the default value; the default value is 0.0. If filling the LUT with a colormap, specifies to ignore the initial x value. Value Specifies the first x value to use during calculation. EndIndex Specifies the last LUT index entry for which to generate values. If filling the LUT with a colormap, this parameter must be set to M_DEFAULT. If filling the LUT using the M_TONE_MAPPING mathematical function, this parameter must be set to M_DEFAULT. For specifying the last index Value Description M_DEFAULT Specifies the last index entry of the LUT. StartIndex &lt;= Value &lt; LUT size Specifies the last index entry to affect. Compilation information Header Include mil.h. Library Use mil.lib. DLL Requires mil.dll. Syntax Description Parameters - LutBufId - Func For specifying the mathematical function For specifying a colormap + For specifying to replace the colormap's first and/or last color value, or to reverse the colors - a For specifying the first constant or color replacement value - b For specifying the second constant or color replacement value - c For specifying the third constant or the value for the number of times the basic pattern is to be repeated - StartIndex For specifying the first index - StartXValue For specifying the initial x value - EndIndex For specifying the last index Compilation information ",
      "wordCount": 2350,
      "subEntries": []
    },
    {
      "id": "Reference_gen_MgenLutRamp",
      "version": null,
      "title": "MgenLutRamp",
      "subTitles": null,
      "location": "MIL Reference",
      "pageURL": "content\\Reference\\gen\\MgenLutRamp.htm",
      "text": " MgenLutRamp Synopsis Generate ramp data into a LUT buffer. Syntax void MgenLutRamp( MIL_ID&nbsp;LutBufId, //in MIL_INT&nbsp;StartIndex, //in MIL_DOUBLE&nbsp;StartValue, //in MIL_INT&nbsp;EndIndex, //in MIL_DOUBLE&nbsp;EndValue //in ) Description This function generates a ramp, inverse ramp, or a constant in the specified LUT buffer region (StartIndex to EndIndex). The increment between LUT entries is the difference between StartValue and EndValue, divided by (the number of entries - 1). If you need to generate a more complex LUT, use MgenLutFunction() or generate the values with your Host system and load them into a MIL LUT buffer, using MbufPut1d() or MbufPutColor(). Parameters Parameters LutBufId Specifies the identifier of the LUT in which to generate values. This parameter must be given a valid LUT buffer identifier. Allocate a LUT buffer, using MbufAlloc1d() or MbufAllocColor(). StartIndex Specifies the first LUT index for which to generate a value. StartIndex must be less than or equal to EndIndex. StartValue Specifies the starting value from which the increment is calculated; that is, the first LUT entry. EndIndex Specifies the last LUT index for which to generate a value. EndIndex must be greater than or equal to StartIndex. EndValue Specifies the ending value from which the increment is calculated; that is, the last LUT entry. If both StartValue and EndValue are the same, the entire LUT range is filled with this value. If EndValue is smaller than StartValue, an inverse ramp is generated. This parameter accepts only an integer value, except when using a floating-point LUT buffer. Compilation information Header Include mil.h. Library Use mil.lib. DLL Requires mil.dll. Syntax Description Parameters - LutBufId - StartIndex - StartValue - EndIndex - EndValue Compilation information ",
      "wordCount": 272,
      "subEntries": []
    },
    {
      "id": "Reference_gen_MgenRamp",
      "version": null,
      "title": "MgenRamp",
      "subTitles": null,
      "location": "MIL Reference",
      "pageURL": "content\\Reference\\gen\\MgenRamp.htm",
      "text": " MgenRamp Synopsis Generate 2D ramp data into a buffer. Syntax void MgenRamp( MIL_ID&nbsp;BufId, //in MIL_DOUBLE&nbsp;ScaleX, //in MIL_DOUBLE&nbsp;ScaleY, //in MIL_DOUBLE&nbsp;Offset, //in MIL_INT64&nbsp;ControlFlag //in ) Description This function uses the specified scale factors and offset to generate a 2D ramp (linearly increasing/decreasing data in both X and Y) in the specified buffer. You can specify any MIL buffer, such as an array, image, kernel, LUT, or structuring element buffer. This function generates the ramp data using the following formula: BufId[x,y] = ScaleX * x + ScaleY * y + Offset. This function can be useful, for example, to simulate non-uniform lighting in an image (non-uniform lighting is generally approximated by an intensity ramp that is added to the image), or to generate the pixel coordinates of all the pixels of an image. Parameters Parameters BufId Specifies the identifier of the buffer in which to generate values. The buffer must have been previously allocated on the system using MbufAlloc...() with M_ARRAY, M_IMAGE, M_KERNEL, M_LUT, or M_STRUCT_ELEMENT. If you specify an image buffer, it must not have a region of interest (ROI) associated with it. Using an image buffer with an ROI will cause an error. ScaleX Specifies the factor by which to scale in X. ScaleY Specifies the factor by which to scale in Y. Offset Specifies the offset. This corresponds to the value placed in the first location of the buffer. ControlFlag Reserved for future expansion and must be set to M_DEFAULT. Compilation information Header Include mil.h. Library Use mil.lib. DLL Requires mil.dll. Syntax Description Parameters - BufId - ScaleX - ScaleY - Offset - ControlFlag Compilation information ",
      "wordCount": 268,
      "subEntries": []
    },
    {
      "id": "Reference_gen_MgenWarpParameter",
      "version": null,
      "title": "MgenWarpParameter",
      "subTitles": null,
      "location": "MIL Reference",
      "pageURL": "content\\Reference\\gen\\MgenWarpParameter.htm",
      "text": " MgenWarpParameter Synopsis Generate coefficients or LUTs used to warp an image. Syntax void MgenWarpParameter( MIL_ID&nbsp;SrcArrayBufId, //in MIL_ID&nbsp;DstXLutOrArrayBufId, //in MIL_ID&nbsp;DstYLutBufId, //in MIL_INT&nbsp;OperationMode, //in MIL_INT&nbsp;Transform, //in MIL_DOUBLE&nbsp;Val1, //in MIL_DOUBLE&nbsp;Val2 //in ) Description This function generates coefficients or LUTs to be used by MimWarp() to perform first-order polynomial warpings or perspective polynomial warpings. Specifically, this function can generate: Coefficients for a first-order polynomial warping (M_WARP_POLYNOMIAL). Coefficients or LUTs for a perspective polynomial warping that maps an arbitrary quadrilateral onto a rectangle (M_WARP_4_CORNER) or that maps a rectangle onto an arbitrary quadrilateral (M_WARP_4_CORNER_REVERSE). LUTs, based on the input of a matrix of coefficients, for a first-order polynomial warping or for a perspective polynomial warping (M_WARP_LUT). Note that when generating LUTs for a M_WARP_4_CORNER or a M_WARP_4_CORNER_REVERSE perspective polynomial warping, the coefficients that were internally generated and used cannot be retrieved. To generate LUTs while saving the coefficients, you must call MgenWarpParameter() twice: once to generate the coefficients needed to produce the LUTs, and the second time to actually generate the LUTs with M_WARP_LUT. For a first-order polynomial warping, this function can generate coefficients or LUTs for a rotation, a scaling, a shearing, or a translation. To combine coefficients (for example, to generate coefficients that will perform both a rotation and a translation), you need to make separate calls to this function, using the previous output buffer of type M_ARRAY as your current input buffer. If required, after the appropriate coefficients are generated, you can pass the coefficient buffer to MgenWarpParameter() with M_WARP_LUT to generate the corresponding LUTs. Coefficients are calculated such that each pixel position of the destination buffer, (x d,y d) is associated with a specific point in the source buffer, (x s,y s), according to the following equation: Where xs and ys are defined as follows: Note that in the case of a first-order polynomial warping, the c0, c1, c2 coefficients are 0, 0, and 1, respectively. The equation then reduces to: Parameters Parameters SrcArrayBufId Specifies the input buffer from which to generate coefficients or LUT entries. If an input buffer is not required to perform the coefficient generation, set this parameter to M_NULL. See the Parameter associations section for possible values that can be specified. DstXLutOrArrayBufId Specifies the buffer in which to place generated coefficients or X-LUT entries. See the Parameter associations section for possible values that can be specified. DstYLutBufId Specifies the buffer in which to place Y-LUT entries. If you are not generating LUTs, set this parameter to M_NULL. See the Parameter associations section for possible values that can be specified. OperationMode Specifies the mode of operation. See the Parameter associations section for possible values that can be specified. Transform Specifies the type of first-order polynomial warping for which to generate coefficients. If you are not generating coefficients for a first-order polynomial warping (M_WARP_POLYNOMIAL), set the this parameter to M_DEFAULT. For specifying the type of first-order polynomial warping Value Description M_ROTATE Generates coefficients for a counter-clockwise rotation around (0,0) by Val1 °. M_SCALE Generates coefficients for an image scaling, by a factor of Val1 in the X-direction and by a factor of Val2 in the Y-direction. M_SHEAR_X Generates coefficients or for a shearing in the X-direction, by a factor of Val1. M_SHEAR_Y Generates coefficients for a shearing in the Y-direction, by a factor of Val1. M_TRANSLATE Generates coefficients for a translation by Val1 pixels in the X-direction and by Val2 pixels in the Y-direction. Val1 Specifies the first transform constant. If this parameter is not being used, set it to M_NULL. Val2 Specifies the second transform constant. If this parameter is not being used, set it to M_NULL. Parameter associations The table below lists possible values for the SrcArrayBufId, DstXLutOrArrayBufId, DstYLutBufId, and OperationMode parameters. For selecting the operation mode For selecting the operation mode OperationMode Description SrcArrayBufId DstXLutOrArrayBufId DstYLutBufId M_WARP_4_CORNER Generates coefficients or LUT values for a perspective polynomial warping which, when passed to MimWarp(), maps an arbitrary quadrilateral onto a rectangle. SrcArrayBufId Specifies the input buffer which contains the X and Y positions of the four corners of the quadrilateral and the top-left and bottom-right corners of the rectangle. The buffer must be a one-dimensional floating-point buffer allocated with the M_ARRAY attribute, containing 12 entries. The buffer must contain 12 entries; each entry corresponds to one of the following points. Entry and its corresponding point Entry and its corresponding point entry [0] = X1 entry [6] = X4 entry [1] = Y1 entry [7] = Y4 entry [2] = X2 entry [8] = X1' entry [3] = Y2 entry [9] = Y1' entry [4] = X3 entry [10] = X3' entry [5] = Y3 entry [11] = Y3' DstXLutOrArrayBufId Specifies the buffer in which to place the generated coefficients or X-component LUT entries. MIL array buffer identifier Specifies the MIL array buffer identifier. The buffer must be a 3x3 floating-point buffer allocated with an M_ARRAY attribute. MIL LUT buffer identifier Specifies the MIL LUT buffer identifier. The buffer must be a signed 16- or 32-bit integer buffer or a 32-bit floating-point buffer with an M_LUT attribute and the same X-size as the destination image buffer that will be passed to MimWarp(). DstYLutBufId Specifies the buffer in which to place the Y-component LUT entries. Note that if you want to generate coefficients and not LUTs, this parameter must be set to M_NULL. M_NULL Specifies that the coefficients will be generated. MIL LUT buffer identifier Specifies the MIL LUT buffer identifier. The buffer must be a signed 16- or 32-bit integer buffer or a 32-bit floating-point buffer, which has an M_LUT attribute and the same Y-size as the destination image buffer that will be passed to MimWarp(). M_WARP_4_CORNER_REVERSE Generates coefficients or LUT values for a perspective polynomial warping which, when passed to MimWarp(), maps a rectangle onto an arbitrary quadrilateral. SrcArrayBufId Specifies the input buffer which contains the X and Y positions of the four corners of the quadrilateral and the top-left and bottom-right corners of the rectangle. The buffer must be a one dimensional floating-point buffer allocated with the M_ARRAY attribute, containing 12 entries. The buffer must contain 12 entries; each entry corresponds to one of the following points. Entry and its corresponding point Entry and its corresponding point entry [0] = X1 entry [6] = X4 entry [1] = Y1 entry [7] = Y4 entry [2] = X2 entry [8] = X1' entry [3] = Y2 entry [9] = Y1' entry [4] = X3 entry [10] = X3' entry [5] = Y3 entry [11] = Y3' DstXLutOrArrayBufId Specifies the buffer in which to place the generated coefficients or X-component LUT entries. MIL array buffer identifier Specifies the MIL array buffer identifier. The buffer must be a 3x3 floating-point buffer allocated with an M_ARRAY attribute. MIL LUT buffer identifier Specifies the MIL LUT buffer identifier. The buffer must be a signed 16- or 32-bit integer buffer or a 32-bit floating-point buffer with an M_LUT attribute and the same X-size as the destination image buffer that will be passed to MimWarp(). DstYLutBufId Specifies the buffer in which to place the Y-component LUT entries. Note that If you wish to generate coefficients and not LUTs, this parameter must be set to M_NULL. M_NULL Specifies that the coefficients will be generated. MIL LUT buffer identifier Specifies a signed 16- or 32-bit integer buffer or a 32-bit floating-point buffer, which has an M_LUT attribute and the same Y-size as the destination image buffer that will be passed to MimWarp(). M_WARP_LUT Generates LUTs that can be passed to MimWarp() to perform a warping that is equivalent to the warping that would be performed if the coefficients specified in the SrcArrayBufId parameter were used instead. SrcArrayBufId Specifies the input buffer which contains the coefficients of the polynomial equations used to perform the warping. The buffer must be a 3x3 floating-point buffer with an M_ARRAY attribute. The first row specifies the a n coefficients, the second row specifies the b n coefficients, and the third row specifies the c n coefficients. DstXLutOrArrayBufId Specifies a signed 16- or 32-bit integer buffer or a 32-bit floating-point buffer, which has an M_LUT attribute and the same X-size as the destination image buffer that will be passed to MimWarp(). DstYLutBufId Specifies a signed 16- or 32-bit integer buffer or a 32-bit floating-point buffer, which has an M_LUT attribute and the same Y-size as the destination image buffer that will be passed to MimWarp(). M_WARP_POLYNOMIAL Generates coefficients that can be passed to MimWarp() to perform a first-order polynomial warping. SrcArrayBufId Specifies the input buffer containing the coefficients generated by a previous call to MgenWarpParameter(). The values generated by any subsequent call to this function can be combined with the values contained in this buffer. The resulting coefficients can be passed to MimWarp() to perform a composite warp (for example, a rotation and translation). Note that if this is your first call to MgenWarpParameter() this parameter must be set to M_NULL. M_NULL Specifies that this is the first call to MgenWarpParameter(). MIL array buffer identifier Specifies a MIL array buffer identifier. The buffer must be a 3x3 floating-point buffer with an M_ARRAY attribute. DstXLutOrArrayBufId Specifies the identifier of a 3x3 floating-point buffer with an M_ARRAY attribute in which to place the generated coefficients. The resulting coefficients can be passed to MimWarp() to perform a composite warp (for example, a rotation and translation). DstYLutBufId Specifies to ignore this parameter. This parameter must be set to M_NULL when performing an M_WARP_POLYNOMIAL operation. Combination value for M_WARP_4_CORNER , M_WARP_4_CORNER_REVERSE , M_WARP_LUT. You can add the following value to the above-mentioned values to specify the number of fractional bits for the source address. For the output LUT buffers Combination value Description M_FIXED_POINT + n Specifies the number of fractional bits for the source address (x s , y s). The default value is 0. Note that when using this combination constant with M_WARP_4_CORNER or M_WARP_4_CORNER_REVERSE, the destination buffers (DstXLutOrArrayBufId and DstYLutBufId) must be LUT buffers (similar to when using M_WARP_LUT). Compilation information Header Include mil.h. Library Use mil.lib. DLL Requires mil.dll. Syntax Description Parameters - SrcArrayBufId - DstXLutOrArrayBufId - DstYLutBufId - OperationMode - Transform For specifying the type of first-order polynomial warping - Val1 - Val2 Parameter Associations For selecting the operation mode + For the output LUT buffers Compilation information M_FIXED_POINT + n ",
      "wordCount": 1710,
      "subEntries": []
    }
  ]
}]