[{
  "id": "Reference_dlocr",
  "version": "2024020714",
  "title": "dlocr",
  "subTitles": null,
  "location": "MIL Reference",
  "pageURL": "content\\Reference\\dlocr\\ModuleInformation.htm",
  "text": " Mdlocr functions Synopsis The functions prefixed with Mdlocr make up the Deep Learning OCR module. The Deep Learning OCR module performs optical character recognition on text using deep learning based technologies. Unlike other string reading modules, the Deep Learning OCR module does not require a font definition. By default, the Deep Learning OCR module will read all text in frame. String models and constraints can be set to narrow the results. Functions MdlocrAlloc MdlocrAllocResult MdlocrControl MdlocrControlConstraint MdlocrControlStringModel MdlocrCopy MdlocrDefineModel MdlocrDefineModelFromResult MdlocrDraw MdlocrFree MdlocrGetResult MdlocrGetStringIndex MdlocrInquire MdlocrInquireConstraint MdlocrInquireStringModel MdlocrPreprocess MdlocrRead MdlocrRestore MdlocrSave MdlocrStream ",
  "wordCount": 94,
  "subEntries": [
    {
      "id": "Reference_dlocr_MdlocrAlloc",
      "version": null,
      "title": "MdlocrAlloc",
      "subTitles": null,
      "location": "MIL Reference",
      "pageURL": "content\\Reference\\dlocr\\MdlocrAlloc.htm",
      "text": " MdlocrAlloc Synopsis Allocate a Deep Learning OCR context. Syntax MIL_ID MdlocrAlloc( MIL_ID&nbsp;SysId, //in MIL_INT64&nbsp;ContextType, //in MIL_INT64&nbsp;ControlFlag, //in MIL_ID&nbsp;*ContextIdPtr //out ) Description This function allocates a Deep Learning OCR context on the specified system. A Deep Learning OCR context contains information required to perform an MdlocrRead() operation, which allows you to read strings of text without defining a font. By default, a Deep Learning OCR context is set to read all text in an image within the default character height bounds. If you want to restrict the string that is found and read, add a string model; string models are optional. MdlocrDefineModelFromResult() allows you to define the string model so that attributes are automatically set from a resulting string found using MdlocrRead(). If you only want to restrict the number of characters in the string, you can use MdlocrDefineModel(). Regardless of how you add a model, you can always constrain the characters that appear at certain positions using MdlocrControlConstraint() and adjust general string model settings, such as, character height and number of characters using MdlocrControlStringModel(). A Deep Learning OCR context internally handles characters in Unicode, although you can program in both a Unicode or ASCII environment. When allocating the context, you should specify whether an algorithm that favors robustness or speed should be used, depending on the complexity of your images and your processing power restrictions. Global settings and string model-specific settings and positional constraints are all held in a Deep Learning OCR context; use MdlocrControl(), MdlocrControlConstraint(), and MdlocrControlStringModel() to set these up, respectively. When the Deep Learning OCR context is no longer required, release it using MdlocrFree() unless M_UNIQUE_ID was specified during allocation; if M_UNIQUE_ID was specified, the smart identifier manages the Deep Learning OCR context's lifetime and you must not manually free it. Parameters Parameters SysId Specifies the identifier of the system on which to allocate the Deep Learning OCR context. Set this parameter to one of the values below: For specifying the system identifier Value Description M_DEFAULT_HOST Specifies the default Host system of the current MIL application. MIL system identifier Specifies a valid system identifier, previously allocated using MsysAlloc(). ContextType Specifies the type of context to allocate. Set this parameter to the value below: For specifying the type of context to allocate Value Description M_OCR_NET1_BALANCED_V1 Specifies to allocate a Deep Learning OCR context with a balanced deep learning model based on the NET1 architecture. The performance and accuracy of this context falls between M_OCR_NET1_FAST_V1 and M_OCR_NET1_EXTENDED_V1. This context should be used on average complexity images and when processing power restrictions are not too high. M_OCR_NET1_EXTENDED_V1 Specifies to allocate a Deep Learning OCR context with the most robust deep learning model based on the NET1 architecture. Maximum accuracy over M_OCR_NET1_FAST_V1 and M_OCR_NET1_BALANCED_V1 comes at the cost of speed. This context should be used on high complexity images when processing power restrictions are low. M_OCR_NET1_FAST_V1 Specifies to allocate a Deep Learning OCR context with the fastest deep learning model based on the NET1 architecture. Faster performance over M_OCR_NET1_EXTENDED_V1 and M_OCR_NET1_BALANCED_V1 comes at the cost of lower accuracy. This context should be used on simpler images and when processing power is limited. ControlFlag Reserved for future expansion and must be set to M_DEFAULT. ContextIdPtr Specifies the address of the variable in which to write the Deep Learning OCR context identifier or specifies the data type that the function should use to return the Deep Learning OCR context identifier. For retrieving the identifier or specifying how to return it Value Description M_NULL Specifies that you will use this function's return value to obtain the identifier of the allocated Deep Learning OCR context ; in this case, a standard MIL identifier of type MIL_ID is returned. M_UNIQUE_ID Specifies that you will use this function's return value to obtain the identifier of the allocated Deep Learning OCR context ; in this case, a MIL smart identifier of type MIL_UNIQUE_DLOCR_ID is returned instead of a standard MIL identifier. This setting is only available when using C++11 (or later). A MIL smart identifier manages the lifespan of the MIL object it owns (similar to a std::unique_ptr). Note, you can use a MIL smart identifier as though it were a standard MIL identifier, except that you cannot use it to manually free the Deep Learning OCR context (it is freed automatically). For more information, see the MIL smart identifiers subsection of the MIL custom data types, void pointers, extensions, and portability functions section of Chapter 2: Building an application. Address in which to write the identifier Specifies the address of a MIL_ID in which to write the identifier of the allocated Deep Learning OCR context. If allocation fails, M_NULL is written as the identifier. Return value The returned value is the Deep Learning OCR context identifier either as a standard identifier (MIL_ID) or a smart identifier (MIL_UNIQUE_DLOCR_ID). If allocation fails, M_NULL is returned (or nullptr if M_UNIQUE_ID was specified). Compilation information Header Include mil.h. Library Use mil.lib; mildlocr.lib. DLL Requires mil.dll; mildlocr.dll. Syntax Description Parameters - SysId For specifying the system identifier - ContextType For specifying the type of context to allocate - ControlFlag - ContextIdPtr For retrieving the identifier or specifying how to return it Return value Compilation information ",
      "wordCount": 865,
      "subEntries": []
    },
    {
      "id": "Reference_dlocr_MdlocrAllocResult",
      "version": null,
      "title": "MdlocrAllocResult",
      "subTitles": null,
      "location": "MIL Reference",
      "pageURL": "content\\Reference\\dlocr\\MdlocrAllocResult.htm",
      "text": " MdlocrAllocResult Synopsis Allocate a Deep Learning OCR result buffer. Syntax MIL_ID MdlocrAllocResult( MIL_ID&nbsp;SysId, //in MIL_INT64&nbsp;ResultType, //in MIL_INT64&nbsp;ControlFlag, //in MIL_ID&nbsp;*DlocrResultIdPtr //out ) Description This function allocates a Deep Learning OCR result buffer, on the specified system, to store results obtained from an MdlocrRead() operation. When the Deep Learning OCR result buffer is no longer required, release it using MdlocrFree() unless M_UNIQUE_ID was specified during allocation; if M_UNIQUE_ID was specified, the smart identifier manages the Deep Learning OCR result buffer's lifetime and you must not manually free it. Parameters Parameters SysId Specifies the identifier of the system on which to allocate the Deep Learning OCR result buffer. Set this parameter to one of the values below: For specifying the system identifier Value Description M_DEFAULT_HOST Specifies the default Host system of the current MIL application. MIL system identifier Specifies a valid system identifier, previously allocated using MsysAlloc(). ResultType Specifies the type of result buffer to allocate. Set this parameter to the value below: For specifying the type of result buffer to allocate Value Description M_DLOCR_READ_RESULT Specifies to allocate a Deep Learning OCR result buffer. ControlFlag Reserved for future expansion and must be set to M_DEFAULT. DlocrResultIdPtr Specifies the address of the variable in which to write the Deep Learning OCR result buffer identifier or specifies the data type that the function should use to return the Deep Learning OCR result buffer identifier. For retrieving the identifier or specifying how to return it Value Description M_NULL Specifies that you will use this function's return value to obtain the identifier of the allocated Deep Learning OCR result buffer ; in this case, a standard MIL identifier of type MIL_ID is returned. M_UNIQUE_ID Specifies that you will use this function's return value to obtain the identifier of the allocated Deep Learning OCR result buffer ; in this case, a MIL smart identifier of type MIL_UNIQUE_DLOCR_ID is returned instead of a standard MIL identifier. This setting is only available when using C++11 (or later). A MIL smart identifier manages the lifespan of the MIL object it owns (similar to a std::unique_ptr). Note, you can use a MIL smart identifier as though it were a standard MIL identifier, except that you cannot use it to manually free the Deep Learning OCR result buffer (it is freed automatically). For more information, see the MIL smart identifiers subsection of the MIL custom data types, void pointers, extensions, and portability functions section of Chapter 2: Building an application. Address in which to write the identifier Specifies the address of a MIL_ID in which to write the identifier of the allocated Deep Learning OCR result buffer. If allocation fails, M_NULL is written as the identifier. Return value The returned value is the Deep Learning OCR result buffer identifier either as a standard identifier (MIL_ID) or a smart identifier (MIL_UNIQUE_DLOCR_ID). If allocation fails, M_NULL is returned (or nullptr if M_UNIQUE_ID was specified). Compilation information Header Include mil.h. Library Use mil.lib; mildlocr.lib. DLL Requires mil.dll; mildlocr.dll. Syntax Description Parameters - SysId For specifying the system identifier - ResultType For specifying the type of result buffer to allocate - ControlFlag - DlocrResultIdPtr For retrieving the identifier or specifying how to return it Return value Compilation information ",
      "wordCount": 533,
      "subEntries": []
    },
    {
      "id": "Reference_dlocr_MdlocrControl",
      "version": null,
      "title": "MdlocrControl",
      "subTitles": null,
      "location": "MIL Reference",
      "pageURL": "content\\Reference\\dlocr\\MdlocrControl.htm",
      "text": " MdlocrControl Synopsis Control a Deep Learning OCR context or result buffer. Syntax void MdlocrControl( MIL_ID&nbsp;ContextOrResultId, //in MIL_INT64&nbsp;ControlType, //in MIL_DOUBLE&nbsp;ControlValue //in ) Description This function allows you to control a Deep Learning OCR context or a Deep Learning OCR result buffer. To inquire about settings in a context or result buffer, call MdlocrInquire(). To get results from a result buffer, call MdlocrGetResult(). To control the string model-specific settings and positional constraints held in a Deep Learning OCR context, call MdlocrControlStringModel() and MdlocrControlConstraint(), respectively. You must preprocess the Deep Learning OCR context after you have finished adjusting context settings and before calling MdlocrRead(). To know if a context needs to be preprocessed, call MdlocrInquire() with M_PREPROCESSED. Parameters Parameters ContextOrResultId Specifies the identifier of the Deep Learning OCR context or result buffer to control. The context must have been previously allocated on the system using MdlocrAlloc(). The result buffer must have been previously allocated on the system using MdlocrAllocResult(). ControlType Specifies the type of control to set. See the Parameter associations section for possible values that can be specified. ControlValue Specifies the required value for the control. See the Parameter associations section for possible values that can be specified. Parameter associations The tables below list possible values for the ControlType and ControlValue parameters. For controlling a Deep Learning OCR context setting For controlling the predict engine For controlling a Deep Learning OCR result buffer The following ControlType and corresponding ControlValue parameter settings are used to control a setting of the Deep Learning OCR context specified with the ContextOrResultId parameter. For controlling a Deep Learning OCR context setting ControlType Description ControlValue M_ACCEPTED_CHARS Sets the list of accepted characters. The characters in this list should be among those supported by the context type; use MdlocrInquire() with M_SUPPORTED_CHARS to establish the list of supported characters. Note that calls to MdlocrControl() with M_ACCEPTED_CHARS are not accumulative. To get the list of characters in a predefined list, set M_ACCEPTED_CHARS to the required predefined list, and then inquire what characters this corresponds to using MdlocrInquire() with M_ACCEPTED_CHARS. M_DEFAULT_ACCEPTED_CHARS Specifies the list of all letters (upper and lowercase) and digits. This is the default value. M_DIGITS_CHARS Specifies the list of all numeric digits. M_LETTERS_CHARS Specifies the list of all upper and lowercase letters. M_LETTERS_LOWERCASE_CHARS Specifies the list of all lowercase letters. M_LETTERS_UPPERCASE_CHARS Specifies the list of all uppercase letters. MIL_TEXT(\"Accepted characters\") 1 Specifies the list of accepted characters. M_CHAR_MAX_ASPECT_RATIO Sets the maximum aspect ratio of an uppercase character. M_DEFAULT Specifies the default value; the default value is 1.0. Value &gt; 0.0 Specifies the maximum aspect ratio (width/height). M_DETECTION_ANGLE Sets the angle by which the image must be internally rotated to be able to read strings. M_DEFAULT Specifies the default value; the default value is 0. M_ACCORDING_TO_REGION Specifies to use the angle of the region of interest. 0.0 &lt;= Value &lt;= 360.0 Specifies the angle, in degrees. The angle should be specified in the counterclockwise direction. M_DETECTION_CHAR_HEIGHT_MAX Sets the maximum height of an uppercase character that can be read. M_DEFAULT Specifies the default value; the default value is 150.0. Value &gt;= M_DETECTION_CHAR_HEIGHT_MIN Specifies the maximum character height, in pixels. M_DETECTION_CHAR_HEIGHT_MIN Sets the minimum height of an uppercase character that can be read. Note, setting this to a low value negatively impacts performance. M_DEFAULT Specifies the default value; the default value is 20.0. 0.0 &lt;= Value &lt;= M_DETECTION_CHAR_HEIGHT_MAX Specifies the minimum character height, in pixels. M_INTERCHAR_MAX_WIDTH Sets the maximum gap size between the last character of a string and the first character of another. Gaps larger than this will be read as separate strings. Adjusting this setting allows you to split and merge strings on the same line. M_DEFAULT Specifies the default value; the default value is 50.0. Value &gt; 0.0 Specifies the maximum character gap, in pixels. M_STRING_NUMBER Sets the total number of strings to read in the image. For values other than M_INFINITE, using MdlocrRead() with M_MODEL_BASED will attempt to read exactly that number of strings while respecting M_MIN_NUMBER_OF_OCCURRENCES and M_MAX_NUMBER_OF_OCCURRENCES of each string model. If MdlocrRead() does not read enough strings, nothing will be read. Once the number of string occurrences for the context has been reached, the read operation will stop, regardless of whether the actual number set for any individual model has been found. Note, this setting is ignored when performing an M_READ_ALL operation. M_DEFAULT Same as M_INFINITE. M_INFINITE Specifies that there is no limit. Value &gt; 0 Specifies the number of strings to read in an image. M_TARGET_MAX_SIZE_X Sets the maximum width of a target image buffer used for a Deep Learning OCR function. Note that when working with an image buffer with an ROI, M_TARGET_MAX_SIZE_X refers to the width of the ROI rather than the width of the image. Note, setting this much larger than the target image can reduce performance. M_DEFAULT Same as M_INVALID. M_INVALID Specifies that the width is invalid. An error is generated if a Deep Learning OCR function is called on a context with M_TARGET_MAX_SIZE_X set to M_INVALID. Value &gt; 0 Specifies the maximum width of the buffer, in pixels. M_TARGET_MAX_SIZE_Y Sets the maximum height of a target image buffer used for a Deep Learning OCR function. Note that when working with an image buffer with an ROI, M_TARGET_MAX_SIZE_Y refers to the height of the ROI rather than the height of the image. Note, setting this much larger than the target image can reduce performance. M_DEFAULT Same as M_INVALID. M_INVALID Specifies that the height is invalid. An error is generated if a Deep Learning OCR function is called on a context with M_TARGET_MAX_SIZE_Y set to M_INVALID. Value &gt; 0 Specifies the maximum height of the buffer, in pixels. M_TIMEOUT Sets the maximum read time. No results are returned if the read operation times out. M_DEFAULT Specifies the default value; the default value is 10000.0 msec. M_DISABLE Specifies an infinite amount of read time. Value &gt;= 0.0 Specifies the maximum read time, in msec. 1 If you are passing the value in a variable, don't enclose it in MIL_TEXT(). The following ControlType and corresponding ControlValue parameter settings are used to control the predict engine. For controlling the predict engine ControlType Description ControlValue M_PREDICT_ENGINE Sets the predict engine to use. You can get predict engine information by calling MdlocrInquire() with M_PREDICT_ENGINE_.... You must have installed the appropriate MIL X Service Pack add-on to perform GPU accelerated prediction using CUDA or OpenVINO. MIL add-ons are available for download through the Updates item found in the MILConfig utility. M_DEFAULT Specifies the default predict engine, set using the MILConfig utility. 0 &lt;= Value &lt; M_NUMBER_OF_PREDICT_ENGINES Specifies the index of the predict engine to use. The following ControlType and corresponding ControlValue parameter settings are used to control the Deep Learning OCR result buffer specified with the ContextOrResultId parameter. For controlling a Deep Learning OCR result buffer ControlType Description ControlValue M_RESET Removes all results from the Deep Learning OCR result buffer. This does not delete the result buffer identifier, as is the case with MdlocrFree(). M_DEFAULT Specifies the default behavior. M_RESULT_OUTPUT_UNITS Sets whether to return results in pixels or world units. This essentially sets the output coordinate system to use. The setting of this control type will only affect functions within this module which return positional results. This control type can be changed at any time to return results in the required output units. M_DEFAULT Same as M_ACCORDING_TO_CALIBRATION. M_ACCORDING_TO_CALIBRATION Specifies that results are returned in world units if the result was calculated on an image associated with a camera calibration context; otherwise, specifies that results are returned in pixel units. M_PIXEL Specifies that results are returned in pixel units, with respect to the pixel coordinate system. M_WORLD Specifies that results are returned in world units, with respect to the relative coordinate system. If world units are specified, calling MdlocrGetResult() generates an error if the result was not calculated on a calibrated image. M_STOP_READ Stops the current read operation. You can only perform this operation from another thread of higher priority. No results are returned if you stop the read operation. M_DEFAULT Specifies the default behavior. Compilation information Header Include mil.h. Library Use mil.lib; mildlocr.lib. DLL Requires mil.dll; mildlocr.dll. Syntax Description Parameters - ContextOrResultId - ControlType - ControlValue Parameter Associations For controlling a Deep Learning OCR context setting For controlling the predict engine For controlling a Deep Learning OCR result buffer Compilation information ",
      "wordCount": 1386,
      "subEntries": []
    },
    {
      "id": "Reference_dlocr_MdlocrControlConstraint",
      "version": null,
      "title": "MdlocrControlConstraint",
      "subTitles": null,
      "location": "MIL Reference",
      "pageURL": "content\\Reference\\dlocr\\MdlocrControlConstraint.htm",
      "text": " MdlocrControlConstraint Synopsis Control a positional constraint of a Deep Learning OCR string model. Syntax void MdlocrControlConstraint( MIL_ID&nbsp;ContextId, //in MIL_INT64&nbsp;StringModelLabelOrIndex, //in MIL_INT64&nbsp;PositionInString, //in MIL_INT64&nbsp;ControlType, //in MIL_DOUBLE&nbsp;ControlValue, //in const void&nbsp;*ControlValuePtr //in ) Description This function allows you to control a positional constraint of a Deep Learning OCR string model. Constraints restrict the characters permitted to be read. The Deep Learning OCR module will only read strings that follow the positional constraints. This is useful, for example, when reading serial numbers that all have the same character at a given position. Setting positional constraints will also improve performance when characters are visually similar (for example, the numeral \"0\" and the uppercase letter \"O\"). You must preprocess the Deep Learning OCR context after modifying its positional constraints and before calling MdlocrRead(). To know if a context needs to be preprocessed, call MdlocrInquire() with M_PREPROCESSED. Parameters Parameters ContextId Specifies the identifier of the Deep Learning OCR context that contains the string model to control. The context must have been previously allocated on the system using MdlocrAlloc(). StringModelLabelOrIndex Specifies the string model to control. Set this parameter to one of the values below: For specifying the string model Value Description M_STRING_INDEX( MIL_INT IndexValue ) Specifies to control the string model by indicating its index. Parameters IndexValue Specifies the index of the string model. 0 &lt;= Value &lt; M_NUMBER_OF_STRING_MODELS Specifies the index of the string model to control. M_STRING_LABEL( MIL_INT LabelValue ) Specifies to control the string model by indicating its label. Parameters LabelValue Specifies the label of the string model. 0 &lt; Value &lt; 2097152 Specifies the label of the string model to control. PositionInString Specifies the position of the character in the string model. Set this parameter to one of the values below: For specifying the position in a string model Value Description M_DEFAULT Specifies all positions that have not been manually constrained. Value &gt;= 0 Specifies the position in the string model. ControlType Specifies the type of setting to control. See the Parameter associations section for possible values that can be specified. ControlValue Specifies the required value for the setting. See the Parameter associations section for possible values that can be specified. ControlValuePtr Accepts the address of one of the following (see the Parameter associations section for specifics on which is expected): M_NULL MIL_CONST_TEXT_PTR [optionally, in C++: a reference to a MIL_STRING] Specifies the address which contains more information about the setting's new value. Set this parameter to M_NULL if not used. If you use this parameter, the ControlType parameter must be M_CONSTRAINT_TYPE and the ControlValue parameter must be M_CHAR_LIST. See the Parameter associations section for possible values that can be specified. Parameter associations The table below lists possible values for the ControlType, ControlValue, and ControlValuePtr parameters. For controlling positional constraints in a string model The following ControlType and corresponding ControlValue and ControlValuePtr parameter settings are used to control positional constraint of a string model. Unless otherwise specified, set the StringModelLabelOrIndex parameter to the label or index of a string model, set the PositionInString parameter to the position that you want to constrain, and set the ControlValuePtr parameter to M_NULL. For controlling positional constraints in a string model ControlType Description ControlValue ControlValuePtr M_CONSTRAINT_TYPE Sets the type of constraint applied to the position. Note, the list of characters which the following character types correspond to is influenced by M_ACCEPTED_CHARS. For example if the character \"4\" is removed from the list of M_ACCEPTED_CHARS, then M_DIGITS will specify \"012356789\" rather than \"0123456789\". If all characters from the specified M_CONSTRAINT_TYPE are removed from M_ACCEPTED_CHARS, an error is generated. ControlValue Specifies one of the following. M_ANY Specifies any character. M_CHAR_LIST Specifies any character in the list passed to the ControlValuePtr parameter. M_DIGITS Specifies any digit. M_LETTERS Specifies any letter. M_LETTERS_LOWERCASE Specifies any lowercase letter. M_LETTERS_UPPERCASE Specifies any uppercase letter. M_SAME_AS_DEFAULT_CONSTRAINT Specifies to use the default constraint for the model using MdlocrControlConstraint() with PositionInString set to M_DEFAULT and M_CONSTRAINT_TYPE set to the required constraint. This is the default value. ControlValuePtr Data type info: Data type: Set this parameter to M_NULL &nbsp;|&nbsp; address of a MIL_CONST_TEXT_PTR [optionally, in C++: MIL_STRING ] MORE Data type: Set this parameter to M_NULL Note: Required for all ControlValue settings except M_CHAR_LIST. Data type: address of a MIL_CONST_TEXT_PTR [optionally, in C++: MIL_STRING ] Note: Required when ControlValue is set to M_CHAR_LIST Note: When using C++, you can pass a reference to a MIL_STRING instead. Specifies a null-terminated string indicating the names of the characters supported at the specified position, when ControlValue is set to M_CHAR_LIST. Character names must refer to specific letters (such as 'o'), digits (such as '0'), and punctuation marks (such as '%') in the font. You cannot indicate a space when listing characters for M_CHAR_LIST. The specified string can contain one or more character names. List them all without separators. For example, to read the twenty-second, the ninth, or the third uppercase letter of the alphabet at the specified position, use the string \"VIC\". You can list character names in hexadecimal format beginning with \"\\\\x\". This is necessary if you are in an ASCII environment and you want Unicode characters beyond the Basic Latin range. For example, Basic Latin does not include the smiley face character; to specify it, use \"\\\\x263A\". You can also list a string of character names with mixed notation; in this case, you should also use \"\\\\x\" (for example, \"VIC\\\\x263A\"). M_IS_OPTIONAL Sets whether a position in a string model is optional. You should mark a model position as optional if you do not require a character to be returned for that position in the model. If the string model has a minimum string size (M_STRING_SIZE_MIN) less than its maximum size (M_STRING_SIZE_MAX), optional positions can be skipped if their constraints cannot be met (up to a maximum of M_STRING_SIZE_MAX- M_STRING_SIZE_MIN skips). For example, if you want to read 10-digit telephone numbers in the formats '###-###-####' and '##########', you can set the minimum string size to 10, set the maximum string size to 12, and mark positions 3 and 7 as optional. Then, set the permitted character constraints to M_DIGITS for positions 0-2, 4-6, and 8-11 and to hyphens for positions 3 and 7. If the target string is \"123-456-7890\", all the constraints are met, and Deep Learning OCR will return \"123-456-7890\". If the target string is \"1234567890\", positions 3 and 7 are skipped because they are optional and their constraints cannot be met, and Deep Learning OCR will return \"1234567890\". Note that unless you set a model position as optional, its character constraints must be met to return the string, whereas if a character in the target image does not meet the constraints, Deep Learning OCR will ignore the character and check if the constraints are met by the next character if M_INTERCHAR_MAX_WIDTH is set wide enough; if the distance between the previous character and the next character is less than the maximum inter-character width, the current character is ignored and the next character can be used to meet the constraints. In the example above, if you had set the model to '##########', the target string \"123-456-7890\" might still have been read (as \"1234567890\") if the maximum inter-character width was wide enough. It is always safer to include optional characters in the model and mark their positions as optional. You can use MdlocrGetResult() with M_SKIPPED_POSITIONS to see which positions in the model were skipped. Note that a string read with a lower number of skips will be returned as a higher priority result than a string read with a higher number of skips. ControlValue Specifies one of the following. M_DEFAULT Same as M_FALSE. M_FALSE Specifies that the model position is not optional. M_TRUE Specifies that the model position is optional. Note, this is unavailable when PositionInString is set to M_DEFAULT. ControlValuePtr Data type info: Data type: Set this parameter to M_NULL Data type: Set this parameter to M_NULL Compilation information Header Include mil.h. Library Use mil.lib; mildlocr.lib. DLL Requires mil.dll; mildlocr.dll. Syntax Description Parameters - ContextId - StringModelLabelOrIndex For specifying the string model - PositionInString For specifying the position in a string model - ControlType - ControlValue - ControlValuePtr Parameter Associations For controlling positional constraints in a string model Compilation information ",
      "wordCount": 1363,
      "subEntries": []
    },
    {
      "id": "Reference_dlocr_MdlocrControlStringModel",
      "version": null,
      "title": "MdlocrControlStringModel",
      "subTitles": null,
      "location": "MIL Reference",
      "pageURL": "content\\Reference\\dlocr\\MdlocrControlStringModel.htm",
      "text": " MdlocrControlStringModel Synopsis Control a global setting of a Deep Learning OCR string model. Syntax void MdlocrControlStringModel( MIL_ID&nbsp;ContextId, //in MIL_INT64&nbsp;StringModelLabelOrIndex, //in MIL_INT64&nbsp;ControlType, //in MIL_DOUBLE&nbsp;ControlValue //in ) Description This function allows you to control a global setting of a Deep Learning OCR string model. String models represent the strings to read from a target image. Initially, any character from any font can be read. String models are held in a Deep Learning OCR context. To add string models to a context based on a previous call to MdlocrRead(), use MdlocrDefineModelFromResult(); to add a string model without relying on a previous MdlocrRead() operation, use MdlocrDefineModel(). To inquire about global settings of string models, use MdlocrInquireStringModel(). You must preprocess the Deep Learning OCR context after you have finished modifying its string models and before calling MdlocrRead(). To know if a context needs to be preprocessed, call MdlocrInquire() with M_PREPROCESSED. Parameters Parameters ContextId Specifies the identifier of the Deep Learning OCR context that contains the string model to control. The context must have been previously allocated on the system using MdlocrAlloc(). StringModelLabelOrIndex Specifies the string model (one or all) to control. Set this parameter to one of the values below: For specifying the string model Value Description M_STRING_INDEX( MIL_INT IndexValue ) Specifies to control the string model by indicating its index. Parameters IndexValue Specifies the index of the string model. 0 &lt;= Value &lt; M_NUMBER_OF_STRING_MODELS Specifies the index of the string model to control. M_STRING_LABEL( MIL_INT LabelValue ) Specifies to control the string model by indicating its label. Parameters LabelValue Specifies the label of the string model. 0 &lt; Value &lt; 2097152 Specifies the label of the string model to control. M_ALL Specifies to control all string models. ControlType Specifies the type of setting to control. See the Parameter associations section for possible values that can be specified. ControlValue Specifies the required value for the setting. Set this parameter to M_DEFAULT if not used. See the Parameter associations section for possible values that can be specified. Parameter associations The table below lists possible values for the ControlType and ControlValue parameters. For general string model settings To control a global setting of a string model, set the ControlType parameter to one of the values below. Unless otherwise specified, set the StringModelLabelOrIndex parameter to the label or index of a string model. For general string model settings ControlType Description ControlValue M_CHAR_HEIGHT_MAX Sets the maximum height of an uppercase character in the string model. Note this value must be less than or equal to the value set using MdlocrControl() with M_DETECTION_CHAR_HEIGHT_MAX. M_DEFAULT Same as M_SAME_AS_CONTEXT. M_SAME_AS_CONTEXT Specifies to use the maximum character height specified using MdlocrControl() with M_DETECTION_CHAR_HEIGHT_MAX. Value &gt;= M_CHAR_HEIGHT_MIN Specifies the maximum character height, in pixels. M_CHAR_HEIGHT_MIN Sets the minimum height of an uppercase character in the string model. Note, this value must be greater than or equal to the value set using MdlocrControl() with M_DETECTION_CHAR_HEIGHT_MIN. M_DEFAULT Same as M_SAME_AS_CONTEXT. M_SAME_AS_CONTEXT Specifies to use the minimum character height specified using MdlocrControl() with M_DETECTION_CHAR_HEIGHT_MIN. 0.0 &lt;= Value &lt;= M_CHAR_HEIGHT_MAX Specifies the minimum height in pixels. M_MAX_NUMBER_OF_OCCURRENCES Sets the maximum number of occurrences of the specified string model. M_DEFAULT Same as M_INFINITE. M_INFINITE Specifies that there is no maximum number of occurrences. Value &gt;= M_MIN_NUMBER_OF_OCCURRENCES Specifies the maximum number of occurrences. M_MIN_NUMBER_OF_OCCURRENCES Sets the minimum number of occurrences of the specified string model. M_DEFAULT Specifies the default value; the default value is 0. 0 &lt;= Value &lt;= M_MAX_NUMBER_OF_OCCURRENCES Specifies the minimum number of occurrences. M_STRING_LABEL_VALUE Sets the label of the specified string model. You must set the StringModelLabelOrIndex parameter to the index of the string model. 0 &lt; Value &lt; 2097152 Specifies the label of the string model to control. M_STRING_SIZE_MAX Sets the maximum number of characters in a string. M_STRING_SIZE_MIN &lt;= Value &lt;= 256 Specifies the maximum number of characters. M_STRING_SIZE_MIN Sets the minimum number of characters in a string. Note, when setting M_STRING_SIZE_MIN less than M_STRING_SIZE_MAX, MdlocrRead() operations with M_MODEL_BASED will be allowed to skip model positions where M_IS_OPTIONAL is set to M_TRUE. MdlocrPreprocess() expects the number of positions with M_IS_OPTIONAL set to M_TRUE to be greater than or equal to the difference between M_STRING_SIZE_MAX and M_STRING_SIZE_MIN. 1 &lt;= Value &lt;= M_STRING_SIZE_MAX Specifies the minimum number of characters. M_TEXT_ANCHOR_MODE Sets the text anchoring mode. If a text anchor is used, it will not be included in the string result. M_DEFAULT Same as M_DISABLE. M_DISABLE Specifies that no anchoring is used. M_TEXT_PREFIX Specifies that the string is prefixed by a known substring. Specify the substring using M_TEXT_ANCHOR_VALUE. M_TEXT_SUFFIX Specifies that the string is suffixed by a known substring. Specify the substring using M_TEXT_ANCHOR_VALUE. M_TEXT_ANCHOR_VALUE Sets the text to be used as a textual anchor. MIL_TEXT(\"String\") 1 Specifies the text used as an anchor. An empty string indicates that any string that fits the string model can be read. The default value is \"\". 1 If you are passing the value in a variable, don't enclose it in MIL_TEXT(). Compilation information Header Include mil.h. Library Use mil.lib; mildlocr.lib. DLL Requires mil.dll; mildlocr.dll. Syntax Description Parameters - ContextId - StringModelLabelOrIndex For specifying the string model - ControlType - ControlValue Parameter Associations For general string model settings Compilation information ",
      "wordCount": 861,
      "subEntries": []
    },
    {
      "id": "Reference_dlocr_MdlocrCopy",
      "version": null,
      "title": "MdlocrCopy",
      "subTitles": null,
      "location": "MIL Reference",
      "pageURL": "content\\Reference\\dlocr\\MdlocrCopy.htm",
      "text": " MdlocrCopy Synopsis Copy settings between two Deep Learning OCR contexts. Syntax void MdlocrCopy( MIL_ID&nbsp;SrcDlOcrContext, //in MIL_ID&nbsp;DstDlOcrContext, //in MIL_INT64&nbsp;CopyType, //in MIL_INT64&nbsp;ControlFlag //in ) Description This function copies settings from the source context (SrcDlOcrContext) to the destination context (DstDlOcrContext). This is useful, for example, if you want to allocate a new context using a different deep learning model (ContextType) and keep the same settings. You must preprocess the destination Deep Learning OCR context before calling MdlocrRead(). To know if a context needs to be preprocessed, call MdlocrInquire() with M_PREPROCESSED. Parameters Parameters SrcDlOcrContext Specifies the identifier of the source Deep Learning OCR context from which to copy. DstDlOcrContext Specifies the identifier of the destination Deep Learning OCR context in which to copy. CopyType Specifies the type of copy operation to perform. For specifying the copy operation Value Description M_ALL_COMMON_SETTINGS Specifies to copy all common settings from the source context to the destination context. ControlFlag Reserved for future expansion and must be set to M_DEFAULT. Compilation information Header Include mil.h. Library Use mil.lib; mildlocr.lib. DLL Requires mil.dll; mildlocr.dll. Syntax Description Parameters - SrcDlOcrContext - DstDlOcrContext - CopyType For specifying the copy operation - ControlFlag Compilation information ",
      "wordCount": 194,
      "subEntries": []
    },
    {
      "id": "Reference_dlocr_MdlocrDefineModel",
      "version": null,
      "title": "MdlocrDefineModel",
      "subTitles": null,
      "location": "MIL Reference",
      "pageURL": "content\\Reference\\dlocr\\MdlocrDefineModel.htm",
      "text": " MdlocrDefineModel Synopsis Add a string model to, or delete a string model from, a Deep Learning OCR context. Syntax MIL_INT64 MdlocrDefineModel( MIL_ID&nbsp;ContextId, //in MIL_INT64&nbsp;StringModelLabelOrIndex, //in MIL_INT64&nbsp;Operation, //in MIL_INT64&nbsp;StringSizeMin, //in MIL_INT64&nbsp;StringSizeMax //in ) Description This function allows you to add a string model to, or delete a string model from, a Deep Learning OCR context. You don't need to add a model to read all strings in the target image. In addition, if you want to restrict the string that is found and read, you should typically use MdlocrDefineModelFromResult(), which allows you to select a resulting string as the model. MdlocrDefineModel() is useful if you only want to restrict the number of characters in the string. Regardless of how you add a model, you can always constrain the characters that appear at certain positions using MdlocrControlConstraint() and adjust general string model settings, such as, setting text anchors, using MdlocrControlStringModel(). Note that although you need to define the minimum and maximum number of characters of the string model when you add a new model with this function, you can change these limits using MdlocrControlStringModel() with M_STRING_SIZE_MIN and M_STRING_SIZE_MAX. Parameters Parameters ContextId Specifies the identifier of the Deep Learning OCR context in which to add or delete a model. The Deep Learning OCR context must have been previously allocated on the required system using MdlocrAlloc(). StringModelLabelOrIndex Specifies the string model (one or all) to control. See the Parameter associations section for possible values that can be specified. Operation Specifies whether to add or delete a string model from a Deep Learning OCR context. See the Parameter associations section for possible values that can be specified. StringSizeMin Specifies the minimum number of characters of a new string model. If the Operation parameter is set to M_DELETE, StringSizeMin must be set to M_DEFAULT. For specifying the minimum number of characters Value Description M_DEFAULT Specifies that this parameter is not needed (that is, when Operation set to M_DELETE). Value &gt;= 0 Specifies the minimum number of characters. StringSizeMax Specifies the maximum length of a new string model. If the Operation parameter is set to M_DELETE, StringSizeMax must be set to M_DEFAULT. For specifying the maximum number of characters Value Description M_DEFAULT Specifies that this parameter is not needed (that is, when Operation set to M_DELETE). Value &gt;= 0 Specifies the maximum number of characters. Parameter associations The table below lists possible values for the StringModelLabelOrIndex and Operation parameters. For creating or deleting a string model For creating or deleting a string model Operation Description StringModelLabelOrIndex M_ADD Specifies to add a new string model to the context. M_DEFAULT Same as M_NEW_LABEL. M_STRING_LABEL( MIL_INT LabelValue ) Specifies to add a string model with the specified label. Parameters LabelValue Specifies the label of the string model. 0 &lt; Value &lt; 2097152 Specifies the label of the string model to add. M_NEW_LABEL Specifies to add a string model with an automatically assigned label. To inquire about the label, use MdlocrInquireStringModel() with M_STRING_LABEL_VALUE. M_DELETE Specifies to delete a string model from a Deep Learning OCR context. M_DEFAULT Same as M_ALL. M_STRING_INDEX( MIL_INT IndexValue ) Specifies to delete the string model by indicating its index. Parameters IndexValue Specifies the index of the string model. 0 &lt;= Value &lt; M_NUMBER_OF_STRING_MODELS Specifies the index of the string model to delete. M_STRING_LABEL( MIL_INT LabelValue ) Specifies to delete the string model by indicating its label. Parameters LabelValue Specifies the label of the string model. 0 &lt; Value &lt; 2097152 Specifies the label of the string model to delete. M_ALL Specifies to delete all string models from the Deep Learning OCR context. Return value Reserved for future expansion and returns M_NULL. Compilation information Header Include mil.h. Library Use mil.lib; mildlocr.lib. DLL Requires mil.dll; mildlocr.dll. Syntax Description Parameters - ContextId - StringModelLabelOrIndex - Operation - StringSizeMin For specifying the minimum number of characters - StringSizeMax For specifying the maximum number of characters Parameter Associations For creating or deleting a string model Return value Compilation information ",
      "wordCount": 660,
      "subEntries": []
    },
    {
      "id": "Reference_dlocr_MdlocrDefineModelFromResult",
      "version": null,
      "title": "MdlocrDefineModelFromResult",
      "subTitles": null,
      "location": "MIL Reference",
      "pageURL": "content\\Reference\\dlocr\\MdlocrDefineModelFromResult.htm",
      "text": " MdlocrDefineModelFromResult Synopsis Add a string model based on a resulting string from a previous call to MdlocrRead(). Syntax MIL_INT64 MdlocrDefineModelFromResult( MIL_ID&nbsp;DlocrContext, //in MIL_INT64&nbsp;StringModelLabelOrIndex, //in MIL_ID&nbsp;ResultId, //in MIL_INT64&nbsp;StringIndex, //in MIL_INT64&nbsp;ControlFlag //in ) Description This function allows you to add a string model based on a resulting string from a previous call to MdlocrRead(). The string model is automatically assigned the same number of characters (M_STRING_SIZE_...) as the specified resulting string. The string model is also automatically assigned a minimum and maximum character height (M_CHAR_HEIGHT_...) that is the same as the specified resulting string plus a tolerance. To have the constraints inferred from the resulting string as well, set the ControlFlag parameter to M_INFER_CONSTRAINTS. Note that the position of the specified resulting string is not used. You don't need to add a model to read all strings in the target image. You only need to add a model if you want to restrict the string that is found and read. MdlocrDefineModelFromResult() allows you to define the string model so that attributes are automatically set from the specified resulting string. If you only want to restrict the number of characters in the string, you can use MdlocrDefineModel(). Regardless of how you add a model, you can always constrain the characters that appear at certain positions using MdlocrControlConstraint() and adjust general string model settings using MdlocrControlStringModel(). The string model index starts at 0, and each subsequent string model added to the context is given a sequential index number, in the order that the model was added. If a model is deleted, all entries with higher indices are shifted down one. When adding the string model, you can overwrite an existing model by specifying its label or index. If multiple strings are present in the target image, you can establish which is the required string by drawing the results using MdlocrDraw(). Parameters Parameters DlocrContext Specifies the identifier of the Deep Learning OCR context to which the string model must be added. StringModelLabelOrIndex Specifies the string model to replace. Set this parameter to one of the values below: For specifying the string model Value Description M_DEFAULT Same as M_ADD. M_STRING_INDEX( MIL_INT IndexValue ) Specifies the index of the string model to replace. An error is generated if a string model is not defined at the specified index. Parameters IndexValue Specifies the index of the string model. 0 &lt;= Value &lt; M_NUMBER_OF_STRING_MODELS Specifies the index of the string model. M_STRING_LABEL( MIL_INT LabelValue ) Specifies the label of the string model to replace. An error is generated if a string model is not defined at the specified label. Parameters LabelValue Specifies the label of the string model. 0 &lt; Value &lt; 2097152 Specifies the label of the string model. M_ADD Specifies to add the new string model. ResultId Specifies the identifier of the Deep Learning OCR result context from which the string model will be created. StringIndex Specifies the index of the string occurrence from which the string model will be created. ControlFlag Specifies what is set when defining a string model from a result. Set this parameter to one of the values below: For specifying what is set when defining a string model from a result string Value Description M_DEFAULT Specifies to set M_STRING_SIZE_MIN, M_STRING_SIZE_MAX, M_CHAR_HEIGHT_MIN, and M_CHAR_HEIGHT_MAX for the new model based on the string occurrence. M_INFER_CONSTRAINTS Specifies to set constraints based on the specified string occurrence. M_LETTERS_UPPERCASE, M_LETTERS_LOWERCASE, and M_DIGITS can be inferred from the string occurrence. If a character in the string occurrence is neither a letter or a digit, then the inferred constraint type is set to M_SAME_AS_DEFAULT_CONSTRAINT (same as M_ANY). Return value Reserved for future expansion and returns M_NULL. Compilation information Header Include mil.h. Library Use mil.lib; mildlocr.lib. DLL Requires mil.dll; mildlocr.dll. Syntax Description Parameters - DlocrContext - StringModelLabelOrIndex For specifying the string model - ResultId - StringIndex - ControlFlag For specifying what is set when defining a string model from a result string Return value Compilation information ",
      "wordCount": 658,
      "subEntries": []
    },
    {
      "id": "Reference_dlocr_MdlocrDraw",
      "version": null,
      "title": "MdlocrDraw",
      "subTitles": null,
      "location": "MIL Reference",
      "pageURL": "content\\Reference\\dlocr\\MdlocrDraw.htm",
      "text": " MdlocrDraw Synopsis Draw specific features of a Deep Learning OCR result. Syntax void MdlocrDraw( MIL_ID&nbsp;ContextGraId, //in MIL_ID&nbsp;ResultDlocrId, //in MIL_ID&nbsp;DstImageBufOrListGraId, //in MIL_INT64&nbsp;Operation, //in MIL_INT64&nbsp;StringIndex, //in MIL_INT64&nbsp;CharIndex, //in MIL_INT64&nbsp;ControlFlag //in ) Description This function draws specific features of a Deep Learning OCR result in the destination image buffer or 2D graphics list. Parameters Parameters ContextGraId Specifies the identifier of the 2D graphics context to use when drawing. Set this parameter to one of the values below. For specifying the 2D graphics context Value Description M_DEFAULT Specifies that the default 2D graphics context of the current MIL application is used. Note that there is a different default 2D graphics context for each thread. MIL 2D graphics context identifier Specifies a valid 2D graphics context identifier, which you have allocated using MgraAlloc(). ResultDlocrId Specifies the identifier of the Deep Learning OCR result buffer from which to extract the features to draw. The result buffer must have been previously allocated on the system using MdlocrAllocResult(). DstImageBufOrListGraId Specifies the identifier of the destination image buffer or 2D graphics list in which to draw. The buffer can be any valid MIL image buffer allocated using MbufAlloc...(). The 2D graphics list must be previously allocated using MgraAllocList(). By drawing into a display's overlay buffer or associating the 2D graphics list with the display, you can also annotate an image non-destructively. If specifying an image buffer, it must not have a region of interest (ROI) associated with it. Using an image buffer with an ROI will cause an error. Operation Specifies the drawing operation to perform. When applicable, MdlocrDraw() draws the required information at the location that the string was read in the target, at the correct angle, scale, and aspect ratio. For a drawing operation related to strings, you can set the Operation parameter to one of the following. The CharIndex parameter must be set to M_DEFAULT. Use the StringIndex parameter to specify the string occurrence for which to perform the draw operation. For a drawing operation related to strings Value Description M_DRAW_STRING Draws the string that was read. M_DRAW_STRING_BOX Draws a bounding box around the string that was read. This bounding box encloses all of the string's characters. M_DRAW_STRING_INDEX Draws the index associated with the string read. This drawing operation is useful when defining a model using MdlocrDefineModelFromResult(). For a drawing operation related to characters, you can set the Operation parameter to one of the following. The CharIndex parameter must be set to one or all characters. For a drawing operation related to characters Value Description M_DRAW_CHAR Draws the character that was read. M_DRAW_STRING_CHAR_BOX Draws the character's bounding box at the location at which the character was read. M_DRAW_STRING_CHAR_POSITION Draws a circled dot at the center of each bounding box at the location at which the character was read. StringIndex Specifies the string result (one or all) for which to perform the drawing operation. Set this parameter to one of the values below. For specifying the string index Value Description M_DEFAULT Same as M_ALL. M_ALL Specifies to perform the drawing operation for all string results. M_GENERAL Specifies to perform a global drawing operation for a single bounding box that encompasses all strings. The Operation parameter must be set to M_DRAW_STRING_BOX; otherwise, an error is generated. Value &gt;= 0 Specifies the index of the string result for which to perform the drawing operation. CharIndex Specifies the character (one or all) in the string result for which to perform the drawing operation. Set this parameter to one of the values below. For specifying the character index Value Description M_DEFAULT Implements the default behavior. For drawing operations related to strings, the default indicates that this parameter is not required. For drawing operations related to characters, the default is the same as setting the M_INDEX_IN_STRING() macro to M_ALL. M_INDEX_IN_STRING( MIL_INT CharIndex ) Specifies the character(s) for which to perform the drawing operation. Parameters CharIndex Set this parameter to one of the following: M_ALL Specifies to perform the drawing operation for all characters in the string. To retrieve the number of characters in the string, call MdlocrGetResult() with M_STRING_CHAR_NUMBER. 0 &lt;= Value &lt; M_STRING_CHAR_NUMBER Specifies the index of the character in the string for which to perform the drawing operation. The value must be less than the total number of characters in the string (M_STRING_CHAR_NUMBER). ControlFlag Reserved for future expansion and must be set to M_DEFAULT. Compilation information Header Include mil.h. Library Use mil.lib; mildlocr.lib. DLL Requires mil.dll; mildlocr.dll. Syntax Description Parameters - ContextGraId For specifying the 2D graphics context - ResultDlocrId - DstImageBufOrListGraId - Operation For a drawing operation related to strings For a drawing operation related to characters - StringIndex For specifying the string index - CharIndex For specifying the character index - ControlFlag Compilation information ",
      "wordCount": 788,
      "subEntries": []
    },
    {
      "id": "Reference_dlocr_MdlocrFree",
      "version": null,
      "title": "MdlocrFree",
      "subTitles": null,
      "location": "MIL Reference",
      "pageURL": "content\\Reference\\dlocr\\MdlocrFree.htm",
      "text": " MdlocrFree Synopsis Free a Deep Learning OCR context or a Deep Learning OCR result buffer. Syntax void MdlocrFree( MIL_ID&nbsp;ContextOrResultDlocrId //in ) Description This function deletes the specified Deep Learning OCR context or Deep Learning OCR result buffer identifier, and releases any memory associated with it. All Deep Learning OCR contexts and all Deep Learning OCR result buffers allocated on a particular system must be freed before the system can be freed, unless M_UNIQUE_ID was specified during allocation. Parameters Parameter ContextOrResultDlocrId Specifies the identifier of the Deep Learning OCR context or Deep Learning OCR result buffer to free. These must have been successfully allocated (with MdlocrAlloc() or MdlocrAllocResult()) prior to calling this function. Compilation information Header Include mil.h. Library Use mil.lib; mildlocr.lib. DLL Requires mil.dll; mildlocr.dll. Syntax Description Parameters - ContextOrResultDlocrId Compilation information ",
      "wordCount": 134,
      "subEntries": []
    },
    {
      "id": "Reference_dlocr_MdlocrGetResult",
      "version": null,
      "title": "MdlocrGetResult",
      "subTitles": null,
      "location": "MIL Reference",
      "pageURL": "content\\Reference\\dlocr\\MdlocrGetResult.htm",
      "text": " MdlocrGetResult Synopsis Get results from a Deep Learning OCR result buffer. Syntax void MdlocrGetResult( MIL_ID&nbsp;ResultDlocrId, //in MIL_INT64&nbsp;StringIndex, //in MIL_INT64&nbsp;CharPositionIndex, //in MIL_INT64&nbsp;ResultType, //in void&nbsp;*ResultArrayPtr //out ) Description This function retrieves results of the specified type from a Deep Learning OCR result buffer. You can retrieve global results, string results, or character results. Results are available after calling MdlocrRead(). If your target image (MdlocrRead()) was associated with a camera calibration context, positional and dimensional results are, by default, returned with respect to the relative coordinate system of the image. Otherwise, these results are returned in pixels, relative to the center of upper-left pixel in the target image. If your target image was associated with a camera calibration context but you want to retrieve positional and dimensional results in pixel units, use MdlocrControl() with the M_RESULT_OUTPUT_UNITS control type set to M_PIXEL. However, if you set M_RESULT_OUTPUT_UNITS to M_WORLD without specifying a calibrated image in which to calculate the results, MdlocrGetResult() generates an error. Positional and dimensional results take into account the angle at which the result was found. The following example shows how the result for the bottom-left corner of the string box (M_STRING_BOX_BL_X and M_STRING_BOX_BL_Y) depends on the location and angle at which the string was read. To remove all results from a result buffer, call MdlocrControl() with M_RESET. This does not delete the result buffer identifier, as is the case with MdlocrFree(). Parameters Parameters ResultDlocrId Specifies the identifier of the Deep Learning OCR result buffer from which to retrieve results. StringIndex Specifies the string (one or all) for which to get results, or specifies to get global results. Set this parameter to one of the values below. Note that you must set this parameter to a string index (one or all) when getting character results. For specifying the string for which to get results, or for specifying global results Value Description M_DEFAULT Same as M_GENERAL. M_ALL Specifies to retrieve results for all strings in the result buffer. To retrieve the number of strings in the result buffer, use M_STRING_NUMBER. M_GENERAL Specifies to retrieve global results. These results are related to the result buffer itself. 0 &lt;= Value &lt; M_STRING_NUMBER Specifies the index of the string for which to retrieve results. The index must be less than the total number of strings in the result buffer (M_STRING_NUMBER). CharPositionIndex Specifies the character (one or all) for which to get results, or specifies to get global or string results. Set this parameter to one of the values below. For specifying the character for which to get results, or for specifying global or string results Value Description M_DEFAULT Same as M_GENERAL. M_INDEX_IN_STRING( MIL_INT CharIndex ) Specifies to retrieve a character result by indicating the character's index, according to the string model definition. The StringIndex parameter must be set to a string (one or all). Note that indices don't include any substring set as a text anchor (using MdlocrControlStringModel() with M_TEXT_ANCHOR_MODE) since these characters are not returned. Parameters CharIndex Set this parameter to one of the following: M_ALL Specifies to retrieve results for all characters. To retrieve the number of characters, use M_STRING_CHAR_NUMBER. 0 &lt;= Value &lt; M_STRING_CHAR_NUMBER Specifies the index of the character for which to get results. The value must be less than the total number of characters (M_STRING_CHAR_NUMBER). M_GENERAL Specifies to retrieve global results or string results. M_GENERAL retrieves global results when the StringIndex parameter is set to M_GENERAL. M_GENERAL retrieves string results when the StringIndex parameter is set to a string (one or all). Note that indices don't include any substring set as a text anchor (using MdlocrControlStringModel() with M_TEXT_ANCHOR_MODE). ResultType Specifies the type of result to retrieve. See the Parameter associations section for possible values that can be specified. ResultArrayPtr Accepts the address of one of the following (see the Parameter associations section for specifics on which is expected): array of type MIL_DOUBLE [optionally, in C++: a reference to a std::vector&lt;MIL_DOUBLE&gt; ] array of type MIL_FLOAT [optionally, in C++: a reference to a std::vector&lt;MIL_FLOAT&gt; ] array of type MIL_ID [optionally, in C++: a reference to a std::vector&lt;MIL_ID&gt; ] array of type MIL_INT [optionally, in C++: a reference to a std::vector&lt;MIL_INT&gt; ] array of type MIL_INT16 [optionally, in C++: a reference to a std::vector&lt;MIL_INT16&gt; ] array of type MIL_INT32 [optionally, in C++: a reference to a std::vector&lt;MIL_INT32&gt; ] array of type MIL_INT64 [optionally, in C++: a reference to a std::vector&lt;MIL_INT64&gt; ] array of type MIL_TEXT_CHAR [optionally, in C++: a reference to a MIL_STRING] MIL_DOUBLE MIL_FLOAT MIL_ID MIL_INT MIL_INT16 MIL_INT32 MIL_INT64 Specifies the address in which to write results. See the Parameter associations section for possible values that can be returned. Parameter associations The tables below list possible values for the ResultType parameter and possible values returned to the ResultArrayPtr parameter. For retrieving global results For retrieving string results For retrieving global or string results For retrieving character results When retrieving global results, set the ResultType parameter to the value below. In this case, set both the StringIndex and CharPositionIndex parameters to either M_GENERAL or M_DEFAULT. For retrieving global results ResultType Description ResultArrayPtr - Possible values returned M_STATUS Retrieves information regarding the state of the read operation. ResultArrayPtr extra info Data type info: Data type: address of a MIL_INT Data type: address of a MIL_INT M_COMPLETE Specifies that the read operation completed successfully. It is possible to read 0 strings (M_STRING_NUMBER), and have a successfully completed read operation. M_CURRENTLY_READING Specifies that the read operation is currently ongoing. You can only get this status if you are retrieving it from another thread. M_INTERNAL_ERROR Specifies that an unexpected error occurred. M_NOT_ENOUGH_MEMORY Specifies that a memory allocation error occurred while reading. M_READ_NOT_PERFORMED Specifies that the read operation has not been performed. This is the initial status. M_STOPPED_BY_REQUEST Specifies that the read operation was explicitly stopped (MdlocrControl() with M_STOP_READ). M_TIMEOUT_REACHED Specifies that the read operation ended because the timeout limit was reached (MdlocrControl() with M_TIMEOUT). M_STRING_NUMBER Retrieves the total number of strings read. This is the total number of strings read and stored in the result buffer. ResultArrayPtr extra info Data type info: Data type: address of a MIL_INT Data type: address of a MIL_INT When retrieving string results, set the ResultType parameter to one of the values below. In this case, set the StringIndex parameter to the index of the string for which to get the result or M_ALL (unless otherwise specified), and set the CharPositionIndex parameter to either M_GENERAL or M_DEFAULT. For retrieving string results ResultType Description ResultArrayPtr - Possible values returned M_INTERCHAR_MAX_WIDTH Retrieves the maximum inter-character width in the string that was read. The width is relative to output coordinate system specified with MdlocrControl() with M_RESULT_OUTPUT_UNITS. ResultArrayPtr extra info Data type info: Data type: address of a MIL_DOUBLE &nbsp;|&nbsp; array of type MIL_DOUBLE [optionally, in C++: a reference to a std::vector&lt;MIL_DOUBLE&gt; ] MORE Data type: address of a MIL_DOUBLE Note: When retrieving the result for a string in the result buffer. Data type: array of type MIL_DOUBLE [optionally, in C++: a reference to a std::vector&lt;MIL_DOUBLE&gt; ] Required array size (either of the following): MdlocrGetResult ( M_STRING_NUMBER ) MdlocrGetResult ( M_INTERCHAR_MAX_WIDTH + M_NB_ELEMENTS ) Note: When retrieving the result for all strings in the result buffer. Value &gt; 0.0 Specifies the inter-character width. M_SKIPPED_POSITIONS Retrieves the indices of the positions that were skipped in the string model. This array will only be filled if M_STRING_SIZE_MIN is different from M_STRING_SIZE_MAX; if they are equal, it means that no positions were skipped. Note that indices don't include any substring set as a text anchor (using MdlocrControlStringModel() with M_TEXT_ANCHOR_MODE) since these characters are not returned. ResultArrayPtr extra info Data type info: Data type: array of type MIL_INT [optionally, in C++: a reference to a std::vector&lt;MIL_INT&gt; ] MORE Data type: array of type MIL_INT [optionally, in C++: a reference to a std::vector&lt;MIL_INT&gt; ] Required array size: MdlocrGetResult ( M_SKIPPED_POSITIONS + M_NB_ELEMENTS ) Value &gt;= 0 Specifies the index of the position in the model that was skipped. M_STRING Retrieves the string that was read. This information is returned as a regular string. It includes the name of all the characters in the string and the terminating null character. It does not include any text anchors set using MdlocrControlStringModel(). Note that this result type cannot be used when the StringIndex parameter is set to M_ALL. ResultArrayPtr extra info Data type info: Data type: array of type MIL_TEXT_CHAR MORE Data type: array of type MIL_TEXT_CHAR Required array size: MdlocrGetResult ( M_STRING + M_STRING_SIZE ) M_STRING_CHAR_NUMBER Retrieves the total number of characters read. This number does not count the terminating null character. ResultArrayPtr extra info Data type info: Data type: address of a MIL_INT Data type: address of a MIL_INT M_STRING_MODEL_INDEX Retrieves the index of the string model, in the Deep Learning OCR context, if one was used to read the string. ResultArrayPtr extra info Data type info: Data type: address of a MIL_INT Data type: address of a MIL_INT M_INVALID Specifies that no string model exists in the context. Value &gt;= 0 Specifies the index of the string model used to read the string. M_STRING_MODEL_LABEL Retrieves the label of the string model, in the Deep Learning OCR context, if one was used to read the string. ResultArrayPtr extra info Data type info: Data type: address of a MIL_INT Data type: address of a MIL_INT M_INVALID Specifies that no string model exists in the context. Value &gt;= 0 Specifies the label of the string model used to read the string. M_STRING_SCORE Retrieves the string score calculated during the read operation. The string score is the average score of the characters in the string. ResultArrayPtr extra info Data type info: Data type: address of a MIL_DOUBLE &nbsp;|&nbsp; array of type MIL_DOUBLE [optionally, in C++: a reference to a std::vector&lt;MIL_DOUBLE&gt; ] MORE Data type: address of a MIL_DOUBLE Note: When retrieving the result for a string in the result buffer. Data type: array of type MIL_DOUBLE [optionally, in C++: a reference to a std::vector&lt;MIL_DOUBLE&gt; ] Required array size (either of the following): MdlocrGetResult ( M_STRING_NUMBER ) MdlocrGetResult ( M_STRING_SCORE + M_NB_ELEMENTS ) Note: When retrieving the result for all strings in the result buffer. 0.0 &lt;= Value &lt;= 100.0 Specifies the string score. When retrieving global or string results (one or all), set the ResultType parameter to one of the values below. In this case, set the StringIndex parameter to one or all strings, M_GENERAL, or M_DEFAULT, and set the CharPositionIndex parameter to either M_GENERAL or M_DEFAULT. Note when the StringIndex parameter is set to either M_GENERAL or M_DEFAULT, the result type will be in reference to the region that encompasses all strings, as opposed to the region of the specific string(s). For retrieving global or string results ResultType Description ResultArrayPtr - Possible values returned M_STRING_ANGLE Retrieves the angle of the string's bounding box, or the bounding box encompassing all strings, in degrees. The angle is measured at the box's base and is relative to the output coordinate system (MdlocrControl() with M_RESULT_OUTPUT_UNITS). An angle interpreted with respect to the pixel coordinate system is always measured counter-clockwise, from the positive X-axis towards the negative Y-axis of the image. For information on the angle's direction of rotation when interpreting the angle with respect to the relative coordinate system, see the Angle convention in MIL subsection of the Working with real-world units section of Chapter 28: Calibrating your camera setup. ResultArrayPtr extra info Data type info: Data type: address of a MIL_DOUBLE &nbsp;|&nbsp; array of type MIL_DOUBLE [optionally, in C++: a reference to a std::vector&lt;MIL_DOUBLE&gt; ] MORE Data type: address of a MIL_DOUBLE Note: When retrieving the result for a string in the result buffer, or for a global result. Data type: array of type MIL_DOUBLE [optionally, in C++: a reference to a std::vector&lt;MIL_DOUBLE&gt; ] Required array size (either of the following): MdlocrGetResult ( M_STRING_NUMBER ) MdlocrGetResult ( M_STRING_ANGLE + M_NB_ELEMENTS ) Note: When retrieving results for all strings in the result buffer. M_STRING_BOX_BL_X Retrieves the X-coordinate of the bottom-left corner of the bounding box of the string, or the bounding box encompassing all strings, relative to the angle at which the string was found. ResultArrayPtr extra info Data type info: Data type: address of a MIL_DOUBLE &nbsp;|&nbsp; array of type MIL_DOUBLE [optionally, in C++: a reference to a std::vector&lt;MIL_DOUBLE&gt; ] MORE Data type: address of a MIL_DOUBLE Note: When retrieving the result for a string in the result buffer, or for a global result. Data type: array of type MIL_DOUBLE [optionally, in C++: a reference to a std::vector&lt;MIL_DOUBLE&gt; ] Required array size (either of the following): MdlocrGetResult ( M_STRING_NUMBER ) MdlocrGetResult ( M_STRING_BOX_BL_X + M_NB_ELEMENTS ) Note: When retrieving results for all strings in the result buffer. M_STRING_BOX_BL_Y Retrieves the Y-coordinate of the bottom-left corner of the bounding box of the string, or the bounding box encompassing all strings, relative to the angle at which the string was found. ResultArrayPtr extra info Data type info: Data type: address of a MIL_DOUBLE &nbsp;|&nbsp; array of type MIL_DOUBLE [optionally, in C++: a reference to a std::vector&lt;MIL_DOUBLE&gt; ] MORE Data type: address of a MIL_DOUBLE Note: When retrieving the result for a string in the result buffer, or for a global result. Data type: array of type MIL_DOUBLE [optionally, in C++: a reference to a std::vector&lt;MIL_DOUBLE&gt; ] Required array size (either of the following): MdlocrGetResult ( M_STRING_NUMBER ) MdlocrGetResult ( M_STRING_BOX_BL_Y + M_NB_ELEMENTS ) Note: When retrieving results for all strings in the result buffer. M_STRING_BOX_BR_X Retrieves the X-coordinate of the bottom-right corner of the bounding box of the string, or the bounding box encompassing all strings, relative to the angle at which the string was found. ResultArrayPtr extra info Data type info: Data type: address of a MIL_DOUBLE &nbsp;|&nbsp; array of type MIL_DOUBLE [optionally, in C++: a reference to a std::vector&lt;MIL_DOUBLE&gt; ] MORE Data type: address of a MIL_DOUBLE Note: When retrieving the result for a string in the result buffer, or for a global result. Data type: array of type MIL_DOUBLE [optionally, in C++: a reference to a std::vector&lt;MIL_DOUBLE&gt; ] Required array size (either of the following): MdlocrGetResult ( M_STRING_NUMBER ) MdlocrGetResult ( M_STRING_BOX_BR_X + M_NB_ELEMENTS ) Note: When retrieving results for all strings in the result buffer. M_STRING_BOX_BR_Y Retrieves the Y-coordinate of the bottom-right corner of the bounding box of the string, or the bounding box encompassing all strings, relative to the angle at which the string was found. ResultArrayPtr extra info Data type info: Data type: address of a MIL_DOUBLE &nbsp;|&nbsp; array of type MIL_DOUBLE [optionally, in C++: a reference to a std::vector&lt;MIL_DOUBLE&gt; ] MORE Data type: address of a MIL_DOUBLE Note: When retrieving the result for a string in the result buffer, or for a global result. Data type: array of type MIL_DOUBLE [optionally, in C++: a reference to a std::vector&lt;MIL_DOUBLE&gt; ] Required array size (either of the following): MdlocrGetResult ( M_STRING_NUMBER ) MdlocrGetResult ( M_STRING_BOX_BR_Y + M_NB_ELEMENTS ) Note: When retrieving results for all strings in the result buffer. M_STRING_BOX_UL_X Retrieves the X-coordinate of the upper-left corner of the bounding box of the string, or the bounding box encompassing all strings, relative to the angle at which the string was found. ResultArrayPtr extra info Data type info: Data type: address of a MIL_DOUBLE &nbsp;|&nbsp; array of type MIL_DOUBLE [optionally, in C++: a reference to a std::vector&lt;MIL_DOUBLE&gt; ] MORE Data type: address of a MIL_DOUBLE Note: When retrieving the result for a string in the result buffer, or for a global result. Data type: array of type MIL_DOUBLE [optionally, in C++: a reference to a std::vector&lt;MIL_DOUBLE&gt; ] Required array size (either of the following): MdlocrGetResult ( M_STRING_NUMBER ) MdlocrGetResult ( M_STRING_BOX_UL_X + M_NB_ELEMENTS ) Note: When retrieving results for all strings in the result buffer. M_STRING_BOX_UL_Y Retrieves the Y-coordinate of the upper-left corner of the bounding box of the string, or the bounding box encompassing all strings, relative to the angle at which the string was found. ResultArrayPtr extra info Data type info: Data type: address of a MIL_DOUBLE &nbsp;|&nbsp; array of type MIL_DOUBLE [optionally, in C++: a reference to a std::vector&lt;MIL_DOUBLE&gt; ] MORE Data type: address of a MIL_DOUBLE Note: When retrieving the result for a string in the result buffer, or for a global result. Data type: array of type MIL_DOUBLE [optionally, in C++: a reference to a std::vector&lt;MIL_DOUBLE&gt; ] Required array size (either of the following): MdlocrGetResult ( M_STRING_NUMBER ) MdlocrGetResult ( M_STRING_BOX_UL_Y + M_NB_ELEMENTS ) Note: When retrieving results for all strings in the result buffer. M_STRING_BOX_UR_X Retrieves the X-coordinate of the upper-right corner of the bounding box of the string, or the bounding box encompassing all strings, relative to the angle at which the string was found. ResultArrayPtr extra info Data type info: Data type: address of a MIL_DOUBLE &nbsp;|&nbsp; array of type MIL_DOUBLE [optionally, in C++: a reference to a std::vector&lt;MIL_DOUBLE&gt; ] MORE Data type: address of a MIL_DOUBLE Note: When retrieving the result for a string in the result buffer, or for a global result. Data type: array of type MIL_DOUBLE [optionally, in C++: a reference to a std::vector&lt;MIL_DOUBLE&gt; ] Required array size (either of the following): MdlocrGetResult ( M_STRING_NUMBER ) MdlocrGetResult ( M_STRING_BOX_UR_X + M_NB_ELEMENTS ) Note: When retrieving results for all strings in the result buffer. M_STRING_BOX_UR_Y Retrieves the Y-coordinate of the upper-right corner of the bounding box of the string, or the bounding box encompassing all strings, relative to the angle at which the string was found. ResultArrayPtr extra info Data type info: Data type: address of a MIL_DOUBLE &nbsp;|&nbsp; array of type MIL_DOUBLE [optionally, in C++: a reference to a std::vector&lt;MIL_DOUBLE&gt; ] MORE Data type: address of a MIL_DOUBLE Note: When retrieving the result for a string in the result buffer, or for a global result. Data type: array of type MIL_DOUBLE [optionally, in C++: a reference to a std::vector&lt;MIL_DOUBLE&gt; ] Required array size (either of the following): MdlocrGetResult ( M_STRING_NUMBER ) MdlocrGetResult ( M_STRING_BOX_UR_Y + M_NB_ELEMENTS ) Note: When retrieving results for all strings in the result buffer. M_STRING_HEIGHT Retrieves the height of the string's bounding box, or the bounding box encompassing all strings. ResultArrayPtr extra info Data type info: Data type: address of a MIL_DOUBLE &nbsp;|&nbsp; array of type MIL_DOUBLE [optionally, in C++: a reference to a std::vector&lt;MIL_DOUBLE&gt; ] MORE Data type: address of a MIL_DOUBLE Note: When retrieving the result for a string in the result buffer, or for a global result. Data type: array of type MIL_DOUBLE [optionally, in C++: a reference to a std::vector&lt;MIL_DOUBLE&gt; ] Required array size (either of the following): MdlocrGetResult ( M_STRING_NUMBER ) MdlocrGetResult ( M_STRING_HEIGHT + M_NB_ELEMENTS ) Note: When retrieving results for all strings in the result buffer. M_STRING_POSITION_X Retrieves the X-coordinate of the center of the bounding box of the string, or the bounding box encompassing all strings; this position is considered the position of the string, or bounding box of all strings. ResultArrayPtr extra info Data type info: Data type: address of a MIL_DOUBLE &nbsp;|&nbsp; array of type MIL_DOUBLE [optionally, in C++: a reference to a std::vector&lt;MIL_DOUBLE&gt; ] MORE Data type: address of a MIL_DOUBLE Note: When retrieving the result for a string in the result buffer, or for a global result. Data type: array of type MIL_DOUBLE [optionally, in C++: a reference to a std::vector&lt;MIL_DOUBLE&gt; ] Required array size (either of the following): MdlocrGetResult ( M_STRING_NUMBER ) MdlocrGetResult ( M_STRING_POSITION_X + M_NB_ELEMENTS ) Note: When retrieving results for all strings in the result buffer. M_STRING_POSITION_Y Retrieves the Y-coordinate of the center of the bounding box of the string, or the bounding box encompassing all strings; this position is considered the position of the string, or bounding box of all strings. ResultArrayPtr extra info Data type info: Data type: address of a MIL_DOUBLE &nbsp;|&nbsp; array of type MIL_DOUBLE [optionally, in C++: a reference to a std::vector&lt;MIL_DOUBLE&gt; ] MORE Data type: address of a MIL_DOUBLE Note: When retrieving the result for a string in the result buffer, or for a global result. Data type: array of type MIL_DOUBLE [optionally, in C++: a reference to a std::vector&lt;MIL_DOUBLE&gt; ] Required array size (either of the following): MdlocrGetResult ( M_STRING_NUMBER ) MdlocrGetResult ( M_STRING_POSITION_Y + M_NB_ELEMENTS ) Note: When retrieving results for all strings in the result buffer. M_STRING_WIDTH Retrieves the width of the string's bounding box, or the bounding box encompassing all strings. ResultArrayPtr extra info Data type info: Data type: address of a MIL_DOUBLE &nbsp;|&nbsp; array of type MIL_DOUBLE [optionally, in C++: a reference to a std::vector&lt;MIL_DOUBLE&gt; ] MORE Data type: address of a MIL_DOUBLE Note: When retrieving the result for a string in the result buffer, or for a global result. Data type: array of type MIL_DOUBLE [optionally, in C++: a reference to a std::vector&lt;MIL_DOUBLE&gt; ] Required array size (either of the following): MdlocrGetResult ( M_STRING_NUMBER ) MdlocrGetResult ( M_STRING_WIDTH + M_NB_ELEMENTS ) Note: When retrieving results for all strings in the result buffer. When retrieving results for characters in a string, set the ResultType parameter to one of the values below. In this case, set the StringIndex parameter to a string (one or all), and set the CharPositionIndex parameter to a character (one or all). Characters are ordered by their index position in their string. For retrieving character results ResultType Description ResultArrayPtr - Possible values returned M_CHAR_BOX_BL_X Retrieves the X-coordinate of the bottom-left corner of the character's bounding box, relative to the angle at which the character was found. ResultArrayPtr extra info Data type info: Data type: address of a MIL_DOUBLE &nbsp;|&nbsp; array of type MIL_DOUBLE [optionally, in C++: a reference to a std::vector&lt;MIL_DOUBLE&gt; ] MORE Data type: address of a MIL_DOUBLE Note: When retrieving the result for a character in a string. Data type: array of type MIL_DOUBLE [optionally, in C++: a reference to a std::vector&lt;MIL_DOUBLE&gt; ] Required array size (either of the following): MdlocrGetResult ( M_STRING_NUMBER ) MdlocrGetResult ( M_CHAR_BOX_BL_X + M_NB_ELEMENTS ) Note: When retrieving the result for a character in all strings. Data type: array of type MIL_DOUBLE [optionally, in C++: a reference to a std::vector&lt;MIL_DOUBLE&gt; ] Required array size (either of the following): MdlocrGetResult ( M_STRING_CHAR_NUMBER ) MdlocrGetResult ( M_CHAR_BOX_BL_X + M_NB_ELEMENTS ) Note: When retrieving the result for all characters in a string. Data type: array of type MIL_DOUBLE [optionally, in C++: a reference to a std::vector&lt;MIL_DOUBLE&gt; ] Required array size: MdlocrGetResult ( M_CHAR_BOX_BL_X + M_NB_ELEMENTS ) Note: When retrieving the result for all characters in all strings. The required array size is equivalent to the sum of the number of characters read (M_STRING_CHAR_NUMBER) for all strings read (M_STRING_NUMBER). M_CHAR_BOX_BL_Y Retrieves the Y-coordinate of the bottom-left corner of the character's bounding box, relative to the angle at which the character was found. ResultArrayPtr extra info Data type info: Data type: address of a MIL_DOUBLE &nbsp;|&nbsp; array of type MIL_DOUBLE [optionally, in C++: a reference to a std::vector&lt;MIL_DOUBLE&gt; ] MORE Data type: address of a MIL_DOUBLE Note: When retrieving the result for a character in a string. Data type: array of type MIL_DOUBLE [optionally, in C++: a reference to a std::vector&lt;MIL_DOUBLE&gt; ] Required array size (either of the following): MdlocrGetResult ( M_STRING_NUMBER ) MdlocrGetResult ( M_CHAR_BOX_BL_Y + M_NB_ELEMENTS ) Note: When retrieving the result for a character in all strings. Data type: array of type MIL_DOUBLE [optionally, in C++: a reference to a std::vector&lt;MIL_DOUBLE&gt; ] Required array size (either of the following): MdlocrGetResult ( M_STRING_CHAR_NUMBER ) MdlocrGetResult ( M_CHAR_BOX_BL_Y + M_NB_ELEMENTS ) Note: When retrieving the result for all characters in a string. Data type: array of type MIL_DOUBLE [optionally, in C++: a reference to a std::vector&lt;MIL_DOUBLE&gt; ] Required array size: MdlocrGetResult ( M_CHAR_BOX_BL_Y + M_NB_ELEMENTS ) Note: When retrieving the result for all characters in all strings. The required array size is equivalent to the sum of the number of characters read (M_STRING_CHAR_NUMBER) for all strings read (M_STRING_NUMBER). M_CHAR_BOX_BR_X Retrieves the X-coordinate of the bottom-right corner of the character's bounding box, relative to the angle at which the character was found. ResultArrayPtr extra info Data type info: Data type: address of a MIL_DOUBLE &nbsp;|&nbsp; array of type MIL_DOUBLE [optionally, in C++: a reference to a std::vector&lt;MIL_DOUBLE&gt; ] MORE Data type: address of a MIL_DOUBLE Note: When retrieving the result for a character in a string. Data type: array of type MIL_DOUBLE [optionally, in C++: a reference to a std::vector&lt;MIL_DOUBLE&gt; ] Required array size (either of the following): MdlocrGetResult ( M_STRING_NUMBER ) MdlocrGetResult ( M_CHAR_BOX_BR_X + M_NB_ELEMENTS ) Note: When retrieving the result for a character in all strings. Data type: array of type MIL_DOUBLE [optionally, in C++: a reference to a std::vector&lt;MIL_DOUBLE&gt; ] Required array size (either of the following): MdlocrGetResult ( M_STRING_CHAR_NUMBER ) MdlocrGetResult ( M_CHAR_BOX_BR_X + M_NB_ELEMENTS ) Note: When retrieving the result for all characters in a string. Data type: array of type MIL_DOUBLE [optionally, in C++: a reference to a std::vector&lt;MIL_DOUBLE&gt; ] Required array size: MdlocrGetResult ( M_CHAR_BOX_BR_X + M_NB_ELEMENTS ) Note: When retrieving the result for all characters in all strings. The required array size is equivalent to the sum of the number of characters read (M_STRING_CHAR_NUMBER) for all strings read (M_STRING_NUMBER). M_CHAR_BOX_BR_Y Retrieves the Y-coordinate of the bottom-right corner of the character's bounding box, relative to the angle at which the character was found. ResultArrayPtr extra info Data type info: Data type: address of a MIL_DOUBLE &nbsp;|&nbsp; array of type MIL_DOUBLE [optionally, in C++: a reference to a std::vector&lt;MIL_DOUBLE&gt; ] MORE Data type: address of a MIL_DOUBLE Note: When retrieving the result for a character in a string. Data type: array of type MIL_DOUBLE [optionally, in C++: a reference to a std::vector&lt;MIL_DOUBLE&gt; ] Required array size (either of the following): MdlocrGetResult ( M_STRING_NUMBER ) MdlocrGetResult ( M_CHAR_BOX_BR_Y + M_NB_ELEMENTS ) Note: When retrieving the result for a character in all strings. Data type: array of type MIL_DOUBLE [optionally, in C++: a reference to a std::vector&lt;MIL_DOUBLE&gt; ] Required array size (either of the following): MdlocrGetResult ( M_STRING_CHAR_NUMBER ) MdlocrGetResult ( M_CHAR_BOX_BR_Y + M_NB_ELEMENTS ) Note: When retrieving the result for all characters in a string. Data type: array of type MIL_DOUBLE [optionally, in C++: a reference to a std::vector&lt;MIL_DOUBLE&gt; ] Required array size: MdlocrGetResult ( M_CHAR_BOX_BR_Y + M_NB_ELEMENTS ) Note: When retrieving the result for all characters in all strings. The required array size is equivalent to the sum of the number of characters read (M_STRING_CHAR_NUMBER) for all strings read (M_STRING_NUMBER). M_CHAR_BOX_UL_X Retrieves the X-coordinate of the upper-left corner of the character's bounding box, relative to the angle at which the character was found. ResultArrayPtr extra info Data type info: Data type: address of a MIL_DOUBLE &nbsp;|&nbsp; array of type MIL_DOUBLE [optionally, in C++: a reference to a std::vector&lt;MIL_DOUBLE&gt; ] MORE Data type: address of a MIL_DOUBLE Note: When retrieving the result for a character in a string. Data type: array of type MIL_DOUBLE [optionally, in C++: a reference to a std::vector&lt;MIL_DOUBLE&gt; ] Required array size (either of the following): MdlocrGetResult ( M_STRING_NUMBER ) MdlocrGetResult ( M_CHAR_BOX_UL_X + M_NB_ELEMENTS ) Note: When retrieving the result for a character in all strings. Data type: array of type MIL_DOUBLE [optionally, in C++: a reference to a std::vector&lt;MIL_DOUBLE&gt; ] Required array size (either of the following): MdlocrGetResult ( M_STRING_CHAR_NUMBER ) MdlocrGetResult ( M_CHAR_BOX_UL_X + M_NB_ELEMENTS ) Note: When retrieving the result for all characters in a string. Data type: array of type MIL_DOUBLE [optionally, in C++: a reference to a std::vector&lt;MIL_DOUBLE&gt; ] Required array size: MdlocrGetResult ( M_CHAR_BOX_UL_X + M_NB_ELEMENTS ) Note: When retrieving the result for all characters in all strings. The required array size is equivalent to the sum of the number of characters read (M_STRING_CHAR_NUMBER) for all strings read (M_STRING_NUMBER). M_CHAR_BOX_UL_Y Retrieves the Y-coordinate of the upper-left corner of the character's bounding box, relative to the angle at which the character was found. ResultArrayPtr extra info Data type info: Data type: address of a MIL_DOUBLE &nbsp;|&nbsp; array of type MIL_DOUBLE [optionally, in C++: a reference to a std::vector&lt;MIL_DOUBLE&gt; ] MORE Data type: address of a MIL_DOUBLE Note: When retrieving the result for a character in a string. Data type: array of type MIL_DOUBLE [optionally, in C++: a reference to a std::vector&lt;MIL_DOUBLE&gt; ] Required array size (either of the following): MdlocrGetResult ( M_STRING_NUMBER ) MdlocrGetResult ( M_CHAR_BOX_UL_Y + M_NB_ELEMENTS ) Note: When retrieving the result for a character in all strings. Data type: array of type MIL_DOUBLE [optionally, in C++: a reference to a std::vector&lt;MIL_DOUBLE&gt; ] Required array size (either of the following): MdlocrGetResult ( M_STRING_CHAR_NUMBER ) MdlocrGetResult ( M_CHAR_BOX_UL_Y + M_NB_ELEMENTS ) Note: When retrieving the result for all characters in a string. Data type: array of type MIL_DOUBLE [optionally, in C++: a reference to a std::vector&lt;MIL_DOUBLE&gt; ] Required array size: MdlocrGetResult ( M_CHAR_BOX_UL_Y + M_NB_ELEMENTS ) Note: When retrieving the result for all characters in all strings. The required array size is equivalent to the sum of the number of characters read (M_STRING_CHAR_NUMBER) for all strings read (M_STRING_NUMBER). M_CHAR_BOX_UR_X Retrieves the X-coordinate of the upper-right corner of the character's bounding box, relative to the angle at which the character was found. ResultArrayPtr extra info Data type info: Data type: address of a MIL_DOUBLE &nbsp;|&nbsp; array of type MIL_DOUBLE [optionally, in C++: a reference to a std::vector&lt;MIL_DOUBLE&gt; ] MORE Data type: address of a MIL_DOUBLE Note: When retrieving the result for a character in a string. Data type: array of type MIL_DOUBLE [optionally, in C++: a reference to a std::vector&lt;MIL_DOUBLE&gt; ] Required array size (either of the following): MdlocrGetResult ( M_STRING_NUMBER ) MdlocrGetResult ( M_CHAR_BOX_UR_X + M_NB_ELEMENTS ) Note: When retrieving the result for a character in all strings. Data type: array of type MIL_DOUBLE [optionally, in C++: a reference to a std::vector&lt;MIL_DOUBLE&gt; ] Required array size (either of the following): MdlocrGetResult ( M_STRING_CHAR_NUMBER ) MdlocrGetResult ( M_CHAR_BOX_UR_X + M_NB_ELEMENTS ) Note: When retrieving the result for all characters in a string. Data type: array of type MIL_DOUBLE [optionally, in C++: a reference to a std::vector&lt;MIL_DOUBLE&gt; ] Required array size: MdlocrGetResult ( M_CHAR_BOX_UR_X + M_NB_ELEMENTS ) Note: When retrieving the result for all characters in all strings. The required array size is equivalent to the sum of the number of characters read (M_STRING_CHAR_NUMBER) for all strings read (M_STRING_NUMBER). M_CHAR_BOX_UR_Y Retrieves the Y-coordinate of the upper-right corner of the character's bounding box, relative to the angle at which the character was found. ResultArrayPtr extra info Data type info: Data type: address of a MIL_DOUBLE &nbsp;|&nbsp; array of type MIL_DOUBLE [optionally, in C++: a reference to a std::vector&lt;MIL_DOUBLE&gt; ] MORE Data type: address of a MIL_DOUBLE Note: When retrieving the result for a character in a string. Data type: array of type MIL_DOUBLE [optionally, in C++: a reference to a std::vector&lt;MIL_DOUBLE&gt; ] Required array size (either of the following): MdlocrGetResult ( M_STRING_NUMBER ) MdlocrGetResult ( M_CHAR_BOX_UR_Y + M_NB_ELEMENTS ) Note: When retrieving the result for a character in all strings. Data type: array of type MIL_DOUBLE [optionally, in C++: a reference to a std::vector&lt;MIL_DOUBLE&gt; ] Required array size (either of the following): MdlocrGetResult ( M_STRING_CHAR_NUMBER ) MdlocrGetResult ( M_CHAR_BOX_UR_Y + M_NB_ELEMENTS ) Note: When retrieving the result for all characters in a string. Data type: array of type MIL_DOUBLE [optionally, in C++: a reference to a std::vector&lt;MIL_DOUBLE&gt; ] Required array size: MdlocrGetResult ( M_CHAR_BOX_UR_Y + M_NB_ELEMENTS ) Note: When retrieving the result for all characters in all strings. The required array size is equivalent to the sum of the number of characters read (M_STRING_CHAR_NUMBER) for all strings read (M_STRING_NUMBER). M_CHAR_HEIGHT Retrieves the height of the character's bounding box. ResultArrayPtr extra info Data type info: Data type: address of a MIL_DOUBLE &nbsp;|&nbsp; array of type MIL_DOUBLE [optionally, in C++: a reference to a std::vector&lt;MIL_DOUBLE&gt; ] MORE Data type: address of a MIL_DOUBLE Note: When retrieving the result for a character in a string. Data type: array of type MIL_DOUBLE [optionally, in C++: a reference to a std::vector&lt;MIL_DOUBLE&gt; ] Required array size (either of the following): MdlocrGetResult ( M_STRING_NUMBER ) MdlocrGetResult ( M_CHAR_HEIGHT + M_NB_ELEMENTS ) Note: When retrieving the result for a character in all strings. Data type: array of type MIL_DOUBLE [optionally, in C++: a reference to a std::vector&lt;MIL_DOUBLE&gt; ] Required array size (either of the following): MdlocrGetResult ( M_STRING_CHAR_NUMBER ) MdlocrGetResult ( M_CHAR_HEIGHT + M_NB_ELEMENTS ) Note: When retrieving the result for all characters in a string. Data type: array of type MIL_DOUBLE [optionally, in C++: a reference to a std::vector&lt;MIL_DOUBLE&gt; ] Required array size: MdlocrGetResult ( M_CHAR_HEIGHT + M_NB_ELEMENTS ) Note: When retrieving the result for all characters in all strings. The required array size is equivalent to the sum of the number of characters read (M_STRING_CHAR_NUMBER) for all strings read (M_STRING_NUMBER). M_CHAR_NAME Retrieves the name of the character in the string that was read. The name is returned as a regular string. It consists of the character name and the terminating null character. Note that M_CHAR_NAME cannot be used when the StringIndex parameter is set to M_ALL or when the CharPositionIndex parameter is set to M_ALL. ResultArrayPtr extra info Data type info: Data type: array of type MIL_TEXT_CHAR MORE Data type: array of type MIL_TEXT_CHAR Required array size: MdlocrGetResult ( M_CHAR_NAME + M_STRING_SIZE ) Note: When retrieving the result for a character in a string. M_CHAR_POSITION_X Retrieves the X-coordinate of the center of the bounding box of the character; this position is considered the position of the character. ResultArrayPtr extra info Data type info: Data type: address of a MIL_DOUBLE &nbsp;|&nbsp; array of type MIL_DOUBLE [optionally, in C++: a reference to a std::vector&lt;MIL_DOUBLE&gt; ] MORE Data type: address of a MIL_DOUBLE Note: When retrieving the result for a character in a string. Data type: array of type MIL_DOUBLE [optionally, in C++: a reference to a std::vector&lt;MIL_DOUBLE&gt; ] Required array size (either of the following): MdlocrGetResult ( M_STRING_NUMBER ) MdlocrGetResult ( M_CHAR_POSITION_X + M_NB_ELEMENTS ) Note: When retrieving the result for a character in all strings. Data type: array of type MIL_DOUBLE [optionally, in C++: a reference to a std::vector&lt;MIL_DOUBLE&gt; ] Required array size (either of the following): MdlocrGetResult ( M_STRING_CHAR_NUMBER ) MdlocrGetResult ( M_CHAR_POSITION_X + M_NB_ELEMENTS ) Note: When retrieving the result for all characters in a string. Data type: array of type MIL_DOUBLE [optionally, in C++: a reference to a std::vector&lt;MIL_DOUBLE&gt; ] Required array size: MdlocrGetResult ( M_CHAR_POSITION_X + M_NB_ELEMENTS ) Note: When retrieving the result for all characters in all strings. The required array size is equivalent to the sum of the number of characters read (M_STRING_CHAR_NUMBER) for all strings read (M_STRING_NUMBER). M_CHAR_POSITION_Y Retrieves the Y-coordinate of the center of the bounding box of the character; this position is considered the position of the character. ResultArrayPtr extra info Data type info: Data type: address of a MIL_DOUBLE &nbsp;|&nbsp; array of type MIL_DOUBLE [optionally, in C++: a reference to a std::vector&lt;MIL_DOUBLE&gt; ] MORE Data type: address of a MIL_DOUBLE Note: When retrieving the result for a character in a string. Data type: array of type MIL_DOUBLE [optionally, in C++: a reference to a std::vector&lt;MIL_DOUBLE&gt; ] Required array size (either of the following): MdlocrGetResult ( M_STRING_NUMBER ) MdlocrGetResult ( M_CHAR_POSITION_Y + M_NB_ELEMENTS ) Note: When retrieving the result for a character in all strings. Data type: array of type MIL_DOUBLE [optionally, in C++: a reference to a std::vector&lt;MIL_DOUBLE&gt; ] Required array size (either of the following): MdlocrGetResult ( M_STRING_CHAR_NUMBER ) MdlocrGetResult ( M_CHAR_POSITION_Y + M_NB_ELEMENTS ) Note: When retrieving the result for all characters in a string. Data type: array of type MIL_DOUBLE [optionally, in C++: a reference to a std::vector&lt;MIL_DOUBLE&gt; ] Required array size: MdlocrGetResult ( M_CHAR_POSITION_Y + M_NB_ELEMENTS ) Note: When retrieving the result for all characters in all strings. The required array size is equivalent to the sum of the number of characters read (M_STRING_CHAR_NUMBER) for all strings read (M_STRING_NUMBER). M_CHAR_SCORE Retrieves the character's score. This quantifies the confidence that the Deep Learning OCR module has correctly predicted the character. ResultArrayPtr extra info Data type info: Data type: address of a MIL_DOUBLE &nbsp;|&nbsp; array of type MIL_DOUBLE [optionally, in C++: a reference to a std::vector&lt;MIL_DOUBLE&gt; ] MORE Data type: address of a MIL_DOUBLE Note: When retrieving the result for a character in a string. Data type: array of type MIL_DOUBLE [optionally, in C++: a reference to a std::vector&lt;MIL_DOUBLE&gt; ] Required array size (either of the following): MdlocrGetResult ( M_STRING_NUMBER ) MdlocrGetResult ( M_CHAR_SCORE + M_NB_ELEMENTS ) Note: When retrieving the result for a character in all strings. Data type: array of type MIL_DOUBLE [optionally, in C++: a reference to a std::vector&lt;MIL_DOUBLE&gt; ] Required array size (either of the following): MdlocrGetResult ( M_STRING_CHAR_NUMBER ) MdlocrGetResult ( M_CHAR_SCORE + M_NB_ELEMENTS ) Note: When retrieving the result for all characters in a string. Data type: array of type MIL_DOUBLE [optionally, in C++: a reference to a std::vector&lt;MIL_DOUBLE&gt; ] Required array size: MdlocrGetResult ( M_CHAR_SCORE + M_NB_ELEMENTS ) Note: When retrieving the result for all characters in all strings. The required array size is equivalent to the sum of the number of characters read (M_STRING_CHAR_NUMBER) for all strings read (M_STRING_NUMBER). 0 &lt;= Value &lt;= 100 Specifies the character score. M_CHAR_WIDTH Retrieves the width of the character's bounding box. ResultArrayPtr extra info Data type info: Data type: address of a MIL_DOUBLE &nbsp;|&nbsp; array of type MIL_DOUBLE [optionally, in C++: a reference to a std::vector&lt;MIL_DOUBLE&gt; ] MORE Data type: address of a MIL_DOUBLE Note: When retrieving the result for a character in a string. Data type: array of type MIL_DOUBLE [optionally, in C++: a reference to a std::vector&lt;MIL_DOUBLE&gt; ] Required array size (either of the following): MdlocrGetResult ( M_STRING_NUMBER ) MdlocrGetResult ( M_CHAR_WIDTH + M_NB_ELEMENTS ) Note: When retrieving the result for a character in all strings. Data type: array of type MIL_DOUBLE [optionally, in C++: a reference to a std::vector&lt;MIL_DOUBLE&gt; ] Required array size (either of the following): MdlocrGetResult ( M_STRING_CHAR_NUMBER ) MdlocrGetResult ( M_CHAR_WIDTH + M_NB_ELEMENTS ) Note: When retrieving the result for all characters in a string. Data type: array of type MIL_DOUBLE [optionally, in C++: a reference to a std::vector&lt;MIL_DOUBLE&gt; ] Required array size: MdlocrGetResult ( M_CHAR_WIDTH + M_NB_ELEMENTS ) Note: When retrieving the result for all characters in all strings. The required array size is equivalent to the sum of the number of characters read (M_STRING_CHAR_NUMBER) for all strings read (M_STRING_NUMBER). Combination value for M_STRING , M_CHAR_NAME. You can add the following value to the above-mentioned values to get the size of a string. For retrieving the size of a string ResultType combination value Description ResultArrayPtr - Possible values returned M_STRING_SIZE Retrieves the number of characters in the string, including the terminating null character. For M_CHAR_NAME, the name of each letter at each position is itself a string, with its own terminating null character. You would need to sum them all to get the required array size for a string. For a specific string, M_CHAR_NAME + M_STRING_SIZE returns the number of characters in the string plus 1 for each character's terminating null character. ResultArrayPtr extra info Data type info: Data type: address of a MIL_INT Data type: address of a MIL_INT Combination value for Tables: For retrieving global results For retrieving string results For retrieving global or string results For retrieving character results the values listed in all the parameter association tables. You can add the following value to the above-mentioned values to determine whether a result is available. For determining whether results are available ResultType Description ResultArrayPtr - Possible values returned M_AVAILABLE Retrieves whether the requested result type is available for retrieval. ResultArrayPtr extra info Data type info: Data type: array of type MIL_INT [optionally, in C++: a reference to a std::vector&lt;MIL_INT&gt; ] &nbsp;|&nbsp; address of a MIL_INT MORE Data type: array of type MIL_INT [optionally, in C++: a reference to a std::vector&lt;MIL_INT&gt; ] Required array size:(defined elsewhere) Note: When multiple results. Data type: address of a MIL_INT Note: When a single result. M_FALSE Specifies that the requested result type is not available. M_TRUE Specifies that the requested result type is available. Combination value for Tables: For retrieving string results For retrieving global or string results For retrieving character results the values listed in all the parameter association tables except For retrieving global results. You can add the following value to the above-mentioned values to determine the required array size (number of elements) to store the returned values. For determining the required array size (number of elements) to store the returned values ResultType combination value Description ResultArrayPtr - Possible values returned M_NB_ELEMENTS Retrieves the required array size (number of elements) to store the returned values. ResultArrayPtr extra info Data type info: Data type: address of a MIL_INT Data type: address of a MIL_INT Combination values for the values listed in For retrieving global results, For retrieving global or string results; and for the following values: M_SKIPPED_POSITIONS , M_STRING_CHAR_NUMBER , M_STRING_MODEL_INDEX , M_STRING_MODEL_LABEL , M_STRING_SCORE , M_CHAR_BOX_BL_X , M_CHAR_BOX_BL_Y , M_CHAR_BOX_BR_X , M_CHAR_BOX_BR_Y , M_CHAR_BOX_UL_X , M_CHAR_BOX_UL_Y , M_CHAR_BOX_UR_X , M_CHAR_BOX_UR_Y , M_CHAR_HEIGHT , M_CHAR_POSITION_X , M_CHAR_POSITION_Y , M_CHAR_SCORE , M_CHAR_WIDTH , M_STRING_SIZE. You can add one of the following values to the above-mentioned values to cast the requested results to a required data type. Note: In C++, when using a standard vector (std::vector) instead of an array, the values listed in this combination table must not be used. If you need to use a specific data type, instantiate the vector with the necessary data type. For casting the result to a required data type ResultType Description ResultArrayPtr - Possible values returned M_TYPE_MIL_DOUBLE Casts the requested results to a MIL_DOUBLE. ResultArrayPtr extra info Data type info: Data type: address of a MIL_DOUBLE &nbsp;|&nbsp; array of type MIL_DOUBLE [optionally, in C++: a reference to a std::vector&lt;MIL_DOUBLE&gt; ] MORE Data type: address of a MIL_DOUBLE Note: When a single result. Data type: array of type MIL_DOUBLE [optionally, in C++: a reference to a std::vector&lt;MIL_DOUBLE&gt; ] Required array size:(defined elsewhere) Note: When multiple results. M_TYPE_MIL_FLOAT Casts the requested results to a MIL_FLOAT. ResultArrayPtr extra info Data type info: Data type: address of a MIL_FLOAT &nbsp;|&nbsp; array of type MIL_FLOAT [optionally, in C++: a reference to a std::vector&lt;MIL_FLOAT&gt; ] MORE Data type: address of a MIL_FLOAT Note: When a single result. Data type: array of type MIL_FLOAT [optionally, in C++: a reference to a std::vector&lt;MIL_FLOAT&gt; ] Required array size:(defined elsewhere) Note: When multiple results. M_TYPE_MIL_ID Casts the requested results to a MIL_ID. ResultArrayPtr extra info Data type info: Data type: address of a MIL_ID &nbsp;|&nbsp; array of type MIL_ID [optionally, in C++: a reference to a std::vector&lt;MIL_ID&gt; ] MORE Data type: address of a MIL_ID Note: When a single result. Data type: array of type MIL_ID [optionally, in C++: a reference to a std::vector&lt;MIL_ID&gt; ] Required array size:(defined elsewhere) Note: When multiple results. M_TYPE_MIL_INT Casts the requested results to a MIL_INT. ResultArrayPtr extra info Data type info: Data type: address of a MIL_INT &nbsp;|&nbsp; array of type MIL_INT [optionally, in C++: a reference to a std::vector&lt;MIL_INT&gt; ] MORE Data type: address of a MIL_INT Note: When a single result. Data type: array of type MIL_INT [optionally, in C++: a reference to a std::vector&lt;MIL_INT&gt; ] Required array size:(defined elsewhere) Note: When multiple results. M_TYPE_MIL_INT16 Casts the requested results to a MIL_INT16. ResultArrayPtr extra info Data type info: Data type: address of a MIL_INT16 &nbsp;|&nbsp; array of type MIL_INT16 [optionally, in C++: a reference to a std::vector&lt;MIL_INT16&gt; ] MORE Data type: address of a MIL_INT16 Note: When a single result. Data type: array of type MIL_INT16 [optionally, in C++: a reference to a std::vector&lt;MIL_INT16&gt; ] Required array size:(defined elsewhere) Note: When multiple results. M_TYPE_MIL_INT32 Casts the requested results to a MIL_INT32. ResultArrayPtr extra info Data type info: Data type: address of a MIL_INT32 &nbsp;|&nbsp; array of type MIL_INT32 [optionally, in C++: a reference to a std::vector&lt;MIL_INT32&gt; ] MORE Data type: address of a MIL_INT32 Note: When a single result. Data type: array of type MIL_INT32 [optionally, in C++: a reference to a std::vector&lt;MIL_INT32&gt; ] Required array size:(defined elsewhere) Note: When multiple results. M_TYPE_MIL_INT64 Casts the requested results to a MIL_INT64. ResultArrayPtr extra info Data type info: Data type: address of a MIL_INT64 &nbsp;|&nbsp; array of type MIL_INT64 [optionally, in C++: a reference to a std::vector&lt;MIL_INT64&gt; ] MORE Data type: address of a MIL_INT64 Note: When a single result. Data type: array of type MIL_INT64 [optionally, in C++: a reference to a std::vector&lt;MIL_INT64&gt; ] Required array size:(defined elsewhere) Note: When multiple results. Compilation information Header Include mil.h. Library Use mil.lib; mildlocr.lib. DLL Requires mil.dll; mildlocr.dll. Syntax Description Parameters - ResultDlocrId - StringIndex For specifying the string for which to get results, or for specifying global results - CharPositionIndex For specifying the character for which to get results, or for specifying global or string results - ResultType - ResultArrayPtr Parameter Associations For retrieving global results For retrieving string results For retrieving global or string results For retrieving character results + For retrieving the size of a string + For determining whether results are available + For determining the required array size (number of elements) to store the returned values + For casting the result to a required data type Compilation information ",
      "wordCount": 7438,
      "subEntries": []
    },
    {
      "id": "Reference_dlocr_MdlocrGetStringIndex",
      "version": null,
      "title": "MdlocrGetStringIndex",
      "subTitles": null,
      "location": "MIL Reference",
      "pageURL": "content\\Reference\\dlocr\\MdlocrGetStringIndex.htm",
      "text": " MdlocrGetStringIndex Synopsis Get the index of a string that touches a specified image position, from a Deep Learning OCR result buffer. Syntax MIL_INT64 MdlocrGetStringIndex( MIL_ID&nbsp;ResultDlocrId, //in MIL_DOUBLE&nbsp;PositionX, //in MIL_DOUBLE&nbsp;PositionY, //in MIL_INT64&nbsp;*StringIndexPtr //out ) Description This function retrieves the index of a string that touches a specified image position, from a Deep Learning OCR result buffer. This is useful, for example, in combination with MdlocrDefineModelFromResult() to define a string model from a position on an image. You can establish the position of the string of interest by drawing the results using MdlocrDraw(). Parameters Parameters ResultDlocrId Specifies the identifier of the Deep Learning OCR result buffer from which to retrieve results. PositionX Specifies the X-position in the image at which to find a string. You can change whether to use pixel or world coordinates using MdlocrControl() with M_RESULT_OUTPUT_UNITS. PositionY Specifies the Y-position in the image at which to find a string. You can change whether to use pixel or world coordinates using MdlocrControl() with M_RESULT_OUTPUT_UNITS. StringIndexPtr Specifies the address in which to write the index of the string if one is found touching the specified position. If no string touches the specified position, M_INVALID is written at this address. Since MdlocrGetStringIndex() also returns the requested information, you can set this parameter to M_NULL. Return value The returned value is the index of the string that touches the specified position. If no string touches, M_INVALID is returned. Compilation information Header Include mil.h. Library Use mil.lib; mildlocr.lib. DLL Requires mil.dll; mildlocr.dll. Syntax Description Parameters - ResultDlocrId - PositionX - PositionY - StringIndexPtr Return value Compilation information ",
      "wordCount": 264,
      "subEntries": []
    },
    {
      "id": "Reference_dlocr_MdlocrInquire",
      "version": null,
      "title": "MdlocrInquire",
      "subTitles": null,
      "location": "MIL Reference",
      "pageURL": "content\\Reference\\dlocr\\MdlocrInquire.htm",
      "text": " MdlocrInquire Synopsis Inquire about a Deep Learning OCR context or result buffer setting. Syntax MIL_INT MdlocrInquire( MIL_ID&nbsp;ContextOrResultId, //in MIL_INT64&nbsp;InquireType, //in void&nbsp;*UserVarPtr //out ) Description This function inquires about a setting of a Deep Learning OCR context or result buffer. Such settings are typically specified with MdlocrControl(). Parameters Parameters ContextOrResultId Specifies the identifier of the Deep Learning OCR context or result buffer about which to inquire. The context must have been previously allocated on the system using MdlocrAlloc(). The result buffer must have been previously allocated on the system using MdlocrAllocResult(). InquireType Specifies the setting to inquire. See the Parameter associations section for possible values that can be specified. UserVarPtr Accepts the address of one of the following (see the Parameter associations section for specifics on which is expected): array of type MIL_DOUBLE [optionally, in C++: a reference to a std::vector&lt;MIL_DOUBLE&gt; ] array of type MIL_FLOAT [optionally, in C++: a reference to a std::vector&lt;MIL_FLOAT&gt; ] array of type MIL_ID [optionally, in C++: a reference to a std::vector&lt;MIL_ID&gt; ] array of type MIL_INT [optionally, in C++: a reference to a std::vector&lt;MIL_INT&gt; ] array of type MIL_INT16 [optionally, in C++: a reference to a std::vector&lt;MIL_INT16&gt; ] array of type MIL_INT32 [optionally, in C++: a reference to a std::vector&lt;MIL_INT32&gt; ] array of type MIL_INT64 [optionally, in C++: a reference to a std::vector&lt;MIL_INT64&gt; ] array of type MIL_TEXT_CHAR [optionally, in C++: a reference to a MIL_STRING] MIL_DOUBLE MIL_FLOAT MIL_ID MIL_INT MIL_INT16 MIL_INT32 MIL_INT64 Specifies the address in which to write the requested information. Since the MdlocrInquire() function also returns the requested information, you can set this parameter to M_NULL. See the Parameter associations section for possible values that can be returned. Parameter associations The tables below list possible values for the InquireType parameter and possible values returned to the UserVarPtr parameter. For inquiring about a Deep Learning OCR context or result buffer For inquiring about a Deep Learning OCR Context For inquiring about the predict engine For inquiring about a Deep learning OCR result buffer To inquire about the Deep Learning OCR context or result buffer specified with the ContextOrResultId parameter, set the InquireType parameter to one of the values below. For inquiring about a Deep Learning OCR context or result buffer InquireType Description UserVarPtr - Possible values returned M_MODIFICATION_COUNT Inquires the current value of the modification counter. The modification counter is increased by one each time settings for the context or result buffer are modified. Although you cannot identify the modification counter's contents, you can compare the counter's value throughout your application to know if the context or result buffer has been altered. If the modification counter has changed you can, for example, prompt the user to save before closing the application. UserVarPtr extra info Data type info: Data type: address of a MIL_INT Data type: address of a MIL_INT Value Specifies the current value of the modification counter. M_OWNER_SYSTEM Inquires the identifier of the system on which the context or result buffer was allocated. UserVarPtr extra info Data type info: Data type: address of a MIL_ID Data type: address of a MIL_ID M_DEFAULT_HOST Specifies the default Host system of the current MIL application. MIL system identifier Specifies a valid system identifier, previously allocated using MsysAlloc(). To inquire about the Deep Learning OCR context specified with the ContextOrResultId parameter, set the InquireType parameter to one of the values below. For inquiring about a Deep Learning OCR Context InquireType Description UserVarPtr - Possible values returned M_ACCEPTED_CHARS Inquires the list of accepted characters. The characters in this list should be included in M_SUPPORTED_CHARS. UserVarPtr extra info Data type info: Data type: array of type MIL_TEXT_CHAR [optionally, in C++: MIL_STRING ] MORE Data type: array of type MIL_TEXT_CHAR [optionally, in C++: MIL_STRING ] Required array size: MdlocrInquire ( M_ACCEPTED_CHARS + M_STRING_SIZE ) Note: When using C++, you can pass a reference to a MIL_STRING instead. In this case, the function will automatically determine the correct string size. MIL_TEXT(\"Accepted characters\") 1 Specifies the list of accepted characters. M_CHAR_MAX_ASPECT_RATIO Inquires the maximum aspect ratio of an uppercase character. UserVarPtr extra info Data type info: Data type: address of a MIL_DOUBLE Data type: address of a MIL_DOUBLE Value &gt; 0.0 Specifies the maximum aspect ratio (width/height). M_CONTEXT_TYPE Inquires the type of context. UserVarPtr extra info Data type info: Data type: address of a MIL_INT Data type: address of a MIL_INT M_OCR_NET1_BALANCED_V1 Specifies a Deep Learning OCR context with a balanced deep learning model based on the NET1 architecture. M_OCR_NET1_EXTENDED_V1 Specifies a Deep Learning OCR context with the most robust deep learning model based on the NET1 architecture. M_OCR_NET1_FAST_V1 Specifies a Deep Learning OCR context with the fastest deep learning model based on the NET1 architecture. M_DETECTION_ANGLE Inquires the angle by which the image must be internally rotated to be able to read strings. UserVarPtr extra info Data type info: Data type: address of a MIL_DOUBLE Data type: address of a MIL_DOUBLE M_ACCORDING_TO_REGION Specifies to use the angle of the region of interest. 0.0 &lt;= Value &lt;= 360.0 Specifies the angle, in degrees. M_DETECTION_CHAR_HEIGHT_MAX Inquires the maximum height of an uppercase character that can be read. UserVarPtr extra info Data type info: Data type: address of a MIL_DOUBLE Data type: address of a MIL_DOUBLE Value &gt;= M_DETECTION_CHAR_HEIGHT_MIN Specifies the maximum character height, in pixels. M_DETECTION_CHAR_HEIGHT_MIN Inquires the minimum height of an uppercase character that can be read. UserVarPtr extra info Data type info: Data type: address of a MIL_DOUBLE Data type: address of a MIL_DOUBLE 0.0 &lt;= Value &lt;= M_DETECTION_CHAR_HEIGHT_MAX Specifies the minimum character height, in pixels. M_INTERCHAR_MAX_WIDTH Inquires the maximum gap size between the last character of a string and the first character of another. Gaps larger than this will be read as separate strings. UserVarPtr extra info Data type info: Data type: address of a MIL_DOUBLE Data type: address of a MIL_DOUBLE Value &gt; 0.0 Specifies the maximum character gap, in pixels. M_NUMBER_OF_STRING_MODELS Inquires the number of string models in the context. To add and remove string models, use MdlocrDefineModelFromResult() or MdlocrDefineModel(). UserVarPtr extra info Data type info: Data type: address of a MIL_INT Data type: address of a MIL_INT Value &gt;= 0 Specifies the number of string models. M_PREPROCESSED Inquires whether the context is preprocessed. UserVarPtr extra info Data type info: Data type: address of a MIL_INT Data type: address of a MIL_INT M_FALSE Specifies that the context or result buffer is not preprocessed. M_TRUE Specifies that the context or result buffer is preprocessed. M_STRING_NUMBER Inquires the maximum total number of strings to read in the image. UserVarPtr extra info Data type info: Data type: address of a MIL_INT Data type: address of a MIL_INT M_INFINITE Specifies that there is no limit. Value &gt; 0 Specifies the number of strings to read in an image. M_SUPPORTED_CHARS Inquires the list of supported characters. This is the list of characters on which the classifier was trained. UserVarPtr extra info Data type info: Data type: array of type MIL_TEXT_CHAR [optionally, in C++: MIL_STRING ] MORE Data type: array of type MIL_TEXT_CHAR [optionally, in C++: MIL_STRING ] Required array size: MdlocrInquire ( M_SUPPORTED_CHARS + M_STRING_SIZE ) Note: When using C++, you can pass a reference to a MIL_STRING instead. In this case, the function will automatically determine the correct string size. MIL_TEXT(\"Supported characters\") 1 Specifies the list of supported characters. M_TARGET_MAX_SIZE_X Inquires the maximum width of a target image buffer used for Deep Leaning OCR functions. When using ROIs, this can be set to the width of the ROI to optimize the operation. UserVarPtr extra info Data type info: Data type: address of a MIL_INT Data type: address of a MIL_INT M_INVALID Specifies that the width is invalid. Value &gt; 0 Specifies the maximum width of the buffer, in pixels. M_TARGET_MAX_SIZE_Y Inquires the maximum height of a target image buffer used for Deep Learning OCR functions. When using ROIs, this can be set to the height of the ROI to optimize the operation. UserVarPtr extra info Data type info: Data type: address of a MIL_INT Data type: address of a MIL_INT M_INVALID Specifies that the height is invalid. Value &gt; 0 Specifies the maximum height of the buffer, in pixels. M_TIMEOUT Inquires the maximum read time. UserVarPtr extra info Data type info: Data type: address of a MIL_DOUBLE Data type: address of a MIL_DOUBLE M_DISABLE Specifies an infinite amount of read time. Value &gt;= 0.0 Specifies the maximum read time, in msec. 1 If the value was passed in a variable, it won't be returned enclosed in MIL_TEXT(). To inquire about the predict engine of the Deep Learning OCR context specified with the ContextOrResultId parameter, set the InquireType parameter to one of the following values. For inquiring about the predict engine InquireType Description UserVarPtr - Possible values returned M_NUMBER_OF_PREDICT_ENGINES Inquires the number of predict engines detected. You can inquire the specifics of each predict engine using M_PREDICT_ENGINE_PROVIDER, M_PREDICT_ENGINE_DESCRIPTION and M_PREDICT_ENGINE_PRECISION. UserVarPtr extra info Data type info: Data type: address of a MIL_INT Data type: address of a MIL_INT Value &gt;= 0 Specifies the number of predict engines. M_PREDICT_ENGINE_DESCRIPTION Inquires the description of the predict engine being used. You can inquire the predict engine being used with M_PREDICT_ENGINE_USED. UserVarPtr extra info Data type info: Data type: array of type MIL_TEXT_CHAR [optionally, in C++: MIL_STRING ] MORE Data type: array of type MIL_TEXT_CHAR [optionally, in C++: MIL_STRING ] Required array size: MdlocrInquire ( M_PREDICT_ENGINE_DESCRIPTION + M_STRING_SIZE ) Note: When using C++, you can pass a reference to a MIL_STRING instead. In this case, the function will automatically determine the correct string size. MIL_TEXT(\"Description\") 1 Specifies the text description of the engine type seen by the execution provider. M_PREDICT_ENGINE_PRECISION Inquires the precision of the predict engine being used. You can inquire the predict engine being used with M_PREDICT_ENGINE_USED. UserVarPtr extra info Data type info: Data type: address of a MIL_INT Data type: address of a MIL_INT M_FP16 Specifies that the precision used by the predict engine is floating-point 16-bit. M_FP32 Specifies that the precision used by the predict engine is floating-point 32-bit. M_PREDICT_ENGINE_PROVIDER Inquires the provider of the predict engine being used. You can inquire the predict engine being used with M_PREDICT_ENGINE_USED. You must have installed the appropriate MIL X Service Pack add-on to perform GPU accelerated prediction using CUDA or OpenVINO. MIL add-ons are available for download through the Updates item found in the MILConfig utility. UserVarPtr extra info Data type info: Data type: address of a MIL_INT Data type: address of a MIL_INT M_CUDA Specifies that the predict engine provider is CUDA. M_DEFAULT_CPU Specifies the default predict engine provider. M_OPENVINO Specifies that the predict engine provider is OpenVINO. M_PREDICT_ENGINE_USED Inquires which predict engine is used by the specified context. This value should match the value set using MdlocrControl() with M_PREDICT_ENGINE unless the order of the predict engines is modified. This can happen if the environment running MIL is modified. UserVarPtr extra info Data type info: Data type: array of type MIL_TEXT_CHAR [optionally, in C++: MIL_STRING ] MORE Data type: array of type MIL_TEXT_CHAR [optionally, in C++: MIL_STRING ] Required array size: MdlocrInquire ( M_PREDICT_ENGINE_DESCRIPTION + M_STRING_SIZE ) Note: When using C++, you can pass a reference to a MIL_STRING instead. In this case, the function will automatically determine the correct string size. M_DEFAULT Specifies that the predict engine being used is the predict engine that was selected in the MILConfig utility. M_INVALID Specifies that the predict engine is not found. 0 &lt;= Value &lt; M_NUMBER_OF_PREDICT_ENGINES Specifies the index of the predict engine used. 1 If the value was passed in a variable, it won't be returned enclosed in MIL_TEXT(). To inquire about the Deep Learning OCR result buffer specified with the ContextOrResultId parameter, set the InquireType parameter to one of the values below. For inquiring about a Deep learning OCR result buffer InquireType Description UserVarPtr - Possible values returned M_RESULT_OUTPUT_UNITS Inquires whether to return results in pixels or world units. UserVarPtr extra info Data type info: Data type: address of a MIL_INT Data type: address of a MIL_INT M_ACCORDING_TO_CALIBRATION Specifies that results are returned in world units if the result was calculated on an image associated with a camera calibration context; otherwise, specifies that results are returned in pixel units. M_PIXEL Specifies that results are returned in pixel units, with respect to the pixel coordinate system. M_WORLD Specifies that results are returned in world units, with respect to the relative coordinate system. Combination value for M_PREDICT_ENGINE_DESCRIPTION. You can add the following value to the above-mentioned value to get the size of a string. For inquiring the size of a string InquireType combination value Description UserVarPtr - Possible values returned M_STRING_SIZE Inquires the number of characters in the string. This number accounts for every character, including the terminating null character. UserVarPtr extra info Data type info: Data type: address of a MIL_INT Data type: address of a MIL_INT Combination value for Tables: For inquiring about a Deep Learning OCR context or result buffer For inquiring about a Deep Learning OCR Context For inquiring about a Deep learning OCR result buffer the values listed in all the parameter association tables except For inquiring about the predict engine. You can add the following value to the above-mentioned values to get the default value of an inquire type, regardless of the current value of the inquire type. For inquiring the default value InquireType Description UserVarPtr - Possible values returned M_DEFAULT Inquires the default value of the specified inquire type. UserVarPtr extra info Data type info: Data type: defined elsewhere Data type: defined elsewhere Combination values for Tables: For inquiring about a Deep Learning OCR context or result buffer For inquiring about a Deep Learning OCR Context For inquiring about a Deep learning OCR result buffer the values listed in all the parameter association tables except For inquiring about the predict engine. You can add one of the following values to the above-mentioned values to determine whether an inquire type is supported for the Deep Learning OCR context currently being inquired. For inquiring if an inquire type is supported InquireType Description UserVarPtr - Possible values returned M_HAS_DEFAULT Inquires whether the specified inquire type has a default value. UserVarPtr extra info Data type info: Data type: address of a MIL_INT Data type: address of a MIL_INT M_FALSE Specifies that the inquire type does not have a default value. M_TRUE Specifies that the inquire type has a default value. M_SUPPORTED Inquires whether the specified inquire type is supported. UserVarPtr extra info Data type info: Data type: address of a MIL_INT Data type: address of a MIL_INT M_FALSE Specifies that the inquire type is not supported. M_TRUE Specifies that the inquire type is supported. Combination values for the values listed in For inquiring about a Deep Learning OCR context or result buffer, For inquiring about a Deep Learning OCR Context, For inquiring about a Deep learning OCR result buffer; and for the following values: M_NUMBER_OF_PREDICT_ENGINES , M_PREDICT_ENGINE_PRECISION , M_PREDICT_ENGINE_PROVIDER , M_PREDICT_ENGINE_USED , M_STRING_SIZE. You can add one of the following values to the above-mentioned values to cast the requested results to a required data type. Note: In C++, when using a standard vector (std::vector) instead of an array, the values listed in this combination table must not be used. If you need to use a specific data type, instantiate the vector with the necessary data type. For casting the result to a required data type InquireType Description UserVarPtr - Possible values returned M_TYPE_MIL_DOUBLE Casts the requested results to a MIL_DOUBLE. UserVarPtr extra info Data type info: Data type: address of a MIL_DOUBLE &nbsp;|&nbsp; array of type MIL_DOUBLE [optionally, in C++: a reference to a std::vector&lt;MIL_DOUBLE&gt; ] MORE Data type: address of a MIL_DOUBLE Note: When a single result. Data type: array of type MIL_DOUBLE [optionally, in C++: a reference to a std::vector&lt;MIL_DOUBLE&gt; ] Required array size:(defined elsewhere) Note: When multiple results. M_TYPE_MIL_FLOAT Casts the requested results to a MIL_FLOAT. UserVarPtr extra info Data type info: Data type: address of a MIL_FLOAT &nbsp;|&nbsp; array of type MIL_FLOAT [optionally, in C++: a reference to a std::vector&lt;MIL_FLOAT&gt; ] MORE Data type: address of a MIL_FLOAT Note: When a single result. Data type: array of type MIL_FLOAT [optionally, in C++: a reference to a std::vector&lt;MIL_FLOAT&gt; ] Required array size:(defined elsewhere) Note: When multiple results. M_TYPE_MIL_ID Casts the requested results to a MIL_ID. UserVarPtr extra info Data type info: Data type: address of a MIL_ID &nbsp;|&nbsp; array of type MIL_ID [optionally, in C++: a reference to a std::vector&lt;MIL_ID&gt; ] MORE Data type: address of a MIL_ID Note: When a single result. Data type: array of type MIL_ID [optionally, in C++: a reference to a std::vector&lt;MIL_ID&gt; ] Required array size:(defined elsewhere) Note: When multiple results. M_TYPE_MIL_INT Casts the requested results to a MIL_INT. UserVarPtr extra info Data type info: Data type: address of a MIL_INT &nbsp;|&nbsp; array of type MIL_INT [optionally, in C++: a reference to a std::vector&lt;MIL_INT&gt; ] MORE Data type: address of a MIL_INT Note: When a single result. Data type: array of type MIL_INT [optionally, in C++: a reference to a std::vector&lt;MIL_INT&gt; ] Required array size:(defined elsewhere) Note: When multiple results. M_TYPE_MIL_INT16 Casts the requested results to a MIL_INT16. UserVarPtr extra info Data type info: Data type: address of a MIL_INT16 &nbsp;|&nbsp; array of type MIL_INT16 [optionally, in C++: a reference to a std::vector&lt;MIL_INT16&gt; ] MORE Data type: address of a MIL_INT16 Note: When a single result. Data type: array of type MIL_INT16 [optionally, in C++: a reference to a std::vector&lt;MIL_INT16&gt; ] Required array size:(defined elsewhere) Note: When multiple results. M_TYPE_MIL_INT32 Casts the requested results to a MIL_INT32. UserVarPtr extra info Data type info: Data type: address of a MIL_INT32 &nbsp;|&nbsp; array of type MIL_INT32 [optionally, in C++: a reference to a std::vector&lt;MIL_INT32&gt; ] MORE Data type: address of a MIL_INT32 Note: When a single result. Data type: array of type MIL_INT32 [optionally, in C++: a reference to a std::vector&lt;MIL_INT32&gt; ] Required array size:(defined elsewhere) Note: When multiple results. M_TYPE_MIL_INT64 Casts the requested results to a MIL_INT64. UserVarPtr extra info Data type info: Data type: address of a MIL_INT64 &nbsp;|&nbsp; array of type MIL_INT64 [optionally, in C++: a reference to a std::vector&lt;MIL_INT64&gt; ] MORE Data type: address of a MIL_INT64 Note: When a single result. Data type: array of type MIL_INT64 [optionally, in C++: a reference to a std::vector&lt;MIL_INT64&gt; ] Required array size:(defined elsewhere) Note: When multiple results. Return value The returned value is the requested information, cast to a MIL_INT. If the requested information does not fit into a MIL_INT, this function will return M_NULL or truncate the information. Compilation information Header Include mil.h. Library Use mil.lib; mildlocr.lib. DLL Requires mil.dll; mildlocr.dll. Syntax Description Parameters - ContextOrResultId - InquireType - UserVarPtr Parameter Associations For inquiring about a Deep Learning OCR context or result buffer For inquiring about a Deep Learning OCR Context For inquiring about the predict engine For inquiring about a Deep learning OCR result buffer + For inquiring the size of a string + For inquiring the default value + For inquiring if an inquire type is supported + For casting the result to a required data type Return value Compilation information ",
      "wordCount": 3163,
      "subEntries": []
    },
    {
      "id": "Reference_dlocr_MdlocrInquireConstraint",
      "version": null,
      "title": "MdlocrInquireConstraint",
      "subTitles": null,
      "location": "MIL Reference",
      "pageURL": "content\\Reference\\dlocr\\MdlocrInquireConstraint.htm",
      "text": " MdlocrInquireConstraint Synopsis Inquire about a positional constraint of a Deep Learning OCR string model. Syntax MIL_INT MdlocrInquireConstraint( MIL_ID&nbsp;ContextId, //in MIL_INT64&nbsp;StringModelLabelOrIndex, //in MIL_INT64&nbsp;PositionInString, //in MIL_INT64&nbsp;InquireType, //in void&nbsp;*UserVarPtr //out ) Description This function allows you to inquire about a positional constraint of a Deep Learning OCR string model. Parameters Parameters ContextId Specifies the identifier of the Deep Learning OCR context that contains the string model about which to inquire. The context must have been previously allocated on the system using MdlocrAlloc(). StringModelLabelOrIndex Specifies the string model about which to inquire. Set this parameter to one of the values below: For specifying the string model Value Description M_STRING_INDEX( MIL_INT IndexValue ) Specifies to inquire about the string model by indicating its index. Parameters IndexValue Specifies the index of the string model. 0 &lt;= Value &lt; M_NUMBER_OF_STRING_MODELS Specifies the index of the string model about which to inquire. M_STRING_LABEL( MIL_INT LabelValue ) Specifies to inquire about the string model by indicating its label. Parameters LabelValue Specifies the label of the string model. 0 &lt; Value &lt; 2097152 Specifies the label of the string model about which to inquire. PositionInString Specifies the position of the character in the string model. Set this parameter to one of the values below: For specifying the position in a string model Value Description M_DEFAULT Specifies all positions that have not been manually constrained. Value &gt;= 0 Specifies the position in the string model. InquireType Specifies the type of setting about which to inquire. See the Parameter associations section for possible values that can be specified. UserVarPtr Accepts the address of one of the following (see the Parameter associations section for specifics on which is expected): array of type MIL_TEXT_CHAR [optionally, in C++: a reference to a MIL_STRING] MIL_DOUBLE MIL_INT MIL_INT32 MIL_INT64 MIL_UINT8 Specifies the address in which to write the requested information. Since the MdlocrInquireConstraint() function also returns the requested information, you can set this parameter to M_NULL. See the Parameter associations section for possible values that can be returned. Parameter associations The table below lists possible values for the InquireType parameter and possible values returned to the UserVarPtr parameter. For inquiring about positional constraints in a string model The following InquireType parameter settings are used to inquire about positional constraints of a string model. For inquiring about positional constraints in a string model InquireType Description UserVarPtr - Possible values returned M_CHAR_LIST Inquires the list of expected characters (case sensitive). If M_CONSTRAINT_TYPE is set to M_ANY, this will return an empty string indicating all supported values are used. UserVarPtr extra info Data type info: Data type: array of type MIL_TEXT_CHAR [optionally, in C++: MIL_STRING ] MORE Data type: array of type MIL_TEXT_CHAR [optionally, in C++: MIL_STRING ] Required array size: MdlocrInquireConstraint ( M_CHAR_LIST + M_STRING_SIZE ) Note: When using C++, you can pass a reference to a MIL_STRING instead. In this case, the function will automatically determine the correct string size. MIL_TEXT(\"CharList\") 1 Specifies the list of expected characters. M_CONSTRAINT_TYPE Inquires the type of constraint applied to the position. UserVarPtr extra info Data type info: Data type: address of a MIL_INT Data type: address of a MIL_INT M_ANY Specifies any character. M_CHAR_LIST Specifies any character in a list passed to the ControlValuePtr parameter of MdlocrControlConstraint(). M_DIGITS Specifies any digit. M_LETTERS Specifies any letter. M_LETTERS_LOWERCASE Specifies any lowercase letter. M_LETTERS_UPPERCASE Specifies any uppercase letter. M_SAME_AS_DEFAULT_CONSTRAINT Specifies to use the default constraint set using MdlocrControlConstraint() with its PositionInString set to M_DEFAULT and M_CONSTRAINT_TYPE set to the required constraint. This is the default value. M_IS_OPTIONAL Inquires whether a position in a string model is optional. UserVarPtr extra info Data type info: Data type: address of a MIL_INT Data type: address of a MIL_INT M_DEFAULT Same as M_FALSE. M_FALSE Specifies that the model position is not optional. M_TRUE Specifies that the model position is optional. 1 If the value was passed in a variable, it won't be returned enclosed in MIL_TEXT(). Combination value for the values listed in For inquiring about positional constraints in a string model. You can add the following value to the above-mentioned values to get the default value of an inquire type (if supported), regardless of the current value of the inquire type. For inquiring the default value InquireType Description UserVarPtr - Possible values returned M_DEFAULT Inquires the default value of the specified inquire type. UserVarPtr extra info Data type info: Data type: address of a MIL_DOUBLE Data type: address of a MIL_DOUBLE Combination value for M_CHAR_LIST. You can add the following value to the above-mentioned value to get the size of a string. For inquiring the size of a string InquireType combination value Description UserVarPtr - Possible values returned M_STRING_SIZE Inquires the number of characters in the string. This number accounts for every character, including the terminating null character. All strings have the terminating null character, even though you need not explicitly list it when specifying the string. UserVarPtr extra info Data type info: Data type: address of a MIL_INT Data type: address of a MIL_INT Combination values for the values listed in For inquiring about positional constraints in a string model. You can add one of the following values to the above-mentioned values to determine whether an inquire type is supported for the constraint currently being inquired. For inquiring if an inquire type is supported InquireType Description UserVarPtr - Possible values returned M_HAS_DEFAULT Inquires whether the specified inquire type has a default value. UserVarPtr extra info Data type info: Data type: address of a MIL_INT Data type: address of a MIL_INT M_FALSE Specifies that the inquire type does not have a default value. M_TRUE Specifies that the inquire type has a default value. M_SUPPORTED Inquires whether the specified inquire type is supported. UserVarPtr extra info Data type info: Data type: address of a MIL_INT Data type: address of a MIL_INT M_FALSE Specifies that the inquire type is not supported. M_TRUE Specifies that the inquire type is supported. Combination values for M_CONSTRAINT_TYPE , M_IS_OPTIONAL , M_STRING_SIZE. You can add one of the following values to the above-mentioned values to cast the requested information to the required data type. For casting the requested information to the required data type InquireType Description UserVarPtr - Possible values returned M_TYPE_MIL_DOUBLE Casts the requested information to a MIL_DOUBLE. UserVarPtr extra info Data type info: Data type: address of a MIL_DOUBLE Data type: address of a MIL_DOUBLE M_TYPE_MIL_INT Casts the requested information to a MIL_INT. UserVarPtr extra info Data type info: Data type: address of a MIL_INT Data type: address of a MIL_INT M_TYPE_MIL_INT32 Casts the requested information to a MIL_INT32. UserVarPtr extra info Data type info: Data type: address of a MIL_INT32 Data type: address of a MIL_INT32 M_TYPE_MIL_INT64 Casts the requested information to a MIL_INT64. UserVarPtr extra info Data type info: Data type: address of a MIL_INT64 Data type: address of a MIL_INT64 M_TYPE_MIL_UINT8 Casts the requested information to a MIL_UINT8. UserVarPtr extra info Data type info: Data type: address of a MIL_UINT8 Data type: address of a MIL_UINT8 Return value The returned value is the requested information, cast to a MIL_INT. If the requested information does not fit into a MIL_INT, this function will return M_NULL or truncate the information. Compilation information Header Include mil.h. Library Use mil.lib; mildlocr.lib. DLL Requires mil.dll; mildlocr.dll. Syntax Description Parameters - ContextId - StringModelLabelOrIndex For specifying the string model - PositionInString For specifying the position in a string model - InquireType - UserVarPtr Parameter Associations For inquiring about positional constraints in a string model + For inquiring the default value + For inquiring the size of a string + For inquiring if an inquire type is supported + For casting the requested information to the required data type Return value Compilation information ",
      "wordCount": 1279,
      "subEntries": []
    },
    {
      "id": "Reference_dlocr_MdlocrInquireStringModel",
      "version": null,
      "title": "MdlocrInquireStringModel",
      "subTitles": null,
      "location": "MIL Reference",
      "pageURL": "content\\Reference\\dlocr\\MdlocrInquireStringModel.htm",
      "text": " MdlocrInquireStringModel Synopsis Inquire about a global setting of a Deep Learning OCR string model. Syntax MIL_INT MdlocrInquireStringModel( MIL_ID&nbsp;ContextId, //in MIL_INT64&nbsp;StringModelLabelOrIndex, //in MIL_INT64&nbsp;InquireType, //in void&nbsp;*UserVarPtr //out ) Description This function inquires about a global setting of a Deep Learning OCR string model. Global settings of a string model are set using MdlocrControlStringModel(). Parameters Parameters ContextId Specifies the identifier of the Deep Learning OCR context that contains the string model about which to inquire. The context must have been previously allocated on the system using MdlocrAlloc(). StringModelLabelOrIndex Specifies the string model about which to inquire. Set this parameter to one of the values below: For specifying the string model Value Description M_STRING_INDEX( MIL_INT IndexValue ) Specifies to inquire about the string model by indicating its index. Parameters IndexValue Specifies the index of the string model. 0 &lt;= Value &lt; M_NUMBER_OF_STRING_MODELS Specifies the index of the string model about which to inquire. M_STRING_LABEL( MIL_INT LabelValue ) Specifies to inquire about the string model by indicating its label. Parameters LabelValue Specifies the label of the string model. 0 &lt; Value &lt; 2097152 Specifies the label of the string model about which to inquire. InquireType Specifies the type of setting about which to inquire. See the Parameter associations section for possible values that can be specified. UserVarPtr Accepts the address of one of the following (see the Parameter associations section for specifics on which is expected): array of type MIL_TEXT_CHAR [optionally, in C++: a reference to a MIL_STRING] MIL_DOUBLE MIL_INT MIL_INT32 MIL_INT64 Specifies the address in which to write the requested information. Since the MdlocrInquireStringModel() function also returns the requested information, you can set this parameter to M_NULL. See the Parameter associations section for possible values that can be returned. Parameter associations The table below lists possible values for the InquireType parameter and possible values returned to the UserVarPtr parameter. For inquiring about a global setting of a string model To inquire about a global setting of a string model, set the InquireType parameter to one of the values below. Unless otherwise specified, set the StringModelLabelOrIndex parameter to the label or index of a string model. For inquiring about a global setting of a string model InquireType Description UserVarPtr - Possible values returned M_CHAR_HEIGHT_MAX Inquires the maximum height of an uppercase character in the string model. UserVarPtr extra info Data type info: Data type: address of a MIL_DOUBLE Data type: address of a MIL_DOUBLE M_SAME_AS_CONTEXT Specifies to use the maximum character height specified using MdlocrControl() with M_DETECTION_CHAR_HEIGHT_MAX. Value &gt;= M_CHAR_HEIGHT_MIN Specifies the maximum character height, in pixels. M_CHAR_HEIGHT_MIN Inquires the minimum height of an uppercase character in the string model. UserVarPtr extra info Data type info: Data type: address of a MIL_DOUBLE Data type: address of a MIL_DOUBLE M_SAME_AS_CONTEXT Specifies to use the minimum character height specified using MdlocrControl() with M_DETECTION_CHAR_HEIGHT_MIN. 0.0 &lt;= Value &lt;= M_CHAR_HEIGHT_MAX Specifies the minimum height in pixels. M_MAX_NUMBER_OF_OCCURRENCES Inquires the maximum number of occurrences of the specified string model. UserVarPtr extra info Data type info: Data type: address of a MIL_INT Data type: address of a MIL_INT M_INFINITE Specifies that there is no maximum number of occurrences. Value &gt;= M_MIN_NUMBER_OF_OCCURRENCES Specifies the maximum number of occurrences. M_MIN_NUMBER_OF_OCCURRENCES Inquires the minimum number of occurrences of the specified string model. UserVarPtr extra info Data type info: Data type: address of a MIL_INT Data type: address of a MIL_INT 0 &lt;= Value &lt;= M_MAX_NUMBER_OF_OCCURRENCES Specifies the minimum number of occurrences. M_STRING_INDEX_VALUE Inquires the index of the string model. Set the StringModelLabelOrIndex parameter to label of the string model. UserVarPtr extra info Data type info: Data type: address of a MIL_INT Data type: address of a MIL_INT M_INVALID Specifies that the label is invalid. Value &gt;= 0 Specifies the index of the string model. M_STRING_LABEL_VALUE Inquires the label of the string model. Set the StringModelLabelOrIndex parameter to index of the string model. UserVarPtr extra info Data type info: Data type: address of a MIL_INT Data type: address of a MIL_INT Value &gt; 0 Specifies the label of the string model. M_STRING_SIZE_MAX Inquires the maximum number of characters in a string. UserVarPtr extra info Data type info: Data type: address of a MIL_INT Data type: address of a MIL_INT M_STRING_SIZE_MIN &lt;= Value &lt;= 256 Specifies the maximum number of characters. M_STRING_SIZE_MIN Inquires the minimum number of characters in a string. UserVarPtr extra info Data type info: Data type: address of a MIL_INT Data type: address of a MIL_INT 1 &lt;= Value &lt;= M_STRING_SIZE_MAX Specifies the minimum number of characters. M_TEXT_ANCHOR_MODE Inquires the text anchoring mode. UserVarPtr extra info Data type info: Data type: address of a MIL_INT Data type: address of a MIL_INT M_DISABLE Specifies that no anchoring is used. M_TEXT_PREFIX Specifies that the string is prefixed by a known substring. M_TEXT_SUFFIX Specifies that the string is suffixed by a known substring. M_TEXT_ANCHOR_VALUE Inquires the text to be used as a textual anchor. UserVarPtr extra info Data type info: Data type: array of type MIL_TEXT_CHAR [optionally, in C++: MIL_STRING ] MORE Data type: array of type MIL_TEXT_CHAR [optionally, in C++: MIL_STRING ] Required array size: MdlocrInquireStringModel ( M_TEXT_ANCHOR_VALUE + M_STRING_SIZE ) Note: When using C++, you can pass a reference to a MIL_STRING instead. In this case, the function will automatically determine the correct string size. MIL_TEXT(\"String\") 1 Specifies the text used as an anchor. 1 If the value was passed in a variable, it won't be returned enclosed in MIL_TEXT(). Combination value for M_TEXT_ANCHOR_VALUE. You can add the following value to the above-mentioned value to get the string's length. For getting the string size InquireType Description MIL system-specifictooltip () UserVarPtr - Possible values returned M_STRING_SIZE Retrieves the length of the string, including the terminating null character (\"\\0\").  UserVarPtr extra info Data type info: Data type: address of a MIL_INT Data type: address of a MIL_INT  Combination value for the values listed in For inquiring about a global setting of a string model; (exceptions might exist) and for the following value: M_TEXT_ANCHOR_VALUE. You can add the following value to the above-mentioned values to get the default value of an inquire type, regardless of the current value of the inquire type. For inquiring the default value InquireType Description UserVarPtr - Possible values returned M_DEFAULT Inquires the default value of the specified inquire type. UserVarPtr extra info Data type info: Data type: address of a MIL_DOUBLE Data type: address of a MIL_DOUBLE Combination values for the values listed in For inquiring about a global setting of a string model; (exceptions might exist) and for the following value: M_TEXT_ANCHOR_VALUE. You can add one of the following values to the above-mentioned values to determine whether an inquire type is supported for the string model currently being inquired. For inquiring if an inquire type is supported InquireType Description UserVarPtr - Possible values returned M_HAS_DEFAULT Inquires whether the specified inquire type has a default value. UserVarPtr extra info Data type info: Data type: address of a MIL_INT Data type: address of a MIL_INT M_FALSE Specifies that the inquire type does not have a default value. M_TRUE Specifies that the inquire type has a default value. M_SUPPORTED Inquires whether the specified inquire type is supported. UserVarPtr extra info Data type info: Data type: address of a MIL_INT Data type: address of a MIL_INT M_FALSE Specifies that the inquire type is not supported. M_TRUE Specifies that the inquire type is supported. Combination values for the values listed in For inquiring about a global setting of a string model; (exceptions might exist) and for the following value: M_STRING_SIZE. You can add one of the following values to the above-mentioned values to cast the requested information to the required data type. For casting information to the required data type. InquireType Description UserVarPtr - Possible values returned M_TYPE_MIL_DOUBLE Casts the requested information to a MIL_DOUBLE. UserVarPtr extra info Data type info: Data type: address of a MIL_DOUBLE Data type: address of a MIL_DOUBLE M_TYPE_MIL_INT Casts the requested information to a MIL_INT. UserVarPtr extra info Data type info: Data type: address of a MIL_INT Data type: address of a MIL_INT M_TYPE_MIL_INT32 Casts the requested information to a MIL_INT32. UserVarPtr extra info Data type info: Data type: address of a MIL_INT32 Data type: address of a MIL_INT32 M_TYPE_MIL_INT64 Casts the requested information to a MIL_INT64. UserVarPtr extra info Data type info: Data type: address of a MIL_INT64 Data type: address of a MIL_INT64 Return value The returned value is the requested information, cast to a MIL_INT. If the requested information does not fit into a MIL_INT, this function will return M_NULL or truncate the information. Compilation information Header Include mil.h. Library Use mil.lib; mildlocr.lib. DLL Requires mil.dll; mildlocr.dll. Syntax Description Parameters - ContextId - StringModelLabelOrIndex For specifying the string model - InquireType - UserVarPtr Parameter Associations For inquiring about a global setting of a string model + For getting the string size + For inquiring the default value + For inquiring if an inquire type is supported + For casting information to the required data type. Return value Compilation information ",
      "wordCount": 1496,
      "subEntries": []
    },
    {
      "id": "Reference_dlocr_MdlocrPreprocess",
      "version": null,
      "title": "MdlocrPreprocess",
      "subTitles": null,
      "location": "MIL Reference",
      "pageURL": "content\\Reference\\dlocr\\MdlocrPreprocess.htm",
      "text": " MdlocrPreprocess Synopsis Preprocess a Deep Learning OCR context. Syntax void MdlocrPreprocess( MIL_ID&nbsp;ContextDlocrId, //in MIL_INT64&nbsp;ControlFlag //in ) Description This function prepares a Deep Learning OCR context for a read operation. This allows Deep Learning OCR to make internal refinements so it can execute optimized and robust character recognition processes. You must call this function before the first call to MdlocrRead(). Changes to the context or to any of its content often require you to preprocess the context again. To inquire a context's preprocessing state, call MdlocrInquire() with M_PREPROCESSED. Saving a context does not save preprocessing changes. Upon restoration, you must preprocess the context again. Parameters Parameters ContextDlocrId Specifies the identifier of the Deep Learning OCR context to preprocess. The context must have been previously allocated on the system using MdlocrAlloc(). ControlFlag Specifies whether to preprocess the Deep Learning OCR context. Set this parameter to one of the values below: For specifying whether to preprocess the context Value Description M_DEFAULT Preprocesses the context. M_RESET Un-preprocesses the context. Un-preprocessing the context can be useful if you want to conserve system memory within an application and preserve context settings. Compilation information Header Include mil.h. Library Use mil.lib; mildlocr.lib. DLL Requires mil.dll; mildlocr.dll. Syntax Description Parameters - ContextDlocrId - ControlFlag For specifying whether to preprocess the context Compilation information ",
      "wordCount": 216,
      "subEntries": []
    },
    {
      "id": "Reference_dlocr_MdlocrRead",
      "version": null,
      "title": "MdlocrRead",
      "subTitles": null,
      "location": "MIL Reference",
      "pageURL": "content\\Reference\\dlocr\\MdlocrRead.htm",
      "text": " MdlocrRead Synopsis Read strings from a target image. Syntax void MdlocrRead( MIL_ID&nbsp;ContextDlocrId, //in MIL_ID&nbsp;TargetImageBufId, //in MIL_ID&nbsp;ResultDlocrId, //in MIL_INT64&nbsp;ControlFlag //in ) Description This function uses a Deep Learning OCR context to read one or more strings from a target image. Results are stored in a Deep Learning OCR result buffer. To get the results, use MdlocrGetResult(). By default, MdlocrRead() reads all text in an image within the default character height range. You can control global read settings using MdlocrControl(). You only need to add a string model if you want to restrict the strings that are found and read. MdlocrDefineModelFromResult() allows you to define the string model so that attributes are automatically set from a resulting string found using MdlocrRead(). If you only want to restrict the number of characters in the string or define a string model using an anchor, you can use MdlocrDefineModel(). Regardless of how you add a model, you can always constrain the characters that appear at certain positions using MdlocrControlConstraint() and adjust general string model settings using MdlocrControlStringModel(). Requirements for reading strings depend on the settings of the context and if used, string model-specific positional constraints and settings. To control these settings, use MdlocrControl(), MdlocrControlConstraint(), and MdlocrControlStringModel(). MdlocrRead() takes into account all settings. Before performing a read operation, the Deep Learning OCR context must be in a preprocessed state (MdlocrPreprocess()). To read a string, it must not only meet the context's requirements, but it must also follow the basic rules of a string. It must, for example, be a linear sequence of characters. Strings are read in the natural Latin-based reading order; that is, they are read from left to right, and from top to bottom (with respect to the angle of the target). A string's position is the position of the center of the bounding box of its first character. Before preprocessing, you must manually set M_TARGET_MAX_SIZE_X and M_TARGET_MAX_SIZE_Y, generally to the size of the target image. You can limit the read operation to a region of the target image buffer, using a rectangular ROI set with MbufSetRegion(). To increase performance, set M_TARGET_MAX_SIZE_X and M_TARGET_MAX_SIZE_Y to the size of the ROI. If wanted strings have a known prefix or suffix, set M_TEXT_ANCHOR_MODE to M_TEXT_PREFIX or M_TEXT_SUFFIX respectively within your string model. If the target image is not calibrated, results are calculated in the pixel coordinate system (pixel units). If the target image is calibrated, results are calculated in the world coordinate system (real-world units), but you can retrieve them in either world or pixel units. To specify this, call MdlocrControl() with M_RESULT_OUTPUT_UNITS. In the presence of distortion, some results are meaningless when converted from real-world to pixel units (such as angle and scale). For example, if a string appears warped in the target image, but the camera calibration context compensates for this, the resulting angle is meaningful in the real-world coordinate system, and meaningless in the pixel coordinate system. If complex distortions exist, correct the image before using it with Deep Learning OCR. The read operation can occasionally take an unexpectedly long time to calculate. Use MdlocrControl() with M_TIMEOUT to set a maximum read time. While the Deep Learning OCR module can read dot-matrix text, it is not recommended if the dots are well segmented. In these cases, it is recommended to use the SureDotOCR module. Parameters Parameters ContextDlocrId Specifies the identifier of the Deep Learning OCR context to use for the read operation. The context must have been previously allocated on the required system using MdlocrAlloc(), and preprocessed using MdlocrPreprocess(). TargetImageBufId Specifies the identifier of the target image buffer which contains the strings to read. The target image buffer must be a 1-band, 8-bit unsigned buffer. Its maximum size is 65536x65536 pixels, and its expeced maximum size should be set using MdlocrControl() with M_TARGET_MAX_SIZE_X and M_TARGET_MAX_SIZE_Y. This image buffer can only have a rectangular region of interest (ROI), defined using MbufSetRegion() (with or without rotation). In addition, the region must be defined in vector format from a 2D graphics list (M_VECTOR or M_VECTOR_AND_RASTER). An error will be generated if the ROI is only in raster format (M_RASTER) or a non-rectangular shape. ResultDlocrId Specifies the identifier of the Deep Learning OCR result buffer in which to write the results of the read operation. The Deep Learning OCR result buffer must have been previously allocated on the required system using MdlocrAllocResult(). ControlFlag Specifies the string reading mode. For specifying the string matching mode Value Description M_MODEL_BASED Specifies that strings are read using the string models added to the Deep Learning OCR context. Only strings that meet the string model settings and positional constraints are read. M_READ_ALL Specifies to read all strings regardless of the string models added to the Deep Learning OCR context. Compilation information Header Include mil.h. Library Use mil.lib; mildlocr.lib. DLL Requires mil.dll; mildlocr.dll. Syntax Description Parameters - ContextDlocrId - TargetImageBufId - ResultDlocrId - ControlFlag For specifying the string matching mode Compilation information ",
      "wordCount": 821,
      "subEntries": []
    },
    {
      "id": "Reference_dlocr_MdlocrRestore",
      "version": null,
      "title": "MdlocrRestore",
      "subTitles": null,
      "location": "MIL Reference",
      "pageURL": "content\\Reference\\dlocr\\MdlocrRestore.htm",
      "text": " MdlocrRestore Synopsis Restore a Deep Learning OCR context from disk. Syntax MIL_ID MdlocrRestore( MIL_CONST_TEXT_PTR&nbsp;FileName, //in MIL_ID&nbsp;SysId, //in MIL_INT64&nbsp;ControlFlag, //in MIL_ID&nbsp;*ContextDlocrIdPtr //out ) Description This function restores a Deep Learning OCR context that was previously saved to a file, using MdlocrSave() or MdlocrStream(). This function restores all of the context's settings (including string model-specific positional constraints and settings) that were in effect when the context was saved. A restored context is not preprocessed; therefore, you must call MdlocrPreprocess() before performing a read using MdlocrRead(). When the restored Deep Learning OCR context is no longer required, release it using MdlocrFree() unless M_UNIQUE_ID was specified during allocation; if M_UNIQUE_ID was specified, the smart identifier manages the restored Deep Learning OCR context's lifetime and you must not manually free it. Parameters Parameters FileName Specifies the name and path of the file from which to restore the Deep Learning OCR context. The function handles (internally) the opening and closing of the file. For easier use with other Matrox Imaging software products, files for Deep Learning OCR contexts should use the MDLOCR file extension. Set this parameter to one of the values below: For specifying the file name and path Value Description M_INTERACTIVE [This is only applicable to Windows] Opens a dialog box from which you can interactively specify the drive, directory, and name of the file. MIL_TEXT(\"FileName\") 1 Specifies the drive, directory, and name of the Deep Learning OCR context file (for example, \"C:\\mydirectory\\MyContext.mdlocr\"). Typically, Deep Learning OCR context files have an MDLOCR extension. To specify a context file on a remote computer (under Distributed MIL), prefix the specified file name string with \"remote:///\" (for example, \"remote:///C:\\mydirectory\\MyContext.mdlocr\"). 1 If you are passing the value in a variable, don't enclose it in MIL_TEXT(). SysId Specifies the identifier of the system on which to restore the Deep Learning OCR context. Set this parameter to one of the values below: For specifying the system identifier Value Description M_DEFAULT_HOST Specifies the default Host system of the current MIL application. MIL system identifier Specifies a valid system identifier, previously allocated using MsysAlloc(). ControlFlag Reserved for future expansion and must be set to M_DEFAULT. ContextDlocrIdPtr Specifies the address of the variable in which to write the Deep Learning OCR context identifier or specifies the data type that the function should use to return the Deep Learning OCR context identifier. For retrieving the identifier or specifying how to return it Value Description M_NULL Specifies that you will use this function's return value to obtain the identifier of the allocated Deep Learning OCR context ; in this case, a standard MIL identifier of type MIL_ID is returned. M_UNIQUE_ID Specifies that you will use this function's return value to obtain the identifier of the allocated Deep Learning OCR context ; in this case, a MIL smart identifier of type MIL_UNIQUE_DLOCR_ID is returned instead of a standard MIL identifier. This setting is only available when using C++11 (or later). A MIL smart identifier manages the lifespan of the MIL object it owns (similar to a std::unique_ptr). Note, you can use a MIL smart identifier as though it were a standard MIL identifier, except that you cannot use it to manually free the Deep Learning OCR context (it is freed automatically). For more information, see the MIL smart identifiers subsection of the MIL custom data types, void pointers, extensions, and portability functions section of Chapter 2: Building an application. Address in which to write the identifier Specifies the address of a MIL_ID in which to write the identifier of the allocated Deep Learning OCR context. If restoration fails, M_NULL is written as the identifier. Return value The returned value is the Deep Learning OCR context identifier either as a standard identifier (MIL_ID) or a smart identifier (MIL_UNIQUE_DLOCR_ID). If allocation fails, M_NULL is returned (or nullptr if M_UNIQUE_ID was specified). Compilation information Header Include mil.h. Library Use mil.lib; mildlocr.lib. DLL Requires mil.dll; mildlocr.dll. Syntax Description Parameters - FileName For specifying the file name and path - SysId For specifying the system identifier - ControlFlag - ContextDlocrIdPtr For retrieving the identifier or specifying how to return it Return value Compilation information ",
      "wordCount": 685,
      "subEntries": []
    },
    {
      "id": "Reference_dlocr_MdlocrSave",
      "version": null,
      "title": "MdlocrSave",
      "subTitles": null,
      "location": "MIL Reference",
      "pageURL": "content\\Reference\\dlocr\\MdlocrSave.htm",
      "text": " MdlocrSave Synopsis Save a Deep Learning OCR context to a file. Syntax void MdlocrSave( MIL_CONST_TEXT_PTR&nbsp;FileName, //in MIL_ID&nbsp;ContextDlocrId, //in MIL_INT64&nbsp;ControlFlag //in ) Description This function saves all the information about the previously allocated Deep Learning OCR context to disk, including all of its global settings and string model-specific positional constraints and settings. This information can be reloaded, using MdlocrRestore() or MdlocrStream(). When you save the context, the preprocessing changes are not saved. Upon restoration, you must preprocess the context again. Parameters Parameters FileName Specifies the name and path of the file in which to save the Deep Learning OCR context. The function internally handles the opening and closing of this file. For easier use with other Matrox Imaging software products, files for Deep Learning OCR contexts should use the MDLOCR file extension. If you specify a file that already exists, it will be overwritten. Set this parameter to one of the values below: For specifying the file name and path Value Description M_INTERACTIVE [This is only applicable to Windows] Opens a dialog box from which you can interactively specify the drive, directory, and name of the file. MIL_TEXT(\"FileName\") 1 Specifies the drive, directory, and name of the Deep Learning OCR context file (for example, \"C:\\mydirectory\\MyContext.mdlocr\"). Typically, Deep Learning OCR context files have an MDLOCR extension. To specify a context file on a remote computer (under Distributed MIL), prefix the specified file name string with \"remote:///\" (for example, \"remote:///C:\\mydirectory\\MyContext.mdlocr\"). 1 If you are passing the value in a variable, don't enclose it in MIL_TEXT(). ContextDlocrId Specifies the identifier of the Deep Learning OCR context to save. ControlFlag Reserved for future expansion and must be set to M_DEFAULT. Compilation information Header Include mil.h. Library Use mil.lib; mildlocr.lib. DLL Requires mil.dll; mildlocr.dll. Syntax Description Parameters - FileName For specifying the file name and path - ContextDlocrId - ControlFlag Compilation information ",
      "wordCount": 308,
      "subEntries": []
    },
    {
      "id": "Reference_dlocr_MdlocrStream",
      "version": null,
      "title": "MdlocrStream",
      "subTitles": null,
      "location": "MIL Reference",
      "pageURL": "content\\Reference\\dlocr\\MdlocrStream.htm",
      "text": " MdlocrStream Synopsis Load, restore, or save a Deep Learning OCR context from/to a file or a memory stream. Syntax void MdlocrStream( MIL_TEXT_PTR&nbsp;MemPtrOrFileName, //in-out MIL_ID&nbsp;SysId, //in MIL_INT64&nbsp;Operation, //in MIL_INT64&nbsp;StreamType, //in MIL_DOUBLE&nbsp;Version, //in MIL_INT64&nbsp;ControlFlag, //in MIL_ID&nbsp;*ContextDlocrIdPtr, //in-out MIL_INT&nbsp;*SizeByteVarPtr //out ) Description This function can load, restore, or save a Deep Learning OCR context from/to a file or memory stream. All information about the previously allocated context is saved, including all of the string model-specific settings and positional constraints. Preprocessing changes are not saved. To inquire the number of bytes necessary to save a Deep Learning OCR context to memory stream, first call MdlocrStream() with M_INQUIRE_SIZE_BYTE. The content saved to memory stream is equivalent to the content saved to file. In addition, any file saved using this function is equivalent to a file saved with MdlocrSave(). You can use this and other MIL stream functions, for example, to save all required MIL objects, as well as any other custom data, for your application to a memory stream. Once in a memory stream, you can write the stream to a single file or transfer it over a network. You are responsible for concatenating the streams and for saving the stream to file. All of the context settings that were in effect when the context was saved will be restored. A loaded or restored context is not preprocessed. You must call MdlocrPreprocess() before performing a read with MdlocrRead(). Parameters Parameters MemPtrOrFileName Accepts the address of one of the following (see the Parameter associations section for specifics on which is expected): MIL_TEXT_PTR [optionally, in C++: a reference to a MIL_STRING] Optionally, in C++: a reference to a std::vector of type MIL_UINT8 Specifies the file or memory stream. See the Parameter associations section for possible values that can be returned/specified. SysId Specifies the identifier of the system on which to restore the Deep Learning OCR context. See the Parameter associations section for possible values that can be specified. Operation Specifies the operation to perform on the Deep Learning OCR context. See the Parameter associations section for possible values that can be specified. StreamType Specifies the type of stream in which to store/from which to restore the Deep Learning OCR context. Set this parameter to one of the values below: For specifying the type of stream Value Description M_FILE Specifies a file stream. M_MEMORY Specifies a memory stream. You are responsible for allocating a block of memory for the stream. Version Specifies the MIL version of the Deep Learning OCR context. See the Parameter associations section for possible values that can be specified. ControlFlag Reserved for future expansion and must be set to M_DEFAULT. ContextDlocrIdPtr Specifies the address of the variable in which to write or from which to read the identifier of the Deep Learning OCR context. See the Parameter associations section for possible values that can be returned/specified. SizeByteVarPtr Specifies the address of the variable in which to write the size of the Deep Learning OCR context, in bytes. If size is not required, set this parameter to M_NULL. The size of the context varies depending on the MIL version specified. Parameter associations The table below lists possible values for the MemPtrOrFileName, SysId, Operation, Version, and ContextDlocrIdPtr parameters. For performing the stream operation. For performing the stream operation. Operation Description MemPtrOrFileName - Possible values passed or returned SysId Version ContextDlocrIdPtr - Possible values passed or returned M_INQUIRE_SIZE_BYTE Inquires the number of bytes required to save a Deep Learning OCR context to memory stream. This operation is not supported when the StreamType parameter is set to M_FILE. MemPtrOrFileName This parameter must be set to M_NULL. SysId This parameter must be set to M_NULL. Version Specifies the MIL version with which the Deep Learning OCR context must be compatible when saved. The size of a Deep Learning OCR context might differ from one MIL version to another. M_DEFAULT Specifies the current version of MIL. M_PROC_VERSION_100_SP7 Specifies the version as being MIL 10.0 Service Pack 7. ContextDlocrIdPtr Specifies the address of the variable containing the identifier of the Deep Learning OCR context. M_LOAD Loads the content of a specified file or memory stream into a previously allocated Deep Learning OCR context. MemPtrOrFileName Specifies the file or memory stream from which to load the context. M_INTERACTIVE [This is only applicable to Windows] Opens a dialog box from which you can interactively specify the drive, directory, and name of the context file, when the StreamType parameter is set to M_FILE. MIL_TEXT(\"FileName\") 1 Specifies the drive, directory, and name of the context file (for example, \"C:\\mydirectory\\MyContext.mdlocr\"), when the StreamType parameter is set to M_FILE. Deep Learning OCR contexts typically have an MDLOCR file extension. The function handles (internally) the opening and closing of the file. To specify a context file on a remote computer (under Distributed MIL), prefix the specified file name string with \"remote:///\" (for example, \"remote:///C:\\mydirectory\\MyContext.mdlocr\"). MemPtr Specifies the address of the block of memory, when the StreamType parameter is set to M_MEMORY. The block of memory should be of type MIL_UINT8. The specified address must correspond to the first memory address in which the object is located, and the block of memory must contain the entire object. Note that when using a C compiler (not a C++ or other compiler), you must cast the MIL_UINT8 pointer to a MIL_TEXT_PTR. SysId This parameter must be set to M_NULL. Version This parameter must be set to M_DEFAULT. ContextDlocrIdPtr Specifies the address of the variable containing the identifier of the Deep Learning OCR context. All previous settings are overwritten with those of the loaded context, or are set to the default value if the settings didn't exist in the version of MIL from which the context is being loaded. M_RESTORE Restores a Deep Learning OCR context from a file or memory stream and assigns it a MIL identifier. MemPtrOrFileName Specifies the file or memory stream from which to restore the context. M_INTERACTIVE [This is only applicable to Windows] Opens a dialog box from which you can interactively specify the drive, directory, and name of the context file, when the StreamType parameter is set to M_FILE. MIL_TEXT(\"FileName\") 1 Specifies the drive, directory, and name of the context file (for example, \"C:\\mydirectory\\MyContext.mdlocr\"), when the StreamType parameter is set to M_FILE. Deep Learning OCR contexts typically have an MDLOCR file extension. The function handles (internally) the opening and closing of the file. To specify a context file on a remote computer (under Distributed MIL), prefix the specified file name string with \"remote:///\" (for example, \"remote:///C:\\mydirectory\\MyContext.mdlocr\"). MemPtr Specifies the address of the block of memory, when the StreamType parameter is set to M_MEMORY. The block of memory should be of type MIL_UINT8. The specified address must correspond to the first memory address in which the object is located, and the block of memory must contain the entire object. Note that when using a C compiler (not a C++ or other compiler), you must cast the MIL_UINT8 pointer to a MIL_TEXT_PTR. SysId Specifies the system on which to allocate the Deep Learning OCR context. M_DEFAULT_HOST Specifies the default Host system of the current MIL application. MIL system identifier Specifies a valid system identifier, previously allocated using MsysAlloc(). Version This parameter must be set to M_DEFAULT. ContextDlocrIdPtr Specifies the address of the variable in which to write the identifier of the Deep Learning OCR context. If the operation is not successful, M_NULL is returned. M_SAVE Saves a Deep Learning OCR context to a specified file or memory stream. MemPtrOrFileName Specifies the file or memory stream. M_INTERACTIVE [This is only applicable to Windows] Opens a dialog box from which you can interactively specify the drive, directory, and name of the context file, when the StreamType parameter is set to M_FILE. MIL_TEXT(\"FileName\") 1 Specifies the drive, directory, and name of the context file (for example, \"C:\\mydirectory\\MyContext.mdlocr\"), when the StreamType parameter is set to M_FILE. Deep Learning OCR contexts typically have an MDLOCR file extension. The function handles (internally) the opening and closing of the file. If the file already exists, it will be overwritten. To specify a context file on a remote computer (under Distributed MIL), prefix the specified file name string with \"remote:///\" (for example, \"remote:///C:\\mydirectory\\MyContext.mdlocr\"). MemPtr Specifies the address of the block of memory, when the StreamType parameter is set to M_MEMORY. The block of memory should be of type MIL_UINT8. The specified address must correspond to the first memory address in which to write, and the block of memory must be large enough to stream the entire object. To determine the required size, call this function with M_INQUIRE_SIZE_BYTE. Note that when using a C compiler (not a C++ or other compiler), you must cast the MIL_UINT8 pointer to a MIL_TEXT_PTR. SysId This parameter must be set to M_NULL. Version Specifies the MIL version with which the Deep Learning OCR context must be compatible when saved. M_DEFAULT Specifies the current version of MIL. M_PROC_VERSION_100_SP7 Specifies the version as being MIL 10.0 Service Pack 7. ContextDlocrIdPtr Specifies the address of the variable containing the identifier of the Deep Learning OCR context to save. 1 If you are passing the value in a variable, don't enclose it in MIL_TEXT(). Compilation information Header Include mil.h. Library Use mil.lib; mildlocr.lib. DLL Requires mil.dll; mildlocr.dll. Syntax Description Parameters - MemPtrOrFileName - SysId - Operation - StreamType For specifying the type of stream - Version - ControlFlag - ContextDlocrIdPtr - SizeByteVarPtr Parameter Associations For performing the stream operation. Compilation information ",
      "wordCount": 1568,
      "subEntries": []
    }
  ]
}]