[{
  "id": "Reference_dmr",
  "version": "2024020714",
  "title": "dmr",
  "subTitles": null,
  "location": "MIL Reference",
  "pageURL": "content\\Reference\\dmr\\ModuleInformation.htm",
  "text": " Mdmr functions Synopsis The functions prefixed with Mdmr make up the SureDotOCR module. The SureDotOCR module performs optical character recognition on dot-matrix text using feature-based technologies. You can quickly create fonts and string models and use them to perform robust read operations. SureDotOCR is invariant to changes in contrast, and offers considerable tolerance towards variations in angle. The module can also adapt to some variations in scale, aspect ratio, and perspective. SureDotOCR supports multiple grammar-like rules and font definitions in a single context, and provides its own font file format, allowing you to more easily manage your fonts. Functions MdmrAlloc MdmrAllocResult MdmrControl MdmrControlFont MdmrControlStringModel MdmrDraw MdmrExportFont MdmrFree MdmrGetResult MdmrImportFont MdmrInquire MdmrInquireFont MdmrInquireStringModel MdmrName MdmrPreprocess MdmrRead MdmrRestore MdmrSave MdmrStream ",
  "wordCount": 120,
  "subEntries": [
    {
      "id": "Reference_dmr_MdmrAlloc",
      "version": null,
      "title": "MdmrAlloc",
      "subTitles": null,
      "location": "MIL Reference",
      "pageURL": "content\\Reference\\dmr\\MdmrAlloc.htm",
      "text": " MdmrAlloc Synopsis Allocate a SureDotOCR context. Syntax MIL_ID MdmrAlloc( MIL_ID&nbsp;SysId, //in MIL_INT64&nbsp;ContextType, //in MIL_INT64&nbsp;ControlFlag, //in MIL_ID&nbsp;*ContextDmrIdPtr //out ) Description This function allocates a SureDotOCR context on the specified system. A SureDotOCR context contains information required to use the MIL SureDotOCR functions, which are prefixed with Mdmr; these functions allow you to read strings of dot-matrix text. Global settings, fonts, and string models are all held in a SureDotOCR context; use MdmrControl(), MdmrImportFont(), and MdmrControlStringModel() to set these up, respectively. Use MdmrRead() to perform the actual read operation. To read successfully, a SureDotOCR context must have at least one font and one string model. A SureDotOCR context internally handles characters in Unicode, though you can program in both a Unicode or ASCII environment. When the SureDotOCR context is no longer required, release it using MdmrFree() unless M_UNIQUE_ID was specified during allocation; if M_UNIQUE_ID was specified, the smart identifier manages the SureDotOCR context's lifetime and you must not manually free it. Parameters Parameters SysId Specifies the identifier of the system on which to allocate the SureDotOCR context. Set this parameter to one of the values below: For specifying the system identifier Value Description M_DEFAULT_HOST Specifies the default Host system of the current MIL application. MIL system identifier Specifies a valid system identifier, previously allocated using MsysAlloc(). ContextType Specifies the type of context to allocate. Set this parameter to the value below: For specifying the type of context to allocate Value Description M_DOT_MATRIX Specifies to allocate a MIL SureDotOCR context. ControlFlag Reserved for future expansion and must be set to M_DEFAULT. ContextDmrIdPtr Specifies the address of the variable in which to write the SureDotOCR context identifier or specifies the data type that the function should use to return the SureDotOCR context identifier. For retrieving the identifier or specifying how to return it Value Description M_NULL Specifies that you will use this function's return value to obtain the identifier of the allocated SureDotOCR context ; in this case, a standard MIL identifier of type MIL_ID is returned. M_UNIQUE_ID Specifies that you will use this function's return value to obtain the identifier of the allocated SureDotOCR context ; in this case, a MIL smart identifier of type MIL_UNIQUE_DMR_ID is returned instead of a standard MIL identifier. This setting is only available when using C++11 (or later). A MIL smart identifier manages the lifespan of the MIL object it owns (similar to a std::unique_ptr). Note, you can use a MIL smart identifier as though it were a standard MIL identifier, except that you cannot use it to manually free the SureDotOCR context (it is freed automatically). For more information, see the MIL smart identifiers subsection of the MIL custom data types, void pointers, extensions, and portability functions section of Chapter 2: Building an application. Address in which to write the identifier Specifies the address of a MIL_ID in which to write the identifier of the allocated SureDot OCR context. If allocation fails, M_NULL is written as the identifier. Return value The returned value is the SureDotOCR context identifier either as a standard identifier (MIL_ID) or a smart identifier (MIL_UNIQUE_DMR_ID). If allocation fails, M_NULL is returned (or nullptr if M_UNIQUE_ID was specified). Compilation information Header Include mil.h. Library Use mil.lib; mildmr.lib. DLL Requires mil.dll; mildmr.dll. Syntax Description Parameters - SysId For specifying the system identifier - ContextType For specifying the type of context to allocate - ControlFlag - ContextDmrIdPtr For retrieving the identifier or specifying how to return it Return value Compilation information ",
      "wordCount": 578,
      "subEntries": []
    },
    {
      "id": "Reference_dmr_MdmrAllocResult",
      "version": null,
      "title": "MdmrAllocResult",
      "subTitles": null,
      "location": "MIL Reference",
      "pageURL": "content\\Reference\\dmr\\MdmrAllocResult.htm",
      "text": " MdmrAllocResult Synopsis Allocate a SureDotOCR result buffer. Syntax MIL_ID MdmrAllocResult( MIL_ID&nbsp;SysId, //in MIL_INT64&nbsp;ResultType, //in MIL_INT64&nbsp;ControlFlag, //in MIL_ID&nbsp;*ResultDmrIdPtr //out ) Description This function allocates a SureDotOCR result buffer, on the specified system, to store results obtained from an MdmrRead() operation. When the SureDotOCR result buffer is no longer required, release it using MdmrFree() unless M_UNIQUE_ID was specified during allocation; if M_UNIQUE_ID was specified, the smart identifier manages the SureDotOCR result buffer's lifetime and you must not manually free it. Parameters Parameters SysId Specifies the identifier of the system on which to allocate the SureDotOCR result buffer. Set this parameter to one of the values below: For specifying the system identifier Value Description M_DEFAULT_HOST Specifies the default Host system of the current MIL application. MIL system identifier Specifies a valid system identifier, previously allocated using MsysAlloc(). ResultType Specifies the type of result buffer to allocate. Set this parameter to the value below: For specifying the type of result buffer to allocate Value Description M_DOT_MATRIX Specifies to allocate a SureDotOCR result buffer. ControlFlag Reserved for future expansion and must be set to M_DEFAULT. ResultDmrIdPtr Specifies the address of the variable in which to write the SureDotOCR result buffer identifier or specifies the data type that the function should use to return the SureDotOCR result buffer identifier. For retrieving the identifier or specifying how to return it Value Description M_NULL Specifies that you will use this function's return value to obtain the identifier of the allocated SureDotOCR result buffer ; in this case, a standard MIL identifier of type MIL_ID is returned. M_UNIQUE_ID Specifies that you will use this function's return value to obtain the identifier of the allocated SureDotOCR result buffer ; in this case, a MIL smart identifier of type MIL_UNIQUE_DMR_ID is returned instead of a standard MIL identifier. This setting is only available when using C++11 (or later). A MIL smart identifier manages the lifespan of the MIL object it owns (similar to a std::unique_ptr). Note, you can use a MIL smart identifier as though it were a standard MIL identifier, except that you cannot use it to manually free the SureDotOCR result buffer (it is freed automatically). For more information, see the MIL smart identifiers subsection of the MIL custom data types, void pointers, extensions, and portability functions section of Chapter 2: Building an application. Address in which to write the identifier Specifies the address of a MIL_ID in which to write the identifier of the allocated SureDot OCR result buffer. If allocation fails, M_NULL is written as the identifier. Return value The returned value is the SureDotOCR result buffer identifier either as a standard identifier (MIL_ID) or a smart identifier (MIL_UNIQUE_DMR_ID). If allocation fails, M_NULL is returned (or nullptr if M_UNIQUE_ID was specified). Compilation information Header Include mil.h. Library Use mil.lib; mildmr.lib. DLL Requires mil.dll; mildmr.dll. Syntax Description Parameters - SysId For specifying the system identifier - ResultType For specifying the type of result buffer to allocate - ControlFlag - ResultDmrIdPtr For retrieving the identifier or specifying how to return it Return value Compilation information ",
      "wordCount": 508,
      "subEntries": []
    },
    {
      "id": "Reference_dmr_MdmrControl",
      "version": null,
      "title": "MdmrControl",
      "subTitles": null,
      "location": "MIL Reference",
      "pageURL": "content\\Reference\\dmr\\MdmrControl.htm",
      "text": " MdmrControl Synopsis Control a SureDotOCR context or result buffer. Syntax void MdmrControl( MIL_ID&nbsp;ContextOrResultDmrId, //in MIL_INT64&nbsp;ControlType, //in MIL_DOUBLE&nbsp;ControlValue //in ) Description This function allows you to control a SureDotOCR context or a SureDotOCR result buffer. This includes adding or deleting a font or string model from a context, or removing all results from a result buffer. To inquire about a context, call MdmrInquire(). To get results from a result buffer, call MdmrGetResult(). To control the fonts and string models held by a SureDotOCR context, call MdmrControlFont() and MdmrControlStringModel(), respectively. For a successful read operation, you must specify an explicit value for the control types that set the diameter of the dots in the string's characters (M_DOT_DIAMETER). You must specify the dimensions of the dot-matrix text block using M_TEXT_BLOCK_HEIGHT and M_TEXT_BLOCK_WIDTH; the dot-matrix text block is the area in the image buffer (or in the buffer's region of interest) that includes all dot-matrix text. You must preprocess the SureDotOCR context after you have finished adjusting context settings and before calling MdmrRead(). To know if a context needs to be preprocessed, call MdmrInquire() with M_PREPROCESSED. Note that when using a C compiler (not a C++ or other compiler) in 64-bit mode, MdmrControl() internally calls the MIL_DOUBLE version of this function (MdmrControlDouble()). If you need to pass large integer values (including pointers), call the MIL_INT64 version of this function (MdmrControlInt64()). Parameters Parameters ContextOrResultDmrId Specifies the identifier of the SureDotOCR context or result buffer to control. The context must have been previously allocated on the system using MdmrAlloc(). The result buffer must have been previously allocated on the system using MdmrAllocResult(). ControlType Specifies the type of control to set. See the Parameter associations section for possible values that can be specified. ControlValue Specifies the required value for the control. See the Parameter associations section for possible values that can be specified. Parameter associations The tables below list possible values for the ControlType and ControlValue parameters. For controlling a SureDotOCR context setting For adding fonts or string models to, or deleting fonts or string models from, a SureDotOCR context For controlling a SureDotOCR result buffer The following ControlType and corresponding ControlValue parameter settings are used to control a setting of the SureDotOCR context specified with the ContextOrResultDmrId parameter. SureDotOCR can only read strings that adhere to these settings (they apply to all strings in the context). If there are strings that require different settings, use a separate context. For controlling a SureDotOCR context setting ControlType Description ControlValue M_DOT_DIAMETER Sets the diameter of the dots that make up the characters in the strings. Value &gt; 0.0 Specifies the diameter, in pixels. M_DOT_DIAMETER_SPREAD Sets the supported spread of the dots. This essentially sets the tolerance for the size of the dot diameter, as a value centered around the specified nominal dot diameter (M_DOT_DIAMETER). For example, if M_DOT_DIAMETER is set to 4.0 and this control type is set to 2.0, MIL will read all dots between the size of 3.0 and 5.0. This control type is ignored if M_DOT_DIAMETER_SPREAD_MODE is set to M_DISABLE. M_DEFAULT Specifies the default value; the default value is 1.0. Value &gt;= 0.0 Specifies the tolerance for the size of the dot diameter, in pixels. M_DOT_DIAMETER_SPREAD_MODE Sets whether the dot diameter can vary within a specified range of possible diameters specified using M_DOT_DIAMETER. M_DEFAULT Same as M_DISABLE. M_DISABLE Specifies that the M_DOT_DIAMETER_SPREAD is ignored. M_ENABLE Specifies that M_DOT_DIAMETER_SPREAD is used during a read operation. M_DOT_DIAMETER_STEP Sets the increment between steps that will be used when checking for dots in the range of supported dot diameters, set using M_DOT_DIAMETER_SPREAD. For example, if M_DOT_DIAMETER is set to 1.0, M_DOT_DIAMETER_SPREAD is set to 2.0, and this control type is set to 0.2, MIL will check 1.2, 1.4, 1.6 and so on. This control type is ignored if M_DOT_DIAMETER_SPREAD_MODE is set to M_DISABLE. M_DEFAULT Specifies the default value; the default value is 0.1. Value &gt; 0.0 Specifies the step, in pixels. M_FOREGROUND_VALUE Sets the foreground value of the characters in the strings. M_DEFAULT Same as M_FOREGROUND_BLACK. M_FOREGROUND_BLACK Specifies that strings with characters darker than the background will be read. For example, black characters on a white surface. M_FOREGROUND_WHITE Specifies that strings with characters lighter than the background will be read. For example, white characters on a black surface. M_ITALIC_ANGLE Sets the italic angle of all the characters in the strings. The angle must be provided counter clockwise and is relative a line perpendicular to the angle of the string. M_ITALIC_ANGLE only has an effect if M_ITALIC_ANGLE_MODE is set to M_ANGLE. M_DEFAULT Specifies the default value; the default value is 0. -90.0 &lt;= Value &lt;= 90.0 Specifies the italic angle, in degrees. A positive angle means that the characters are leaning counter-clockwise (left leaning); a negative angle means that the characters are leaning clockwise (right leaning). M_ITALIC_ANGLE_MODE Sets whether the italic angle is detected automatically or explicitly specified. M_ITALIC_ANGLE_MODE must be set to M_DEFAULT if M_STRING_ANGLE_MODE is set to M_DEFAULT; otherwise, MdmrPreprocess() will generate an error when called. M_DEFAULT Specifies the default value; the default value is M_AUTO. M_ANGLE Specifies to use the italic angle specified with M_ITALIC_ANGLE. A string will only be read if its characters have the specified italic angle. M_AUTO Specifies that the italic angle is detected automatically. M_ITALIC_ANGLE is ignored. M_ITALIC_PITCH Sets the distance between successive dot centers in the italic angle direction. M_ITALIC_PITCH only has an effect if M_ITALIC_PITCH_MODE is set to M_USER_DEFINED. M_DEFAULT Specifies the default value; the default value is 3.0 pixels. Value &gt; 0.0 Specifies the pitch, in pixels. M_ITALIC_PITCH_MODE Sets whether the distance between successive dot centers, in the italic angle direction, is detected automatically or explicitly specified. M_DEFAULT Specifies the default value; the default value is M_AUTO. M_AUTO Specifies to automatically establish the distance between dot centers in the italic angle direction. M_USER_DEFINED Specifies to use the value set with M_ITALIC_PITCH. A string will only be read if its characters have the specified italic pitch. M_MAX_INTENSITY Sets the maximum pixel intensity of a character's dots. M_MAX_INTENSITY only has an effect if M_MAX_INTENSITY_MODE is set to M_USER_DEFINED. M_DEFAULT Specifies the default value; the default value is 255.0. 0.0 &lt;= Value &lt;= 255.0 Specifies the maximum pixel intensity. M_MAX_INTENSITY_MODE Sets how to establish the maximum pixel intensity of a character's dots. For a dot to be part of a character, its pixel intensity must be less than or equal to the maximum intensity. M_DEFAULT Same as M_AUTO. M_AUTO Specifies to automatically establish the maximum pixel intensity of a character's dots. By default, SureDotOCR considers dots with any pixel intensity less than or equal to 255.0. M_USER_DEFINED Specifies to use the maximum pixel intensity value set with M_MAX_INTENSITY. M_MIN_CONTRAST Sets the minimum contrast between a character and its background. M_MIN_CONTRAST only has an effect if M_MIN_CONTRAST_MODE is set to M_USER_DEFINED. M_DEFAULT Specifies the default value; the default value is 15.0. 0.0 &lt;= Value &lt;= 255.0 Specifies the minimum contrast. M_MIN_CONTRAST_MODE Sets how to establish the minimum contrast (difference in pixel intensity) between a character (foreground) and its background. For a character to be read, its contrast must be greater than or equal to the minimum contrast. M_DEFAULT Same as M_AUTO. M_AUTO Specifies to automatically establish the minimum contrast of characters. By default, SureDotOCR will not read characters with a contrast less than 15.0. M_USER_DEFINED Specifies to use the minimum contrast value set with M_MIN_CONTRAST. M_MIN_INTENSITY Sets the minimum pixel intensity of a character's dots. M_MIN_INTENSITY only has an effect if M_MIN_INTENSITY_MODE is set to M_USER_DEFINED. M_DEFAULT Specifies the default value; the default value is 0.0. 0.0 &lt;= Value &lt;= 255.0 Specifies the minimum pixel intensity. M_MIN_INTENSITY_MODE Sets how to establish the minimum pixel intensity of a character's dots. For a dot to be part of a character, its intensity must be greater than or equal to the minimum intensity. M_DEFAULT Same as M_AUTO. M_AUTO Specifies to automatically establish the minimum pixel intensity of character dots. By default, SureDotOCR considers dots with any pixel intensity greater than or equal to 0.0. M_USER_DEFINED Specifies to use the minimum pixel intensity value set with M_MIN_INTENSITY. M_SPACE_SIZE_MAX Sets the value with which to determine the maximum width of a space character. This value is interpreted according to M_SPACE_SIZE_MAX_MODE. M_DEFAULT Specifies the default value; the default value is 3.0. Value &gt; 0.0 Specifies the maximum width value. M_SPACE_SIZE_MAX_MODE Sets how to determine the maximum width of a space character. If the actual distance between two characters is greater than the maximum width, the read operation considers them part of separate strings. M_SPACE_SIZE_MAX_MODE indicates how to interpret M_SPACE_SIZE_MAX. M_DEFAULT Same as M_CHAR_WIDTH_FACTOR. M_CHAR_WIDTH_FACTOR Specifies that the maximum width of a space character is determined by multiplying the M_SPACE_SIZE_MAX value by the string's maximum character width, in pixels. For example, if M_SPACE_SIZE_MAX is set to 3 (M_DEFAULT), the maximum space character width is equivalent to three times the string's maximum character width. M_DISABLE Specifies no maximum space width. This is equivalent to allowing an infinite amount of maximum space. In this case, no amount of space between aligned characters can cause them to be part of separate strings. This does not apply to characters on separate lines or severely misaligned characters. M_SPACE_SIZE_MIN Sets the value with which to determine the minimum width of a space character. This value is interpreted according to M_SPACE_SIZE_MIN_MODE. M_DEFAULT Specifies the default value; the default value is 1.0. Value &gt; 0.0 Specifies the minimum width value. M_SPACE_SIZE_MIN_MODE Sets how to determine the minimum width of a space character. If the actual distance between two characters is less than the minimum width, SureDotOCR does not consider there to be a space. M_SPACE_SIZE_MIN_MODE indicates how to interpret M_SPACE_SIZE_MIN. M_DEFAULT Same as M_CHAR_WIDTH_FACTOR. M_CHAR_WIDTH_FACTOR Specifies that the minimum width of a space character is determined by multiplying the M_SPACE_SIZE_MIN value by the string's maximum character width, in pixels. For example, if M_SPACE_SIZE_MIN is set to 1 (M_DEFAULT), the minimum space character width is equivalent to the string's maximum character width. M_DISABLE Specifies no minimum space width. This is equivalent to allowing an infinite amount of minimum space. In this case, no amount of space between characters in a string can cause SureDotOCR to recognize an actual space. M_STRING_ANGLE Sets at which angle to read a string, with respect to the coordinate system specified with M_STRING_ANGLE_INPUT_UNITS. M_DEFAULT Specifies the default value; the default value is 0. M_ACCORDING_TO_REGION Specifies that the angle is set to the angle of the target image's ROI. If this value is chosen but no ROI has been defined, the angle is set to 0.0° in the coordinate system specified with M_STRING_ANGLE_INPUT_UNITS. 0.0 &lt;= Value &lt;= 360.0 Specifies a fixed angle at which to read a string, in degrees. This is interpreted with respect to the X-axis of the coordinate system specified with M_STRING_ANGLE_INPUT_UNITS. M_STRING_ANGLE_INPUT_UNITS Sets the coordinate system to use for M_STRING_ANGLE. This control type is ignored when M_STRING_ANGLE is set to M_ACCORDING_TO_REGION. M_DEFAULT Same as M_PIXEL. M_PIXEL Specifies to interpret the value in pixel units, with respect to the pixel coordinate system. M_WORLD Specifies to interpret the value in world units, with respect to the relative coordinate system. M_STRING_ANGLE_MODE Sets whether the string angle is detected automatically or explicitly specified. M_DEFAULT Specifies the default value; the default value is M_AUTO. M_ANGLE Specifies to use the angle specified with M_STRING_ANGLE; the string will be read from left to right with the characters facing upward along the specified angle. A string will only be read if it has the specified angle. M_AUTO Specifies that the string angle is detected automatically; M_STRING_ANGLE is ignored. M_ORIENTATION Specifies that the string will be read from left to right with the characters facing upward, or from right to left with the character facing downward. This is useful in cases where the orientation of a string is rotated 180 degrees, and this rotation does not affect the acceptability of a product (for example, if the product is placed backwards at an inspection point but is still a good part). M_STRING_PARTIAL_CHAR_INVALID Sets the single character string to replace invalid or unrecognized characters if M_STRING_PARTIAL_MODE is enabled. The default value is \"?\". Note that the specified character is validated during the preprocess operation to confirm that the selected character does not appear in any font in the context. MIL_TEXT(\"?\") 1 Specifies the default value as \"?\". Note, if using a C compiler, you must pass the value as M_PTR_TO_MIL_INT(MIL_TEXT(\"?\")). MIL_TEXT(\"SingleCharacterString\") 1 Specifies the single character string to replace the invalid or unrecognized characters. Note, if using a C compiler, you must pass the value as M_PTR_TO_MIL_INT(MIL_TEXT(\"SingleCharacterString\")). M_STRING_PARTIAL_MODE Sets how partial strings are returned during the reading process. M_DEFAULT Same as M_DISABLE. M_DISABLE Specifies that only complete strings will be returned. M_ENABLE Specifies that the best match for a partial string will be returned; unrecognized characters in the string will be replaced with M_STRING_PARTIAL_CHAR_INVALID. M_STRING_PITCH Sets the distance between successive dot centers, in the string angle direction. M_STRING_PITCH only has an effect if M_STRING_PITCH_MODE is set to M_USER_DEFINED. M_DEFAULT Specifies the default value; the default value is 3.0 pixels. Value &gt; 0.0 Specifies the pitch, in pixels. M_STRING_PITCH_MODE Sets whether the distance between successive dot centers, in the string angle direction, is detected automatically or explicitly specified. M_DEFAULT Specifies the default value; the default value is M_AUTO. M_AUTO Specifies to automatically establish the distance between dot centers in the string angle direction. M_USER_DEFINED Specifies to use the value set with M_STRING_PITCH. A string will only be read if it has the specified string pitch. M_TEXT_BLOCK_HEIGHT Sets the height of the text block. This is the area that encloses all dot-matrix text in the image buffer (or in the buffer's region of interest). The height is oriented along the vertical axis that is perpendicular to the base of the string(s) to read in the text block. M_TEXT_BLOCK_HEIGHT only has an effect if M_TEXT_BLOCK_SIZE_MODE is set to M_USER_DEFINED. Value &gt; 0.0 Specifies the height, in pixels. M_TEXT_BLOCK_SIZE_MODE Sets how to establish the size of the text block. This is the area that encloses all dot-matrix text in the image buffer (or in the buffer's region of interest). M_DEFAULT Same as M_USER_DEFINED. M_USER_DEFINED Specifies that the size of the rectangular block is defined by the M_TEXT_BLOCK_HEIGHT and M_TEXT_BLOCK_WIDTH settings. M_TEXT_BLOCK_WIDTH Sets the width of the text block. This is the area that encloses all dot-matrix text in the image buffer (or in the buffer's region of interest). The width is oriented along the axis that represents the base of the string(s) to read in the text block. M_TEXT_BLOCK_WIDTH only has an effect if M_TEXT_BLOCK_SIZE_MODE is set to M_USER_DEFINED. Value &gt; 0.0 Specifies the width, in pixels. M_TIMEOUT Sets the maximum read time for MdmrRead(). No results are returned if the read operation times out. M_DEFAULT Specifies the default value; the default value is 2000.0 msec. M_DISABLE Specifies an infinite amount of read time. Value &gt;= 0.0 Specifies the maximum read time, in msec. 1 If you are passing the value in a variable, don't enclose it in MIL_TEXT(). The following ControlType and corresponding ControlValue parameter settings are used to add fonts or string models to, or delete fonts or string models from, the SureDotOCR context specified with the ContextOrResultDmrId parameter. For adding fonts or string models to, or deleting fonts or string models from, a SureDotOCR context ControlType Description ControlValue M_FONT_ADD Adds an empty font to the context. To add characters to a font, use MdmrImportFont(). You can also add characters to a font, or modify its settings, using MdmrControlFont(). The maximum number of fonts in a context is 255. To inquire the number of fonts in the context, call MdmrInquire() with M_NUMBER_OF_FONTS. When you add an empty font, the dimensions of its dot-matrix template are initially set to 5 columns and 7 rows. If the font is empty, you can change these values by calling MdmrControlFont() with M_FONT_SIZE_COLUMNS and M_FONT_SIZE_ROWS. M_DEFAULT Same as M_NEW_LABEL. M_NEW_LABEL Specifies to add a font with an automatically assigned label. To inquire about the label, use MdmrInquireFont() with M_FONT_LABEL_VALUE. To change the label, use MdmrControlFont() with M_FONT_LABEL_VALUE. Value &gt; 0 Specifies to add a font with the indicated label, as an integer. The label must be unique among all font labels in the context. M_FONT_DELETE Deletes one or all fonts from the context. M_DEFAULT Same as M_ALL. M_FONT_INDEX( MIL_INT IndexValue ) Specifies to delete the font by indicating its index. Parameters IndexValue Set this parameter to the following: 0 &lt;= Value &lt; M_NUMBER_OF_FONTS Specifies the index of the font to delete. M_FONT_LABEL( MIL_INT LabelValue ) Specifies to delete the font by indicating its label. Parameters LabelValue Set this parameter to the following: Value &gt; 0 Specifies the label of the font to delete. M_ALL Specifies to delete all fonts. M_STRING_ADD Adds an empty string model to a context. To add character constraints to the string model, or to modify its settings, use MdmrControlStringModel(). The maximum number of string models in a context is 255. To inquire the number of string models in a context, call MdmrInquire() with M_NUMBER_OF_STRING_MODELS. M_DEFAULT Same as M_NEW_LABEL. M_NEW_LABEL Specifies to add a string model with an automatically assigned label. To inquire about the label, use MdmrInquireStringModel() with M_STRING_LABEL_VALUE. To change the label, use MdmrControlStringModel() with M_STRING_LABEL_VALUE. Value &gt; 0 Specifies to add a string model with the indicated label, as an integer. The label must be unique among all string model labels in the context. M_STRING_DELETE Deletes one or all string models from a context. M_DEFAULT Same as M_ALL. M_STRING_INDEX( MIL_INT IndexValue ) Specifies to delete the string model by indicating its index. Parameters IndexValue Set this parameter to the following: 0 &lt;= Value &lt; M_NUMBER_OF_STRING_MODELS Specifies the index of the string model to delete. M_STRING_LABEL( MIL_INT LabelValue ) Specifies to delete the string model by indicating its label. Parameters LabelValue Set this parameter to the following: Value &gt; 0 Specifies the label of the string model to delete. M_ALL Specifies to delete all string models. The following ControlType and corresponding ControlValue parameter settings are used to control the SureDotOCR result buffer specified with the ContextOrResultDmrId parameter. For controlling a SureDotOCR result buffer ControlType Description ControlValue M_RESET Removes all results from the SureDotOCR result buffer. This does not delete the result buffer identifier, as is the case with MdmrFree(). M_DEFAULT Specifies the default behavior. M_RESULT_OUTPUT_UNITS Sets whether to return results in pixels or world units. This essentially sets the output coordinate system to use. The setting of this control type will only affect functions within this module which return positional results. This control type can be changed at any time to return results in the required output units. M_DEFAULT Same as M_ACCORDING_TO_CALIBRATION. M_ACCORDING_TO_CALIBRATION Specifies that results are returned in world units if the result was calculated on an image associated with a camera calibration context; otherwise, specifies that results are returned in pixel units. M_PIXEL Specifies that results are returned in pixel units, with respect to the pixel coordinate system. M_WORLD Specifies that results are returned in world units, with respect to the relative coordinate system. If world units are specified, calling MstrGetResult() generates an error if the result was not calculated on a calibrated image. M_STOP_READ Stops the current read operation. You can only perform this operation from another thread of higher priority. No results are returned if you stop the read operation. M_DEFAULT Specifies the default behavior. Type-specific versions of the function when using a C compiler under 64-bit void MdmrControlInt64 (MIL_ID ContextOrResultDmrId, MIL_INT64 ControlType, MIL_INT64 ControlValue) Details Parameters ContextOrResultDmrId See ContextOrResultDmrId of the main function for a description. ControlType See ControlType of the main function for a description. ControlValue See ControlValue of the main function for a description. void MdmrControlDouble (MIL_ID ContextOrResultDmrId, MIL_INT64 ControlType, MIL_DOUBLE ControlValue) Details Parameters ContextOrResultDmrId See ContextOrResultDmrId of the main function for a description. ControlType See ControlType of the main function for a description. ControlValue See ControlValue of the main function for a description. Compilation information Header Include mil.h. Library Use mil.lib; mildmr.lib. DLL Requires mil.dll; mildmr.dll. Syntax Description Parameters - ContextOrResultDmrId - ControlType - ControlValue Parameter Associations For controlling a SureDotOCR context setting For adding fonts or string models to, or deleting fonts or string models from, a SureDotOCR context For controlling a SureDotOCR result buffer Type-specific versions of the function when using a C compiler under 64-bit Compilation information ",
      "wordCount": 3373,
      "subEntries": []
    },
    {
      "id": "Reference_dmr_MdmrControlFont",
      "version": null,
      "title": "MdmrControlFont",
      "subTitles": null,
      "location": "MIL Reference",
      "pageURL": "content\\Reference\\dmr\\MdmrControlFont.htm",
      "text": " MdmrControlFont Synopsis Control a global setting of a font in a SureDotOCR context, or control a character in a font. Syntax void MdmrControlFont( MIL_ID&nbsp;ContextDmrId, //in MIL_INT64&nbsp;FontLabelOrIndex, //in MIL_INT64&nbsp;CharIndex, //in MIL_CONST_TEXT_PTR&nbsp;CharNamePtr, //in MIL_INT64&nbsp;ControlType, //in MIL_DOUBLE&nbsp;ControlValue, //in const void&nbsp;*ControlValuePtr //in ) Description This function allows you to control a global setting of a font in a SureDotOCR context, or to control a character in a font. This includes adding characters to, and deleting characters from, a font. To add a font to a SureDotOCR context, use MdmrControl() with M_FONT_ADD (this adds an empty font). For a successful read operation, the context must have at least one font with one character. The characters held by a font are represented by a dot-matrix. String models use the dot-matrix character representations in the font to define the text to read. Adding or modifying characters with this function requires specifying their dot-matrix representation in an array. You can also add or modify characters by calling MdmrImportFont() with a SureDotOCR font file (more commonly done). To inquire about fonts, use MdmrInquireFont(). You must preprocess the SureDotOCR context after modifying its fonts and before calling MdmrRead(). To know if a context needs to be preprocessed, call MdmrInquire() with M_PREPROCESSED. Note that when using a C compiler (not a C++ or other compiler) in 64-bit mode, MdmrControlFont() internally calls the MIL_DOUBLE version of this function (MdmrControlFontDouble()). If you need to pass large integer values (including pointers), call the MIL_INT64 version of this function (MdmrControlFontInt64()). Parameters Parameters ContextDmrId Specifies the identifier of the SureDotOCR context that contains the fonts to control. The context must have been previously allocated on the system using MdmrAlloc(). FontLabelOrIndex Specifies the font (one or all) to control. Set this parameter to one of the values below: For specifying the font Value Description M_FONT_INDEX( MIL_INT IndexValue ) Specifies to control the font by indicating its index. Parameters IndexValue Specifies the index of the font. 0 &lt;= Value &lt; M_NUMBER_OF_FONTS Specifies the index of the font to control. M_FONT_LABEL( MIL_INT LabelValue ) Specifies to control the font by indicating its label. Parameters LabelValue Specifies the label of the font. 0 &lt; Value &lt; 2097152 Specifies the label of the font to control. M_ALL Specifies to control all fonts. CharIndex Specifies the index of a character in the font, if required. Set this parameter to one of the values below: For specifying the index of a character Value Description M_DEFAULT Specifies that the index of a character is not required. M_ALL Specifies all characters. Only specify this value for M_CHAR_DELETE. Value &gt;= 0 Specifies the index of a character. CharNamePtr Specifies the name of a character in the font, if required. Set this parameter to one of the values below: For specifying the name of the character Value Description M_NULL Specifies that the name of the character is not required. MIL_TEXT(\"CharName\") 1 Specifies the name of the character. For example, 'A' would be the name that identifies the first uppercase letter of the English alphabet. When using the CharNamePtr parameter to specify the name of a character, the CharIndex parameter must be set to M_DEFAULT. When working in an ASCII environment, you can specify Unicode character names; these names must be in hexadecimal format and begin with \"\\x\". This is required for specifying character names beyond the Basic Latin range. For example, Basic Latin does not include the smiley face character; to specify it, use \"\\x263A\". When working in a Unicode environment, you can directly specify the smiley face as the name of the character. Character names must be unique among all character names in the font. Specifying the name of a character that already exists causes an error. To avoid unpredictable results, character names should match the dot-matrix that they represent. 1 If you are passing the value in a variable, don't enclose it in MIL_TEXT(). ControlType Specifies the type of control to set. See the Parameter associations section for possible values that can be specified. ControlValue Specifies the required value for the control. Set this parameter to M_DEFAULT if not used. See the Parameter associations section for possible values that can be specified. ControlValuePtr Accepts the address of one of the following (see the Parameter associations section for specifics on which is expected): array of type MIL_UINT8 [optionally, in C++: a reference to a constant std::vector&lt;MIL_UINT8&gt; ] M_NULL MIL_CONST_TEXT_PTR [optionally, in C++: a reference to a MIL_STRING] Specifies the address which contains more information about the setting's new value. Set this parameter to M_NULL if not used. If you use this parameter, the ControlValue parameter must be M_DEFAULT. See the Parameter associations section for possible values that can be specified. Parameter associations The tables below list possible values for the ControlType, ControlValue, and ControlValuePtr parameters. For controlling a global setting of a font For controlling a font's characters The following ControlType and corresponding ControlValue and ControlValuePtr parameter settings are used to control a global setting of a font. Unless otherwise specified, set the FontLabelOrIndex parameter to the label or index of a font (one or all), set the CharIndex parameter to M_DEFAULT, and set the CharNamePtr parameter to M_NULL. For controlling a global setting of a font ControlType Description ControlValue ControlValuePtr M_FONT_LABEL_VALUE Modifies the label value of the font. Set the FontLabelOrIndex parameter to a specific font. Specifying all fonts causes an error. ControlValue Specifies the following. 0 &lt; Value &lt; 2097152 Specifies the font's new label value, as an integer. The label must be unique among all font labels in the context. ControlValuePtr Data type info: Data type: Set this parameter to M_NULL Data type: Set this parameter to M_NULL M_FONT_SIZE_COLUMNS Sets the number of columns in the font's dot-matrix template. Only specify this value for an empty font (no characters). The dot-matrix template defines the grid within which to represent every character in the font. Fonts are typically added with MdmrImportFont(). In this case, the dimensions of the characters' dot-matrix in the font file (MDMRF) represent the dimensions of the dot-matrix template of the font. ControlValue Specifies one of the following. M_DEFAULT Specifies the default value; the default value is 5 columns. Value &gt; 0 Specifies the number of columns, as an integer. ControlValuePtr Data type info: Data type: Set this parameter to M_NULL Data type: Set this parameter to M_NULL M_FONT_SIZE_ROWS Sets the number of rows in the font's dot-matrix template. Only specify this value for an empty font (no characters). The dot-matrix template defines the grid within which to represent every character in the font. Fonts are typically added with MdmrImportFont(). In this case, the dimensions of the characters' dot-matrix in the font file (MDMRF) represent the dimensions of the dot-matrix template of the font. ControlValue Specifies one of the following. M_DEFAULT Specifies the default value; the default value is 7 rows. Value &gt; 0 Specifies the number of rows, as an integer. ControlValuePtr Data type info: Data type: Set this parameter to M_NULL Data type: Set this parameter to M_NULL The following ControlType and corresponding ControlValue and ControlValuePtr parameter settings are used to control a font's characters. Unless otherwise specified, set the FontLabelOrIndex parameter to the label or index of a font (one or all), and set either the CharIndex parameter to a character index or the CharNamePtr parameter to the name of a character. For controlling a font's characters ControlType Description ControlValue ControlValuePtr M_CHAR_ADD Adds a character to the font. To add multiple characters, call this function multiple times. SureDotOCR assigns an index to each character, starting with 0. Use the CharNamePtr parameter to specify the name of the character and set the CharIndex parameter to M_DEFAULT. Fonts should only contain characters you want to read. ControlValue Specifies the following. M_DEFAULT Implements the default behavior. ControlValuePtr Data type info: Data type: array of type MIL_UINT8 [optionally, in C++: a reference to a constant std::vector&lt;MIL_UINT8&gt; ] MORE Data type: array of type MIL_UINT8 [optionally, in C++: a reference to a constant std::vector&lt;MIL_UINT8&gt; ] Required array size: MdmrInquireFont ( M_FONT_SIZE_COLUMNS ) * MdmrInquireFont ( M_FONT_SIZE_ROWS ) Specifies the address of an array containing the dot-matrix of the character to add to the font. You must define the dot-matrix in the array, one row contiguously after the other; use \"FF\" for dots that represent the character; otherwise use \"00\". The dot-matrix of the font's characters should be identical to the dot-matrix of the characters in the strings to read. You must organize the character data in the specified array according to the dimensions of the font's dot-matrix template. To inquire the dimensions, call MdmrInquireFont() with M_FONT_SIZE_COLUMNS and M_FONT_SIZE_ROWS. The dot-matrix of all characters in a font must have these dimensions. The dots that make up the dot-matrix are specific to each character. M_CHAR_DELETE Deletes characters in a font. To delete a specific character in a font, set the CharIndex parameter to the index of the character to delete, or set the CharNamePtr parameter to the name of the character to delete. To delete all characters in a font, set the CharIndex parameter to M_ALL and the CharNamePtr parameter to M_NULL. ControlValue Specifies the following. M_DEFAULT Implements the default behavior. ControlValuePtr Data type info: Data type: Set this parameter to M_NULL Data type: Set this parameter to M_NULL M_CHAR_NAME Renames a character in a font. ControlValue Specifies the following. M_DEFAULT Implements the default behavior. ControlValuePtr Data type info: Data type: address of a MIL_CONST_TEXT_PTR [optionally, in C++: MIL_STRING ] Data type: address of a MIL_CONST_TEXT_PTR [optionally, in C++: MIL_STRING ] Note: When using C++, you can pass a reference to a MIL_STRING instead. Specifies the following. MIL_TEXT(\"CharName\") 1 Specifies the character's new name. To indicate the character to rename, use either the CharIndex parameter or the CharNamePtr parameter. Character names must be unique among all character names in the font. To avoid unpredictable results, character names should match the dot-matrix that represents them. M_CHAR_TEMPLATE Redefines the dot-matrix of a character in a font. ControlValue Specifies the following. M_DEFAULT Implements the default behavior. ControlValuePtr Data type info: Data type: array of type MIL_UINT8 [optionally, in C++: a reference to a constant std::vector&lt;MIL_UINT8&gt; ] MORE Data type: array of type MIL_UINT8 [optionally, in C++: a reference to a constant std::vector&lt;MIL_UINT8&gt; ] Required array size: MdmrInquireFont ( M_FONT_SIZE_COLUMNS ) * MdmrInquireFont ( M_FONT_SIZE_ROWS ) Specifies the address of an array containing the character's new dot matrix. This character data must adhere to the same specifications as M_CHAR_ADD. To indicate the character to redefine, use either the CharIndex parameter or the CharNamePtr parameter. 1 If you are passing the value in a variable, don't enclose it in MIL_TEXT(). Type-specific versions of the function when using a C compiler under 64-bit void MdmrControlFontInt64 (MIL_ID ContextDmrId, MIL_INT64 FontLabelOrIndex, MIL_INT64 CharIndex, MIL_CONST_TEXT_PTR CharNamePtr, MIL_INT64 ControlType, MIL_INT64 ControlValue, const void *ControlValuePtr) Details Parameters ContextDmrId See ContextDmrId of the main function for a description. FontLabelOrIndex See FontLabelOrIndex of the main function for a description. CharIndex See CharIndex of the main function for a description. CharNamePtr See CharNamePtr of the main function for a description. ControlType See ControlType of the main function for a description. ControlValue See ControlValue of the main function for a description. ControlValuePtr See ControlValuePtr of the main function for a description. void MdmrControlFontDouble (MIL_ID ContextDmrId, MIL_INT64 FontLabelOrIndex, MIL_INT64 CharIndex, MIL_CONST_TEXT_PTR CharNamePtr, MIL_INT64 ControlType, MIL_DOUBLE ControlValue, const void *ControlValuePtr) Details Parameters ContextDmrId See ContextDmrId of the main function for a description. FontLabelOrIndex See FontLabelOrIndex of the main function for a description. CharIndex See CharIndex of the main function for a description. CharNamePtr See CharNamePtr of the main function for a description. ControlType See ControlType of the main function for a description. ControlValue See ControlValue of the main function for a description. ControlValuePtr See ControlValuePtr of the main function for a description. Compilation information Header Include mil.h. Library Use mil.lib; mildmr.lib. DLL Requires mil.dll; mildmr.dll. Syntax Description Parameters - ContextDmrId - FontLabelOrIndex For specifying the font - CharIndex For specifying the index of a character - CharNamePtr For specifying the name of the character - ControlType - ControlValue - ControlValuePtr Parameter Associations For controlling a global setting of a font For controlling a font's characters Type-specific versions of the function when using a C compiler under 64-bit Compilation information ",
      "wordCount": 2029,
      "subEntries": []
    },
    {
      "id": "Reference_dmr_MdmrControlStringModel",
      "version": null,
      "title": "MdmrControlStringModel",
      "subTitles": null,
      "location": "MIL Reference",
      "pageURL": "content\\Reference\\dmr\\MdmrControlStringModel.htm",
      "text": " MdmrControlStringModel Synopsis Control a global setting of a SureDotOCR string model, or control a position (constraint) in a string model. Syntax void MdmrControlStringModel( MIL_ID&nbsp;ContextDmrId, //in MIL_INT64&nbsp;StringModelLabelOrIndex, //in MIL_INT64&nbsp;Position, //in MIL_INT64&nbsp;ControlType, //in MIL_DOUBLE&nbsp;ControlValue1, //in MIL_DOUBLE&nbsp;ControlValue2, //in const void&nbsp;*ControlValuePtr //in ) Description This function allows you to control a global setting of a SureDotOCR string model, or to control a position in a string model. This includes setting constraints for the different positions. Constraints restrict the characters permitted to be read, according to a character type and font. String models, along with their constraints, represent the dot-matrix strings to read from a target image. Initially, any character from any font can be read at every string model position. String models are held in a SureDotOCR context. To add string models to a context, use MdmrControl(). To inquire about string models, use MdmrInquireStringModel(). You can set default constraints for all the positions in the string model, and override the constraints for specific positions. If you override the constraints for a specific position, the position is said to be explicitly constrained; otherwise, it is said to be implicitly constrained. To set the default constraints for the positions in the string model, call this function and pass M_DEFAULT to the Position parameter; to set explicit constraints for a position, pass M_POSITION_IN_STRING(n) instead, where n is the position to constrain. If you previously constrained a position, you can further constrain it by specifying its exact position in the string model, or by indicating the order in which it was originally constrained. For example, if you explicitly constrained positions 14 and 22, you can further constrain position 22 using either M_POSITION_IN_STRING(n), where n is 22, or M_POSITION_CONSTRAINED_ORDER(n), where n is 1. Once you have explicitly constrained a position, it is considered to be explicitly constrained until you call this function with M_RESET_POSITION_TO_IMPLICIT_CONSTRAINTS for that position, even if you have manually set the position's constraints back to the defaults of the string model. Note that the constrained order of a position changes if you reset previously constrained positions to be implicitly constrained (M_RESET_POSITION_TO_IMPLICIT_CONSTRAINTS). For a successful read operation, you must specify an explicit value for the global string model controls that set the maximum and minimum number of characters in the string (M_STRING_SIZE_MIN and M_STRING_SIZE_MAX, or M_STRING_SIZE_MIN_MAX). You must preprocess the SureDotOCR context after you have finished modifying its string models and before calling MdmrRead(). To know if a context needs to be preprocessed, call MdmrInquire() with M_PREPROCESSED. Note that when using a C compiler (not a C++ or other compiler) in 64-bit mode, MdmrControlStringModel() internally calls the MIL_DOUBLE version of this function (MdmrControlStringModelDouble()). If you need to pass large integer values (including pointers), call the MIL_INT64 version of this function (MdmrControlStringModelInt64()). Parameters Parameters ContextDmrId Specifies the identifier of the SureDotOCR context that contains the string model to control. The context must have been previously allocated on the system using MdmrAlloc(). StringModelLabelOrIndex Specifies the string model (one or all) to control. Set this parameter to one of the values below: For specifying the string model Value Description M_STRING_INDEX( MIL_INT IndexValue ) Specifies to control the string model by indicating its index. Parameters IndexValue Specifies the index of the string model. 0 &lt;= Value &lt; M_NUMBER_OF_STRING_MODELS Specifies the index of the string model to control. M_STRING_LABEL( MIL_INT LabelValue ) Specifies to control the string model by indicating its label. Parameters LabelValue Specifies the label of the string model. 0 &lt; Value &lt; 2097152 Specifies the label of the string model to control. M_ALL Specifies to control all string models. Position Specifies how to control the string model. Set this parameter to one of the values below: For specifying how to control to the string model Value Description M_DEFAULT Specifies to control a global setting of a string model. M_POSITION_CONSTRAINED_ORDER( MIL_INT OrderValue ) Specifies to control an explicitly constrained position in the string model by indicating the order in which the position was explicitly constrained. Parameters OrderValue Specifies the order in which the position was explicitly constrained. 0 &lt;= Value &lt;= 255 Specifies the order in which the position was explicitly constrained. For example, if you explicitly constrained positions 19, 5, and 24, their respective constrained order values are 0, 1, and 2. M_POSITION_IN_STRING( MIL_INT PositionValue ) Specifies to control a position in the string model. Parameters PositionValue Specifies the position in the string model. 0 &lt;= Value &lt;= 255 Specifies the position in the string model to control. M_ALL_CONSTRAINED_POSITIONS Specifies to control all explicitly constrained positions in the string model. ControlType Specifies the type of control to set. See the Parameter associations section for possible values that can be specified. ControlValue1 Specifies the required value for the control. Set this parameter to M_DEFAULT if not used. See the Parameter associations section for possible values that can be specified. ControlValue2 Specifies the second required value for the control. Set this parameter to M_DEFAULT if not used. See the Parameter associations section for possible values that can be specified. ControlValuePtr Accepts the address of one of the following (see the Parameter associations section for specifics on which is expected): M_NULL MIL_CONST_TEXT_PTR [optionally, in C++: a reference to a MIL_STRING] Specifies the address which contains more information about the setting's new value. Set this parameter to M_NULL if not used. See the Parameter associations section for possible values that can be specified. Parameter associations The tables below list possible values for the ControlType, ControlValue1, ControlValue2, and ControlValuePtr parameters. For controlling a global setting of a string model For setting constraints to the different positions in the string model For generally controlling the different positions in the string model The following ControlType and corresponding ControlValue1, ControlValue2, and ControlValuePtr parameter settings are used to control a global setting of a string model. In this case, set the StringModelLabelOrIndex parameter to the label or index of a string model (one or all, unless otherwise specified), and set the Position parameter to M_DEFAULT. For controlling a global setting of a string model ControlType Description ControlValue1 ControlValue2 ControlValuePtr M_CHAR_ACCEPTANCE Sets the acceptance level for the score of the string's characters. This score quantifies the similarity between the characters in the target string and the corresponding characters in the font that the string model uses. For the string to be read, the score of every character must be greater than or equal to the specified character acceptance. To retrieve character scores, call MdmrGetResult() with M_CHAR_SCORE. ControlValue1 Specifies one of the following. M_DEFAULT Specifies the default value; the default value is 50.0%. 0.0 &lt;= Value &lt;= 100.0 Specifies the acceptance level for the character score, as a percentage. 100.0% indicates that the character in the target string perfectly resembles the corresponding character in the font (perfection is generally hard to obtain). ControlValue2 Set this parameter to M_DEFAULT. ControlValuePtr Data type info: Data type: Set this parameter to M_NULL Data type: Set this parameter to M_NULL M_STRING_ACCEPTANCE Sets the acceptance level for the string's score. This score quantifies the similarity between the target string and the string model. For the string to be read, its score must be greater than or equal to the specified acceptance. The string's score is the average score of all its characters. Even if the string's score is above the string's acceptance, the string might not be read if one or more if its characters is below the character's acceptance (M_CHAR_ACCEPTANCE). In this case, consider lowering the character's acceptance. To retrieve the score of the string or its characters, call MdmrGetResult() with M_STRING_SCORE or M_CHAR_SCORE. ControlValue1 Specifies one of the following. M_DEFAULT Specifies the default value; the default value is 50.0%. 0.0 &lt;= Value &lt;= 100.0 Specifies the acceptance level for the string's score, as a percentage. 100.0% indicates that the string in the target image perfectly resembles the string model (perfection is generally hard to obtain). ControlValue2 Set this parameter to M_DEFAULT. ControlValuePtr Data type info: Data type: Set this parameter to M_NULL Data type: Set this parameter to M_NULL M_STRING_CERTAINTY Sets the certainty level for the string's score. This score quantifies the similarity between the target string and the string model. If the string's score is equal to or above the certainty, the string is immediately read as a valid string result, without processing the rest of the target image for strings with higher scores (provided the specified number of strings to read has been read). The string's score is the average score of all its characters. To retrieve the score of the string or its characters, call MdmrGetResult() with M_STRING_SCORE or M_CHAR_SCORE. ControlValue1 Specifies one of the following. M_DEFAULT Specifies the default value; the default value is 70.0%. 0.0 &lt;= Value &lt;= 100.0 Specifies the certainty level for the string score, as a percentage. 100.0% indicates that the string in the target image perfectly resembles the string model (perfection is generally hard to obtain). ControlValue2 Set this parameter to M_DEFAULT. ControlValuePtr Data type info: Data type: Set this parameter to M_NULL Data type: Set this parameter to M_NULL M_STRING_LABEL_VALUE Modifies the label value of the string model. The StringModelLabelOrIndex parameter must specify a specific string model (not all). ControlValue1 Specifies the string model's new label value. The label value must be greater than 0 and it must be unique among all string models in the context. ControlValue2 Set this parameter to M_DEFAULT. ControlValuePtr Data type info: Data type: Set this parameter to M_NULL Data type: Set this parameter to M_NULL M_STRING_RANK Sets the order in which to read a string, relative to the other strings to read. Strings with lower ranks are read before those with higher ones. Do not modify rank unless your context has multiple string models. SureDotOCR reads strings from left to right and from top to bottom, relative to the angle of the string's location. If a string model's rank is 0 (M_DEFAULT), SureDotOCR tries to read that string first; accounting for angle, it will be the top left-most string. If multiple string models have identical ranks, SureDotOCR reads just one string, depending on which is more similar to its string model. When specifying ranks, you must include rank 0, and you must not skip successive values. For example, you will get an error if a context has four string models with their ranks set to [1, 2, 3, 4] or [0, 1, 2, 4]. Strings with different ranks must be on separate lines. SureDotOCR uses the rank of the string models in a context to establish the required number of strings to read for that context: TotalNumberOfStringsToRead = HighestRankValue + 1. For example, if you have four string models with ranks set to [0, 0, 1, 2], SureDotOCR must read three strings. If 3 strings cannot be read, no results are returned. Since the default rank for every string model is 0, SureDotOCR will try to read 1 string, regardless of how many string models are in your context, unless you modify rank. ControlValue1 Specifies one of the following. M_DEFAULT Specifies the default value; the default value is 0. Value &gt;= 0 Specifies the order in which to read a string. Explicitly indicating rank can make the read operation faster and more accurate. ControlValue2 Set this parameter to M_DEFAULT. ControlValuePtr Data type info: Data type: Set this parameter to M_NULL Data type: Set this parameter to M_NULL M_STRING_SIZE_MAX Sets the maximum number of characters in the string. This number includes spaces, if they correspond to a space permitted character constraint (M_SPACE). If this number is not equal to M_STRING_SIZE_MIN, use MdmrGetResult() with M_SKIPPED_POSITIONS to see which characters in the model were skipped. ControlValue1 Specifies the maximum number of characters. This value must be equal to or greater than the minimum number of characters (M_STRING_SIZE_MIN). 1 &lt;= Value &lt;= 256 Specifies the maximum number of characters. ControlValue2 Set this parameter to M_DEFAULT. ControlValuePtr Data type info: Data type: Set this parameter to M_NULL Data type: Set this parameter to M_NULL M_STRING_SIZE_MIN Sets the minimum number of characters in the string. This number includes spaces, if they correspond to a space permitted character constraint (M_SPACE). If this number is not equal to M_STRING_SIZE_MAX, use MdmrGetResult() with M_SKIPPED_POSITIONS to see which characters in the model were skipped. ControlValue1 Specifies the minimum number of characters. This value must be equal to or less than the maximum number of characters (M_STRING_SIZE_MAX). M_DEFAULT Specifies the default value; the default value is 1. 1 &lt;= Value &lt;= 256 Specifies the minimum number of characters. ControlValue2 Set this parameter to M_DEFAULT. ControlValuePtr Data type info: Data type: Set this parameter to M_NULL Data type: Set this parameter to M_NULL M_STRING_SIZE_MIN_MAX Sets the minimum and maximum number of characters in the string. These numbers include spaces, if they correspond to a space permitted character constraint (M_SPACE). If min and max are not equal, use MdmrGetResult() with M_SKIPPED_POSITIONS to see which characters in the model were skipped. M_STRING_SIZE_MIN_MAX is the same as calling this function twice, the first with M_STRING_SIZE_MIN and the second with M_STRING_SIZE_MAX. ControlValue1 Specifies the minimum number of characters. This value must be equal to or less than the maximum number of characters. M_DEFAULT Specifies the default value; the default value is 1. 1 &lt;= Value &lt;= 256 Specifies the minimum number of characters. ControlValue2 Specifies the maximum number of characters. This value must be equal to or greater than the minimum number of characters. 1 &lt;= Value &lt;= 256 Specifies the maximum number of characters. ControlValuePtr Data type info: Data type: Set this parameter to M_NULL Data type: Set this parameter to M_NULL The following ControlType and corresponding ControlValue1, ControlValue2, and ControlValuePtr parameter settings are used to set constraints for the different positions in the string model. In this case, set the StringModelLabelOrIndex parameter to the label or index of a string model (one or all). To set the default constraints for the positions in the string model, set the Position parameter to M_DEFAULT, unless otherwise specified. To set explicit constraints for a position, set the Position parameter to the required position (one or all). Note that positions have zero-based indexing. For setting constraints to the different positions in the string model ControlType Description ControlValue1 ControlValue2 ControlValuePtr M_ADD_PERMITTED_CHARS_ENTRY Sets a constraint based on permitted characters. This restricts the characters that can be read, according to a font (ControlValue1) and character type (ControlValue2). For example, you can specify that at position 0, in string model 0, you will only permit the letter 'O', as represented in font OhZero, to be read. Every position in every string model can initially read any character from any font in the context, unless you specify otherwise. Spaces can also be read, depending on the space controls, which you can specify by calling MdmrControl() with M_SPACE_SIZE_MAX and M_SPACE_SIZE_MIN. Unless otherwise specified, permitted character constraints are cumulative. Each time you specify permitted characters, they are added to the previously specified permitted characters, if they exist. ControlValue1 Specifies the font that contains the representation of the character to read. The font must be in the specified context. M_FONT_INDEX( MIL_INT IndexValue ) Specifies the font by indicating its index, or specifies any font. When you specify a font's index, SureDotOCR internally refers to the font by its corresponding label. If the font's index subsequently changes, which can happen when other fonts are added or deleted, the font you referred to remains the same. Parameters IndexValue Specifies the index of the font. M_ANY Specifies that the character can come from any font in the context. 0 &lt;= Value &lt; M_NUMBER_OF_FONTS Specifies the index of the font from which the character must come. M_FONT_LABEL( MIL_INT LabelValue ) Specifies the font by indicating its label, or specifies any font. Parameters LabelValue Specifies the label of the font. M_ANY Specifies that the character can come from any font in the context. 0 &lt; Value &lt; 2097151 Specifies the label of the font from which the character must come. ControlValue2 Specifies the type of character to read, relative to the specified font, unless otherwise specified. For example, to read digit type characters from MySuperExcellentFont, set this parameter to M_DIGITS, and set the ControlValue1 parameter to the index or label of MySuperExcellentFont. M_ANY Specifies to read all characters present in the font. M_CHAR_LIST Specifies to read an explicit list of characters. To specify them, use the ControlValuePtr parameter. M_DIGITS Specifies to read characters '0' to '9'. M_LETTERS Specifies to read characters 'A' to 'Z' and 'a' to 'z'. M_LETTERS_LOWERCASE Specifies to read characters 'a' to 'z'. M_LETTERS_UPPERCASE Specifies to read characters 'A' to 'Z'. M_SPACE Specifies to read a space. Unlike other permitted characters, fonts cannot represent a space. To establish it, call MdmrControl() with M_SPACE_SIZE_MAX and M_SPACE_SIZE_MIN. When specifying M_SPACE, set the ControlValue1 parameter to the index or label of any font (M_ANY). To use M_SPACE, the Position parameter must be set to a specific position that is not the first or last position in a string model. That position cannot have another character constraint nor can you have consecutive positions with a space constraint. If these conditions are not followed, you will get an error. Reading an M_SPACE character does not necessarily mean that the corresponding space position in the target string is blank. SureDotOCR attempts to read the best string possible, and can use the space constraint as an area to ignore, even if that area is not empty. For example, if you have an icon at a specific position within a target string, you can specify a space at that position. ControlValuePtr Data type info: Data type: Set this parameter to M_NULL &nbsp;|&nbsp; address of a MIL_CONST_TEXT_PTR [optionally, in C++: MIL_STRING ] MORE Data type: Set this parameter to M_NULL Note: Required for all ControlValue2 settings except M_CHAR_LIST. Data type: address of a MIL_CONST_TEXT_PTR [optionally, in C++: MIL_STRING ] Note: Required when ControlValue2 is set to M_CHAR_LIST Note: When using C++, you can pass a reference to a MIL_STRING instead. Specifies a null-terminated string indicating the names of the characters supported at a specified position, when ControlValue2 is set to M_CHAR_LIST. Character names must refer to specific letters (such as 'o'), digits (such as '0'), and punctuation marks (such as '%') in the font. You cannot indicate a space when listing characters for M_CHAR_LIST. The specified string can contain one or more character names. List them all without separators. For example, to read the twenty-second, the ninth, and the third uppercase letters of the alphabet, use the string \"VIC\". Specifying multiple characters is equivalent to calling this function multiple times, and listing one character each time. You can list character names in hexadecimal format beginning with \"\\\\x\". This is necessary if you are in an ASCII environment and you want Unicode characters beyond the Basic Latin range. For example, Basic Latin does not include the smiley face character; to specify it, use \"\\\\x263A\". You can also list a string of character names with mixed notation; in this case, you should also use \"\\\\x\" (for example, \"VIC\\\\x263A\"). The following ControlType and corresponding ControlValue1, ControlValue2, and ControlValuePtr parameter settings are used to generally control the different positions in the string model(s). In this case, set the StringModelLabelOrIndex parameter to the label or index of a string model (one or all). Depending on the control type selected, you can control the default constraints for the positions in the string model (set the Position parameter to M_DEFAULT), or you can control the explicit constraints for a position (set the Position parameter to one or all positions). Note that positions have zero-based indexing. For generally controlling the different positions in the string model ControlType Description ControlValue1 ControlValue2 ControlValuePtr M_CLONE_CONSTRAINTS_FROM Clones the explicit constraints from the source to the destination. The string model position specified with the ControlValue1 and ControlValue2 parameters represents the source. The string model position specified with the StringModelLabelOrIndex and Position parameters represents the destination. If the destination is a specific position (one or all), it will be explicitly constrained according to the explicit constraints of the source. Explicit constraints already specified for the destination will be overwritten. Only the cloned ones will remain. If the destination refers to the default constraints for the positions in the string model, all its implicitly constrained positions will be identical to the explicitly constrained position identified by the source. The clone operation does not override the state of the positions in the source; they remain implicitly constrained. ControlValue1 Specifies the string model that has the explicit constraints to clone. M_STRING_INDEX( MIL_INT IndexValue ) Specifies the string model by indicating its index. Parameters IndexValue Specifies the index of the string model. 0 &lt;= Value &lt; M_NUMBER_OF_STRING_MODELS Specifies the index of the string model. M_STRING_LABEL( MIL_INT LabelValue ) Specifies the string model by indicating its label. Parameters LabelValue Specifies the label of the string model. 0 &lt; Value &lt; 2097152 Specifies the label of the string model. ControlValue2 Specifies the position that has the explicit constraints to clone. M_POSITION_CONSTRAINED_ORDER( MIL_INT OrderValue ) Specifies an explicitly constrained position in the string model by indicating the order in which the position was explicitly constrained. Parameters OrderValue Set this parameter to the following: 0 &lt;= Value &lt;= 255 Specifies the order in which the position was explicitly constrained. For example, if you explicitly constrained positions 19, 5, and 24, their respective constrained order values are 0, 1, and 2. M_POSITION_IN_STRING( MIL_INT PositionValue ) Specifies a position in the string model. Parameters PositionValue Specifies the position in the string model. 0 &lt;= Value &lt;= 255 Specifies the position in the string model. ControlValuePtr Data type info: Data type: Set this parameter to M_NULL Data type: Set this parameter to M_NULL M_DELETE_PERMITTED_CHARS_ENTRY Deletes a character constraint at a specific index. ControlValue1 Specifies which character constraint to delete. M_DEFAULT Same as M_ALL. M_ALL Specifies to delete all character constraints. The permitted character constraints revert to those of the default constraint. 0&lt;=Value&lt;M_NUMBER_OF_PERMITTED_CHARS_ENTRIES Specifies to delete the character constraint at the specified index. ControlValue2 Set this parameter to M_DEFAULT. ControlValuePtr Data type info: Data type: Set this parameter to M_NULL Data type: Set this parameter to M_NULL M_IS_OPTIONAL Sets whether a position in a string model is optional. You should mark a model position as optional if you do not require a character to be returned for that position in the model. If the string model has a minimum string size (M_STRING_SIZE_MIN) less than its maximum size (M_STRING_SIZE_MAX), optional positions can be skipped if their constraints cannot be met (up to a maximum of M_STRING_SIZE_MAX- M_STRING_SIZE_MIN skips). For example, if you want to read 10-digit telephone numbers in the formats '###-###-####' and '##########', you can set the minimum string size to 10, set the maximum string size to 12, and mark positions 3 and 7 as optional. Then, set the permitted character constraints to M_DIGITS for positions 0-2, 4-6, and 8-11 and to hyphens for positions 3 and 7. If the target string is \"123-456-7890\", all the constraints are met, and SureDotOCR will return \"123-456-7890\". If the target string is \"1234567890\", positions 3 and 7 are skipped because they are optional and their constraints cannot be met, and SureDotOCR will return \"1234567890\". Note that unless you set a model position as optional, its character constraints must be met to return the string, whereas if a character in the target image does not meet the constraints, SureDotOCR will ignore the character and check if the constraints are met by the next character if M_SPACE_SIZE_MIN is set wide enough; if the distance between the previous character and the next character is less than the minimum space width, the current character is ignored and the next character can be used to meet the constraints. In the example above, if you had set the model to '##########', the target string \"123-456-7890\" might still have been read (as \"1234567890\") if the minimum space width was wide enough. It is always safer to include optional characters in the model and mark their positions as optional. You can use MdmrGetResult() with M_SKIPPED_POSITIONS to see which positions in the model were skipped. Note that a string read with a lower number of skips will be returned as a higher priority result than a string read with a higher number of skips. Note that MdmrPreprocess() will not accept optional constraints if M_STRING_PARTIAL_MODE is enabled. ControlValue1 Specifies whether the model position is optional. M_DEFAULT Same as M_FALSE. M_FALSE Specifies that the model position is not optional. M_TRUE Specifies that the model position is optional. ControlValue2 Set this parameter to M_DEFAULT. ControlValuePtr Data type info: Data type: Set this parameter to M_NULL Data type: Set this parameter to M_NULL M_RESET_IMPLICIT_CONSTRAINTS Resets the implicit (default) constraints for the positions in the string model back to their initial value. You can only use M_RESET_IMPLICIT_CONSTRAINTS if the Position parameter is set to M_DEFAULT. Initially, any character from any font can be read at every string model position. ControlValue1 Set this parameter to M_DEFAULT. ControlValue2 Set this parameter to M_DEFAULT. ControlValuePtr Data type info: Data type: Set this parameter to M_NULL Data type: Set this parameter to M_NULL M_RESET_POSITION_TO_IMPLICIT_CONSTRAINTS Resets the explicitly constrained position(s) to the implicit (default) constraints for the string model. These positions are then considered implicitly constrained. You can only use M_RESET_POSITION_TO_IMPLICIT_CONSTRAINTS if the Position parameter is not set to M_DEFAULT. The constrained order (M_POSITION_CONSTRAINED_ORDER()) of a position changes when you use M_RESET_POSITION_TO_IMPLICIT_CONSTRAINTS. ControlValue1 Set this parameter to M_DEFAULT. ControlValue2 Set this parameter to M_DEFAULT. ControlValuePtr Data type info: Data type: Set this parameter to M_NULL Data type: Set this parameter to M_NULL Type-specific versions of the function when using a C compiler under 64-bit void MdmrControlStringModelInt64 (MIL_ID ContextDmrId, MIL_INT64 StringModelLabelOrIndex, MIL_INT64 Position, MIL_INT64 ControlType, MIL_INT64 ControlValue1, MIL_INT64 ControlValue2, const void *ControlValuePtr) Details Parameters ContextDmrId See ContextDmrId of the main function for a description. StringModelLabelOrIndex See StringModelLabelOrIndex of the main function for a description. Position See Position of the main function for a description. ControlType See ControlType of the main function for a description. ControlValue1 See ControlValue1 of the main function for a description. ControlValue2 See ControlValue2 of the main function for a description. ControlValuePtr See ControlValuePtr of the main function for a description. void MdmrControlStringModelDouble (MIL_ID ContextDmrId, MIL_INT64 StringModelLabelOrIndex, MIL_INT64 Position, MIL_INT64 ControlType, MIL_DOUBLE ControlValue1, MIL_DOUBLE ControlValue2, const void *ControlValuePtr) Details Parameters ContextDmrId See ContextDmrId of the main function for a description. StringModelLabelOrIndex See StringModelLabelOrIndex of the main function for a description. Position See Position of the main function for a description. ControlType See ControlType of the main function for a description. ControlValue1 See ControlValue1 of the main function for a description. ControlValue2 See ControlValue2 of the main function for a description. ControlValuePtr See ControlValuePtr of the main function for a description. Compilation information Header Include mil.h. Library Use mil.lib; mildmr.lib. DLL Requires mil.dll; mildmr.dll. Syntax Description Parameters - ContextDmrId - StringModelLabelOrIndex For specifying the string model - Position For specifying how to control to the string model - ControlType - ControlValue1 - ControlValue2 - ControlValuePtr Parameter Associations For controlling a global setting of a string model For setting constraints to the different positions in the string model For generally controlling the different positions in the string model Type-specific versions of the function when using a C compiler under 64-bit Compilation information ",
      "wordCount": 4523,
      "subEntries": []
    },
    {
      "id": "Reference_dmr_MdmrDraw",
      "version": null,
      "title": "MdmrDraw",
      "subTitles": null,
      "location": "MIL Reference",
      "pageURL": "content\\Reference\\dmr\\MdmrDraw.htm",
      "text": " MdmrDraw Synopsis Draw specific features of a SureDotOCR result buffer. Syntax void MdmrDraw( MIL_ID&nbsp;ContextGraId, //in MIL_ID&nbsp;ResultDmrId, //in MIL_ID&nbsp;DstImageBufOrListGraId, //in MIL_INT64&nbsp;Operation, //in MIL_INT64&nbsp;Index, //in MIL_INT64&nbsp;CharIndex, //in MIL_INT64&nbsp;ControlFlag //in ) Description This function draws specific features of a SureDotOCR result buffer in the destination image buffer or 2D graphics list. Parameters Parameters ContextGraId Specifies the identifier of the 2D graphics context to use when drawing. Set this parameter to one of the values below. For specifying the 2D graphics context Value Description M_DEFAULT Specifies that the default 2D graphics context of the current MIL application is used. Note that there is a different default 2D graphics context for each thread. MIL 2D graphics context identifier Specifies a valid 2D graphics context identifier, which you have allocated using MgraAlloc(). ResultDmrId Specifies the identifier of the SureDotOCR result buffer from which to extract the features to draw. The result buffer must have been previously allocated on the system using MdmrAllocResult(). DstImageBufOrListGraId Specifies the identifier of the destination image buffer or 2D graphics list in which to draw. The buffer can be any valid MIL image buffer allocated using MbufAlloc...(). The 2D graphics list must be previously allocated using MgraAllocList(). By drawing into a display's overlay buffer or associating the 2D graphics list with the display, you can also annotate an image non-destructively. If specifying an image buffer, it must not have a region of interest (ROI) associated with it. Using an image buffer with an ROI will cause an error. Operation Specifies the drawing operation to perform. When applicable, MdmrDraw() draws the required information at the location that the string was read in the target, at the correct angle, scale, and aspect ratio. For a drawing operation related to strings, you can set the Operation parameter to one of the following. The CharIndex parameter must be set to M_DEFAULT. For a drawing operation related to strings Value Description M_DRAW_MIL_FONT_FORMATTED_STRING Draws the names of the characters that were read, and they appear according to how the target string is formatted in the image (including non-constrained spaces). Character names are drawn under the bottom-left corner of the bounding box of the string (M_DRAW_STRING_BOX). Character names come from the SureDotOCR font that defines them. To draw the names, SureDotOCR uses the font associated with the 2D graphics context. M_DRAW_MIL_FONT_STRING Draws the names of the characters that were read, and they appear according to the string model definition. Character names are drawn under the bottom-left corner of the bounding box of the string (M_DRAW_STRING_BOX). Character names come from the SureDotOCR font that defines them. To draw the names, SureDotOCR uses the font associated with the 2D graphics context. M_DRAW_STRING_BOX Draws a bounding box around the string that was read. This bounding box encloses all of the string's characters. For a drawing operation related to strings, you can set the Operation parameter to one of the following. The CharIndex parameter must be set to one or all characters. For a drawing operation related to characters Value Description M_DRAW_STRING_CHAR_BOX Draws the character's bounding box at the location at which the character was read. M_DRAW_STRING_CHAR_POSITION Draws a circled dot at the center of each bounding box that surrounds the individual characters of a string. Index Specifies the string result (one or all) for which to perform the drawing operation. Set this parameter to one of the values below. For specifying the string index Value Description M_DEFAULT Same as M_ALL. M_ALL Specifies to perform the drawing operation for all string results. M_GENERAL Specifies to perform a global drawing operation for a single bounding box that encompasses all strings. This parameter must be used with M_DRAW_STRING_BOX or it will generate an error. Value &gt;= 0 Specifies the index of the string result for which to perform the drawing operation. CharIndex Specifies the character (one or all) in the string result for which to perform the drawing operation. Set this parameter to one of the values below. For specifying the character index Value Description M_DEFAULT Implements the default behavior. For drawing operations related to strings, the default indicates that this parameter is not required. For drawing operations related to characters, the default is the same as setting the M_INDEX_IN_STRING() macro to M_ALL. M_INDEX_IN_FORMATTED_STRING( MIL_INT CharIndex ) Specifies to perform the drawing operation by indicating the character's index, relative to its position in the formatted string. The formatted string includes spaces, if any were read in the target string, even if you did not add spaces to the string model as permitted character constraints (MdmrControlStringModel() with M_SPACE). Parameters CharIndex Set this parameter to one of the following: M_ALL Specifies to perform the drawing operation for all characters in the formatted string. To retrieve the number of characters in the formatted string, call MdmrGetResult() with M_FORMATTED_STRING_CHAR_NUMBER. 0 &lt;= Value &lt; M_FORMATTED_STRING_CHAR_NUMBER Specifies the index of the character in the formatted string for which to perform the drawing operation. The value must be less than the total number of characters in the formatted string (M_FORMATTED_STRING_CHAR_NUMBER). M_INDEX_IN_STRING( MIL_INT CharIndex ) Specifies to perform the drawing operation by indicating the character's index, relative to its position in the string. The string can include spaces, but only if they correspond to a space permitted character constraint in the string model (MdmrControlStringModel() with M_SPACE). Parameters CharIndex Set this parameter to one of the following: M_ALL Specifies to perform the drawing operation for all characters in the string. To retrieve the number of characters in the string, call MdmrGetResult() with M_STRING_CHAR_NUMBER. 0 &lt;= Value &lt; M_STRING_CHAR_NUMBER Specifies the index of the character in the string for which to perform the drawing operation. The value must be less than the total number of characters in the string (M_STRING_CHAR_NUMBER). ControlFlag Reserved for future expansion and must be set to M_DEFAULT. Compilation information Header Include mil.h. Library Use mil.lib; mildmr.lib. DLL Requires mil.dll; mildmr.dll. Syntax Description Parameters - ContextGraId For specifying the 2D graphics context - ResultDmrId - DstImageBufOrListGraId - Operation For a drawing operation related to strings For a drawing operation related to characters - Index For specifying the string index - CharIndex For specifying the character index - ControlFlag Compilation information ",
      "wordCount": 1020,
      "subEntries": []
    },
    {
      "id": "Reference_dmr_MdmrExportFont",
      "version": null,
      "title": "MdmrExportFont",
      "subTitles": null,
      "location": "MIL Reference",
      "pageURL": "content\\Reference\\dmr\\MdmrExportFont.htm",
      "text": " MdmrExportFont Synopsis Export a font from a SureDotOCR context. Syntax void MdmrExportFont( MIL_CONST_TEXT_PTR&nbsp;FileName, //in MIL_INT64&nbsp;FileFormat, //in MIL_ID&nbsp;ContextDmrId, //in MIL_INT64&nbsp;FontLabelOrIndex, //in MIL_INT64&nbsp;ControlFlag //in ) Description This function exports a font from a SureDotOCR context to a file. The exported font includes all its characters. String models use fonts to read dot-matrix text. Once you export a font, you can import it to any SureDotOCR context using MdmrImportFont(). Parameters Parameters FileName Specifies the name and path of the SureDotOCR font file in which to export the font. The function handles (internally) the opening and closing of the file. For easier use with other Matrox Imaging software products, the specified file name must use the MDMRF file extension, which refers to a SureDotOCR font file. If you specify a file that already exists, it will be overwritten. Set this parameter to one of the values below. For specifying the file name and path Value Description M_INTERACTIVE [This is only applicable to Windows] Opens a dialog box from which to interactively specify the drive, directory, and name of a SureDotOCR font file. MIL_TEXT(\"FileName\") 1 Specifies the drive, directory, and name of a SureDotOCR font file (for example, \"C:\\mydirectory\\MySweetSweetFont.mdmrf\"). To specify a SureDotOCR font file on a remote computer (under Distributed MIL), prefix the file name string with \"remote:///\" (for example, \"remote:///C:\\mydirectory\\MySweetSweetFont.mdmrf\"). 1 If you are passing the value in a variable, don't enclose it in MIL_TEXT(). FileFormat Specifies the format of the file in which to export the font. Set this parameter to the value below. For specifying the file format Value Description M_DMR_FONT_FILE Specifies a SureDotOCR font file format (MDMRF). See MdmrImportFont() for information on how SureDotOCR font files represent their data. ContextDmrId Specifies the identifier of the SureDotOCR context from which to export the font. The context must have been previously allocated on the system using MdmrAlloc(). FontLabelOrIndex Specifies the label or index of the font to export from the SureDotOCR context. Set this parameter to one of the values below. For identifying the font Value Description M_FONT_INDEX( MIL_INT IndexValue ) Specifies to export the font by indicating its index. Parameters IndexValue Set this parameter to the following: 0 &lt;= Value &lt; M_NUMBER_OF_FONTS Specifies the index of the font to export. M_FONT_LABEL( MIL_INT LabelValue ) Specifies to export the font by indicating its label. Parameters LabelValue Set this parameter to the following: 0 &lt; Value &lt; 2097152 Specifies the label of the font to export. ControlFlag Reserved for future expansion and must be set to M_DEFAULT. Compilation information Header Include mil.h. Library Use mil.lib; mildmr.lib. DLL Requires mil.dll; mildmr.dll. Syntax Description Parameters - FileName For specifying the file name and path - FileFormat For specifying the file format - ContextDmrId - FontLabelOrIndex For identifying the font - ControlFlag Compilation information ",
      "wordCount": 460,
      "subEntries": []
    },
    {
      "id": "Reference_dmr_MdmrFree",
      "version": null,
      "title": "MdmrFree",
      "subTitles": null,
      "location": "MIL Reference",
      "pageURL": "content\\Reference\\dmr\\MdmrFree.htm",
      "text": " MdmrFree Synopsis Free a SureDotOCR context or a SureDotOCR result buffer. Syntax void MdmrFree( MIL_ID&nbsp;ContextOrResultDmrId //in ) Description This function deletes the specified SureDotOCR context or SureDotOCR result buffer identifier, and releases any memory associated with it. All SureDotOCR contexts and all SureDotOCR result buffers allocated on a particular system must be freed before the system can be freed, unless M_UNIQUE_ID was specified during allocation. Parameters Parameter ContextOrResultDmrId Specifies the identifier of the SureDotOCR context or SureDotOCR result buffer to free. These must have been successfully allocated (with MdmrAlloc() or MdmrAllocResult()) prior to calling this function. Compilation information Header Include mil.h. Library Use mil.lib; mildmr.lib. DLL Requires mil.dll; mildmr.dll. Syntax Description Parameters - ContextOrResultDmrId Compilation information ",
      "wordCount": 118,
      "subEntries": []
    },
    {
      "id": "Reference_dmr_MdmrGetResult",
      "version": null,
      "title": "MdmrGetResult",
      "subTitles": null,
      "location": "MIL Reference",
      "pageURL": "content\\Reference\\dmr\\MdmrGetResult.htm",
      "text": " MdmrGetResult Synopsis Get results from a SureDotOCR result buffer. Syntax void MdmrGetResult( MIL_ID&nbsp;ResultDmrId, //in MIL_INT64&nbsp;StringIndex, //in MIL_INT64&nbsp;CharPositionIndex, //in MIL_INT64&nbsp;ResultType, //in void&nbsp;*ResultArrayPtr //out ) Description This function retrieves results of the specified type from a SureDotOCR result buffer. You can retrieve global results, string results, or character results. Results are available after calling MdmrRead(). If your target image (MdmrRead()) was associated with a camera calibration context, positional and dimensional results are, by default, returned with respect to the relative coordinate system of the image. Otherwise, these results are returned in pixels, relative to the center of top-left pixel in the target image. If your target image was associated with a camera calibration context but you want to retrieve positional and dimensional results in pixel units, use MdmrControl() with the M_RESULT_OUTPUT_UNITS control type set to M_PIXEL. However, if you set M_RESULT_OUTPUT_UNITS to M_WORLD without specifying a calibrated image in which to calculate the results, MdmrGetResult() generates an error. Positional and dimensional results take into account the angle at which the result was found. The following example shows how the result for the bottom-left corner of the string box (M_STRING_BOX_BL_X and M_STRING_BOX_BL_Y) depends on the location and angle at which the string was read. To remove all results from a result buffer, call MdmrControl() with M_RESET. This does not delete the buffer identifier, as is the case with MdmrFree(). Parameters Parameters ResultDmrId Specifies the identifier of the SureDotOCR result buffer from which to retrieve results. StringIndex Specifies the string (one or all) for which to get results, or specifies to get global results. Set this parameter to one of the values below. Note that you must set this parameter to a string (one or all) when getting character results. For specifying the string for which to get results, or for specifying global results Value Description M_DEFAULT Same as M_GENERAL. M_ALL Specifies to retrieve results for all strings in the result buffer. To retrieve the number of strings in the result buffer, use M_STRING_NUMBER. M_GENERAL Specifies to retrieve global results. These results are related to the result buffer itself. 0 &lt;= Value &lt; M_STRING_NUMBER Specifies the index of the string for which to retrieve results. The index must be less than the total number of strings in the result buffer (M_STRING_NUMBER). CharPositionIndex Specifies the character (one or all) for which to get results, or specifies to get global or string results. Set this parameter to one of the values below. For specifying the character for which to get results, or for specifying global or string results Value Description M_DEFAULT Same as M_GENERAL. M_INDEX_IN_FORMATTED_STRING( MIL_INT CharIndex ) Specifies to retrieve a character result by indicating the character's index, according to the target string format. The StringIndex parameter must be set to a string (one or all). If a space is read in the target string, it is indexed as a character result, even if you did not add a space to the string model as a permitted character constraint (MdmrControlStringModel() with M_SPACE). For example, if the string model definition specifies to read 4 capital letters (\"LLLL\"), and the target string read is \"AB CD\", M_INDEX_IN_FORMATTED_STRING(3) refers to 'C'. If the string model definition specifies to read 4 capital letters and 1 space (\"LLSLL\"), and the target string read is \"AB CD\", M_INDEX_IN_FORMATTED_STRING(3) also refers to 'C'. Parameters CharIndex Set this parameter to one of the following: M_ALL Specifies to retrieve results for all characters. To retrieve the number of characters, use M_FORMATTED_STRING_CHAR_NUMBER. 0 &lt;= Value &lt; M_FORMATTED_STRING_CHAR_NUMBER Specifies the index of the character for which to get results. The value must be less than the total number of characters (M_FORMATTED_STRING_CHAR_NUMBER). M_INDEX_IN_STRING( MIL_INT CharIndex ) Specifies to retrieve a character result by indicating the character's index, according to the string model definition. The StringIndex parameter must be set to a string (one or all). Spaces read in the target string can be indexed as a character result, but only if they correspond to a space permitted character constraint in the string model (MdmrControlStringModel() with M_SPACE). For example, if the string model definition specifies to read 4 capital letters (\"LLLL\"), and the target string read is \"AB CD\", M_INDEX_IN_STRING(3) refers to 'D'. If the string model definition specifies to read 4 capital letters and 1 space (\"LLSLL\"), and the target string read is \"AB CD\", M_INDEX_IN_STRING(3) refers to 'C'. Parameters CharIndex Set this parameter to one of the following: M_ALL Specifies to retrieve results for all characters. To retrieve the number of characters, use M_STRING_CHAR_NUMBER. 0 &lt;= Value &lt; M_STRING_CHAR_NUMBER Specifies the index of the character for which to get results. The value must be less than the total number of characters (M_STRING_CHAR_NUMBER). M_GENERAL Specifies to retrieve global results or string results. M_GENERAL or M_DEFAULT retrieves global results when the StringIndex parameter is set to M_GENERAL or M_DEFAULT. M_GENERAL or M_DEFAULT retrieves string results when the StringIndex parameter is set to a string (one or all). ResultType Specifies the type of result to retrieve. See the Parameter associations section for possible values that can be specified. ResultArrayPtr Accepts the address of one of the following (see the Parameter associations section for specifics on which is expected): array of type MIL_DOUBLE [optionally, in C++: a reference to a std::vector&lt;MIL_DOUBLE&gt; ] array of type MIL_FLOAT [optionally, in C++: a reference to a std::vector&lt;MIL_FLOAT&gt; ] array of type MIL_ID [optionally, in C++: a reference to a std::vector&lt;MIL_ID&gt; ] array of type MIL_INT [optionally, in C++: a reference to a std::vector&lt;MIL_INT&gt; ] array of type MIL_INT16 [optionally, in C++: a reference to a std::vector&lt;MIL_INT16&gt; ] array of type MIL_INT32 [optionally, in C++: a reference to a std::vector&lt;MIL_INT32&gt; ] array of type MIL_INT64 [optionally, in C++: a reference to a std::vector&lt;MIL_INT64&gt; ] array of type MIL_TEXT_CHAR [optionally, in C++: a reference to a MIL_STRING] MIL_DOUBLE MIL_FLOAT MIL_ID MIL_INT MIL_INT16 MIL_INT32 MIL_INT64 Specifies the address in which to write results. See the Parameter associations section for possible values that can be returned. Parameter associations The tables below list possible values for the ResultType parameter and possible values returned to the ResultArrayPtr parameter. For retrieving global results For retrieving string results For retrieving global or string results For retrieving character results When retrieving global results, set the ResultType parameter to the value below. In this case, set both the StringIndex and CharPositionIndex parameters to either M_GENERAL or M_DEFAULT. For retrieving global results ResultType Description ResultArrayPtr - Possible values returned M_STATUS Retrieves information regarding the state of the read operation. ResultArrayPtr extra info Data type info: Data type: address of a MIL_DOUBLE MORE Data type: address of a MIL_DOUBLE Recommended casting type: MIL_INT M_COMPLETE Specifies that the read operation completed successfully. It is possible to read 0 strings (M_STRING_NUMBER), and have a successfully completed read operation. M_CURRENTLY_READING Specifies that the read operation is currently ongoing. You can only get this status if you are retrieving it from another thread. M_INTERNAL_ERROR Specifies that an unexpected error occurred. M_NOT_ENOUGH_MEMORY Specifies that a memory allocation error occurred while reading. M_READ_NOT_PERFORMED Specifies that the read operation has not been performed. This is the initial status. M_STOPPED_BY_REQUEST Specifies that the read operation was explicitly stopped (MdmrControl() with M_STOP_READ). M_TIMEOUT_REACHED Specifies that the read operation ended because the timeout limit was reached (MdmrControl() with M_TIMEOUT). M_STRING_NUMBER Retrieves the total number of strings read. This is the total number of strings held by the result buffer. ResultArrayPtr extra info Data type info: Data type: address of a MIL_DOUBLE MORE Data type: address of a MIL_DOUBLE Recommended casting type: MIL_INT When retrieving string results, set the ResultType parameter to one of the values below. In this case, set the StringIndex parameter to the index of the string for which to get the result or M_ALL (unless otherwise specified), and set the CharPositionIndex parameter to either M_GENERAL or M_DEFAULT. For retrieving string results ResultType Description ResultArrayPtr - Possible values returned M_FORMATTED_STRING Retrieves the string that was read, according to the target string format. This information is returned as a regular string. It includes the name of all the characters in the string and the terminating null character. It also includes spaces, if the target string has any that are greater than the minimum spacing (MdmrControl() with M_SPACE_SIZE_MIN) and less than the maximum spacing (M_SPACE_SIZE_MAX). Note that this result type cannot be used when the StringIndex parameter is set to M_ALL. ResultArrayPtr extra info Data type info: Data type: array of type MIL_TEXT_CHAR MORE Data type: array of type MIL_TEXT_CHAR Required array size: MdmrGetResult ( M_FORMATTED_STRING + M_STRING_SIZE ) Note: When retrieving the result for a string in the result buffer. M_FORMATTED_STRING_CHAR_INVALID_INDICES Retrieves the positions of invalid or unreadable characters in the formatted string. ResultArrayPtr extra info Data type info: Data type: array of type MIL_DOUBLE [optionally, in C++: a reference to a std::vector&lt;MIL_DOUBLE&gt; ] MORE Data type: array of type MIL_DOUBLE [optionally, in C++: a reference to a std::vector&lt;MIL_DOUBLE&gt; ] Required array size: MdmrGetResult ( M_FORMATTED_STRING_CHAR_INVALID_INDICES + M_NB_ELEMENTS ) Recommended casting type: Array of type MIL_INT M_FORMATTED_STRING_CHAR_NUMBER Retrieves the total number of characters read, according to the target string format. This number includes spaces, if any were read in the target string, even if you did not add spaces to the string model as permitted character constraints (MdmrControlStringModel() with M_SPACE). M_FORMATTED_STRING_CHAR_NUMBER does not count the terminating null character. ResultArrayPtr extra info Data type info: Data type: address of a MIL_DOUBLE &nbsp;|&nbsp; array of type MIL_DOUBLE [optionally, in C++: a reference to a std::vector&lt;MIL_DOUBLE&gt; ] MORE Data type: address of a MIL_DOUBLE Note: When retrieving the result for a string in the result buffer. Data type: array of type MIL_DOUBLE [optionally, in C++: a reference to a std::vector&lt;MIL_DOUBLE&gt; ] Required array size (either of the following): MdmrGetResult ( M_STRING_NUMBER ) MdmrGetResult ( M_FORMATTED_STRING_CHAR_NUMBER + M_NB_ELEMENTS ) Note: When retrieving the result for all strings in the result buffer. Recommended casting type: Array of type MIL_INT M_SKIPPED_POSITIONS Retrieves the positions of the skipped characters; this result is only available when M_STRING_SIZE_MIN is less than M_STRING_SIZE_MAX. ResultArrayPtr extra info Data type info: Data type: array of type MIL_DOUBLE [optionally, in C++: a reference to a std::vector&lt;MIL_DOUBLE&gt; ] MORE Data type: array of type MIL_DOUBLE [optionally, in C++: a reference to a std::vector&lt;MIL_DOUBLE&gt; ] Required array size: MdmrGetResult ( M_SKIPPED_POSITIONS + M_NB_ELEMENTS ) Recommended casting type: Array of type MIL_INT M_STRING Retrieves the string that was read, according to the string model definition. This information is returned as a regular string. It includes the name of all the characters in the string and the terminating null character. It also include spaces, if they correspond to a space permitted character constraint in the string model (MdmrControlStringModel() with M_SPACE). Note that this result type cannot be used when the StringIndex parameter is set to M_ALL. ResultArrayPtr extra info Data type info: Data type: array of type MIL_TEXT_CHAR MORE Data type: array of type MIL_TEXT_CHAR Required array size: MdmrGetResult ( M_STRING + M_STRING_SIZE ) Note: When retrieving the result for a string in the result buffer. M_STRING_CHAR_INVALID_INDICES Retrieves the positions of invalid or unreadable characters in the string. To retrieve the positions of these characters in the formatted string, use M_FORMATTED_STRING_CHAR_INVALID_INDICES. ResultArrayPtr extra info Data type info: Data type: array of type MIL_DOUBLE [optionally, in C++: a reference to a std::vector&lt;MIL_DOUBLE&gt; ] MORE Data type: array of type MIL_DOUBLE [optionally, in C++: a reference to a std::vector&lt;MIL_DOUBLE&gt; ] Required array size: MdmrGetResult ( M_STRING_CHAR_INVALID_INDICES + M_NB_ELEMENTS ) Recommended casting type: Array of type MIL_INT M_STRING_CHAR_NUMBER Retrieves the total number of characters read, according to the string model definition. This number can include spaces, but only if they correspond to a space permitted character constraint in the string model (MdmrControlStringModel() with M_SPACE). M_STRING_CHAR_NUMBER does not count the terminating null character. ResultArrayPtr extra info Data type info: Data type: address of a MIL_DOUBLE &nbsp;|&nbsp; array of type MIL_DOUBLE [optionally, in C++: a reference to a std::vector&lt;MIL_DOUBLE&gt; ] MORE Data type: address of a MIL_DOUBLE Note: When retrieving the result for a string in the result buffer. Data type: array of type MIL_DOUBLE [optionally, in C++: a reference to a std::vector&lt;MIL_DOUBLE&gt; ] Required array size (either of the following): MdmrGetResult ( M_STRING_NUMBER ) MdmrGetResult ( M_STRING_CHAR_NUMBER + M_NB_ELEMENTS ) Note: When retrieving the result for all strings in the result buffer. Recommended casting type: Array of type MIL_INT M_STRING_MODEL_INDEX Retrieves the index of the string model, in the SureDotOCR context, used to read the string. ResultArrayPtr extra info Data type info: Data type: address of a MIL_DOUBLE &nbsp;|&nbsp; array of type MIL_DOUBLE [optionally, in C++: a reference to a std::vector&lt;MIL_DOUBLE&gt; ] MORE Data type: address of a MIL_DOUBLE Note: When retrieving the result for a string in the result buffer. Data type: array of type MIL_DOUBLE [optionally, in C++: a reference to a std::vector&lt;MIL_DOUBLE&gt; ] Required array size (either of the following): MdmrGetResult ( M_STRING_NUMBER ) MdmrGetResult ( M_STRING_MODEL_INDEX + M_NB_ELEMENTS ) Note: When retrieving the result for all strings in the result buffer. Recommended casting type: Array of type MIL_INT Value &gt;= 0 Specifies the index of the string model used to read the string. M_STRING_MODEL_LABEL Retrieves the label of the string model, in the SureDotOCR context, used to read the string. ResultArrayPtr extra info Data type info: Data type: address of a MIL_DOUBLE &nbsp;|&nbsp; array of type MIL_DOUBLE [optionally, in C++: a reference to a std::vector&lt;MIL_DOUBLE&gt; ] MORE Data type: address of a MIL_DOUBLE Note: When retrieving the result for a string in the result buffer. Data type: array of type MIL_DOUBLE [optionally, in C++: a reference to a std::vector&lt;MIL_DOUBLE&gt; ] Required array size (either of the following): MdmrGetResult ( M_STRING_NUMBER ) MdmrGetResult ( M_STRING_MODEL_LABEL + M_NB_ELEMENTS ) Note: When retrieving the result for all strings in the result buffer. Recommended casting type: Array of type MIL_INT Value &gt;= 0 Specifies the index of the string model used to read the string. M_STRING_SCORE Retrieves the string score calculated during the read operation. The string score is the average score of the characters in the string. This score does not include the score of an M_SPACE permitted character (MdmrControlStringModel()), if any were read in the string. ResultArrayPtr extra info Data type info: Data type: address of a MIL_DOUBLE &nbsp;|&nbsp; array of type MIL_DOUBLE [optionally, in C++: a reference to a std::vector&lt;MIL_DOUBLE&gt; ] MORE Data type: address of a MIL_DOUBLE Note: When retrieving the result for a string in the result buffer. Data type: array of type MIL_DOUBLE [optionally, in C++: a reference to a std::vector&lt;MIL_DOUBLE&gt; ] Required array size (either of the following): MdmrGetResult ( M_STRING_NUMBER ) MdmrGetResult ( M_STRING_SCORE + M_NB_ELEMENTS ) Note: When retrieving the result for all strings in the result buffer. When retrieving global or string results (one or all), set the ResultType parameter to one of the values below. In this case, set the StringIndex parameter to one or all strings, M_GENERAL or M_DEFAULT, and set the CharPositionIndex parameter to either M_GENERAL or M_DEFAULT. Note when the StringIndex parameter is set to either M_GENERAL or M_DEFAULT, the result type will be in reference to the region that encompasses all strings, as opposed to the region of the specific string(s). For retrieving global or string results ResultType Description ResultArrayPtr - Possible values returned M_ITALIC_CHAR_ANGLE Retrieves the italic angle at which characters in the string(s) are found. ResultArrayPtr extra info Data type info: Data type: address of a MIL_DOUBLE &nbsp;|&nbsp; array of type MIL_DOUBLE [optionally, in C++: a reference to a std::vector&lt;MIL_DOUBLE&gt; ] MORE Data type: address of a MIL_DOUBLE Note: When retrieving the result for a string in the result buffer, or for a global result. Data type: array of type MIL_DOUBLE [optionally, in C++: a reference to a std::vector&lt;MIL_DOUBLE&gt; ] Required array size (either of the following): MdmrGetResult ( M_STRING_NUMBER ) MdmrGetResult ( M_ITALIC_CHAR_ANGLE + M_NB_ELEMENTS ) Note: When retrieving results for all strings in the result buffer. M_ITALIC_PITCH Retrieves the distance between successive dot centers in the italic angle direction. ResultArrayPtr extra info Data type info: Data type: address of a MIL_DOUBLE &nbsp;|&nbsp; array of type MIL_DOUBLE [optionally, in C++: a reference to a std::vector&lt;MIL_DOUBLE&gt; ] MORE Data type: address of a MIL_DOUBLE Note: When retrieving the result for a string in the result buffer, or for a global result. Data type: array of type MIL_DOUBLE [optionally, in C++: a reference to a std::vector&lt;MIL_DOUBLE&gt; ] Required array size (either of the following): MdmrGetResult ( M_STRING_NUMBER ) MdmrGetResult ( M_ITALIC_PITCH + M_NB_ELEMENTS ) Note: When retrieving results for all strings in the result buffer. M_STRING_ANGLE Retrieves the angle of the string's bounding box, or the bounding box encompassing all strings, in degrees. The angle is measured at the box's base and is relative to the output coordinate system (MdmrControl() with M_RESULT_OUTPUT_UNITS). An angle interpreted with respect to the pixel coordinate system is always measured counter-clockwise, from the positive X-axis towards the negative Y-axis of the image. For information on the angle's direction of rotation when interpreting the angle with respect to the relative coordinate system, see the Angle convention in MIL subsection of the Working with real-world units section of Chapter 28: Calibrating your camera setup. ResultArrayPtr extra info Data type info: Data type: address of a MIL_DOUBLE &nbsp;|&nbsp; array of type MIL_DOUBLE [optionally, in C++: a reference to a std::vector&lt;MIL_DOUBLE&gt; ] MORE Data type: address of a MIL_DOUBLE Note: When retrieving the result for a string in the result buffer, or for a global result. Data type: array of type MIL_DOUBLE [optionally, in C++: a reference to a std::vector&lt;MIL_DOUBLE&gt; ] Required array size (either of the following): MdmrGetResult ( M_STRING_NUMBER ) MdmrGetResult ( M_STRING_ANGLE + M_NB_ELEMENTS ) Note: When retrieving results for all strings in the result buffer. M_STRING_BOX_BL_X Retrieves the X-coordinate of the bottom-left corner of the bounding box of the string, or the bounding box encompassing all strings, relative to the angle at which the string was found. ResultArrayPtr extra info Data type info: Data type: address of a MIL_DOUBLE &nbsp;|&nbsp; array of type MIL_DOUBLE [optionally, in C++: a reference to a std::vector&lt;MIL_DOUBLE&gt; ] MORE Data type: address of a MIL_DOUBLE Note: When retrieving the result for a string in the result buffer, or for a global result. Data type: array of type MIL_DOUBLE [optionally, in C++: a reference to a std::vector&lt;MIL_DOUBLE&gt; ] Required array size (either of the following): MdmrGetResult ( M_STRING_NUMBER ) MdmrGetResult ( M_STRING_BOX_BL_X + M_NB_ELEMENTS ) Note: When retrieving results for all strings in the result buffer. M_STRING_BOX_BL_Y Retrieves the Y-coordinate of the bottom-left corner of the bounding box of the string, or the bounding box encompassing all strings, relative to the angle at which the string was found. ResultArrayPtr extra info Data type info: Data type: address of a MIL_DOUBLE &nbsp;|&nbsp; array of type MIL_DOUBLE [optionally, in C++: a reference to a std::vector&lt;MIL_DOUBLE&gt; ] MORE Data type: address of a MIL_DOUBLE Note: When retrieving the result for a string in the result buffer, or for a global result. Data type: array of type MIL_DOUBLE [optionally, in C++: a reference to a std::vector&lt;MIL_DOUBLE&gt; ] Required array size (either of the following): MdmrGetResult ( M_STRING_NUMBER ) MdmrGetResult ( M_STRING_BOX_BL_Y + M_NB_ELEMENTS ) Note: When retrieving results for all strings in the result buffer. M_STRING_BOX_BR_X Retrieves the X-coordinate of the bottom-right corner of the bounding box of the string, or the bounding box encompassing all strings, relative to the angle at which the string was found. ResultArrayPtr extra info Data type info: Data type: address of a MIL_DOUBLE &nbsp;|&nbsp; array of type MIL_DOUBLE [optionally, in C++: a reference to a std::vector&lt;MIL_DOUBLE&gt; ] MORE Data type: address of a MIL_DOUBLE Note: When retrieving the result for a string in the result buffer, or for a global result. Data type: array of type MIL_DOUBLE [optionally, in C++: a reference to a std::vector&lt;MIL_DOUBLE&gt; ] Required array size (either of the following): MdmrGetResult ( M_STRING_NUMBER ) MdmrGetResult ( M_STRING_BOX_BR_X + M_NB_ELEMENTS ) Note: When retrieving results for all strings in the result buffer. M_STRING_BOX_BR_Y Retrieves the Y-coordinate of the bottom-right corner of the bounding box of the string, or the bounding box encompassing all strings, relative to the angle at which the string was found. ResultArrayPtr extra info Data type info: Data type: address of a MIL_DOUBLE &nbsp;|&nbsp; array of type MIL_DOUBLE [optionally, in C++: a reference to a std::vector&lt;MIL_DOUBLE&gt; ] MORE Data type: address of a MIL_DOUBLE Note: When retrieving the result for a string in the result buffer, or for a global result. Data type: array of type MIL_DOUBLE [optionally, in C++: a reference to a std::vector&lt;MIL_DOUBLE&gt; ] Required array size (either of the following): MdmrGetResult ( M_STRING_NUMBER ) MdmrGetResult ( M_STRING_BOX_BR_Y + M_NB_ELEMENTS ) Note: When retrieving results for all strings in the result buffer. M_STRING_BOX_UL_X Retrieves the X-coordinate of the top-left corner of the bounding box of the string, or the bounding box encompassing all strings, relative to the angle at which the string was found. ResultArrayPtr extra info Data type info: Data type: address of a MIL_DOUBLE &nbsp;|&nbsp; array of type MIL_DOUBLE [optionally, in C++: a reference to a std::vector&lt;MIL_DOUBLE&gt; ] MORE Data type: address of a MIL_DOUBLE Note: When retrieving the result for a string in the result buffer, or for a global result. Data type: array of type MIL_DOUBLE [optionally, in C++: a reference to a std::vector&lt;MIL_DOUBLE&gt; ] Required array size (either of the following): MdmrGetResult ( M_STRING_NUMBER ) MdmrGetResult ( M_STRING_BOX_UL_X + M_NB_ELEMENTS ) Note: When retrieving results for all strings in the result buffer. M_STRING_BOX_UL_Y Retrieves the Y-coordinate of the top-left corner of the bounding box of the string, or the bounding box encompassing all strings, relative to the angle at which the string was found. ResultArrayPtr extra info Data type info: Data type: address of a MIL_DOUBLE &nbsp;|&nbsp; array of type MIL_DOUBLE [optionally, in C++: a reference to a std::vector&lt;MIL_DOUBLE&gt; ] MORE Data type: address of a MIL_DOUBLE Note: When retrieving the result for a string in the result buffer, or for a global result. Data type: array of type MIL_DOUBLE [optionally, in C++: a reference to a std::vector&lt;MIL_DOUBLE&gt; ] Required array size (either of the following): MdmrGetResult ( M_STRING_NUMBER ) MdmrGetResult ( M_STRING_BOX_UL_Y + M_NB_ELEMENTS ) Note: When retrieving results for all strings in the result buffer. M_STRING_BOX_UR_X Retrieves the X-coordinate of the top-right corner of the bounding box of the string, or the bounding box encompassing all strings, relative to the angle at which the string was found. ResultArrayPtr extra info Data type info: Data type: address of a MIL_DOUBLE &nbsp;|&nbsp; array of type MIL_DOUBLE [optionally, in C++: a reference to a std::vector&lt;MIL_DOUBLE&gt; ] MORE Data type: address of a MIL_DOUBLE Note: When retrieving the result for a string in the result buffer, or for a global result. Data type: array of type MIL_DOUBLE [optionally, in C++: a reference to a std::vector&lt;MIL_DOUBLE&gt; ] Required array size (either of the following): MdmrGetResult ( M_STRING_NUMBER ) MdmrGetResult ( M_STRING_BOX_UR_X + M_NB_ELEMENTS ) Note: When retrieving results for all strings in the result buffer. M_STRING_BOX_UR_Y Retrieves the Y-coordinate of the top-right corner of the bounding box of the string, or the bounding box encompassing all strings, relative to the angle at which the string was found. ResultArrayPtr extra info Data type info: Data type: address of a MIL_DOUBLE &nbsp;|&nbsp; array of type MIL_DOUBLE [optionally, in C++: a reference to a std::vector&lt;MIL_DOUBLE&gt; ] MORE Data type: address of a MIL_DOUBLE Note: When retrieving the result for a string in the result buffer, or for a global result. Data type: array of type MIL_DOUBLE [optionally, in C++: a reference to a std::vector&lt;MIL_DOUBLE&gt; ] Required array size (either of the following): MdmrGetResult ( M_STRING_NUMBER ) MdmrGetResult ( M_STRING_BOX_UR_Y + M_NB_ELEMENTS ) Note: When retrieving results for all strings in the result buffer. M_STRING_CHAR_ANGLE Retrieves the angle at which characters in the string(s) are found. ResultArrayPtr extra info Data type info: Data type: address of a MIL_DOUBLE &nbsp;|&nbsp; array of type MIL_DOUBLE [optionally, in C++: a reference to a std::vector&lt;MIL_DOUBLE&gt; ] MORE Data type: address of a MIL_DOUBLE Note: When retrieving the result for a string in the result buffer, or for a global result. Data type: array of type MIL_DOUBLE [optionally, in C++: a reference to a std::vector&lt;MIL_DOUBLE&gt; ] Required array size (either of the following): MdmrGetResult ( M_STRING_NUMBER ) MdmrGetResult ( M_STRING_CHAR_ANGLE + M_NB_ELEMENTS ) Note: When retrieving results for all strings in the result buffer. M_STRING_HEIGHT Retrieves the height of the string's bounding box, or the bounding box encompassing all strings. ResultArrayPtr extra info Data type info: Data type: address of a MIL_DOUBLE &nbsp;|&nbsp; array of type MIL_DOUBLE [optionally, in C++: a reference to a std::vector&lt;MIL_DOUBLE&gt; ] MORE Data type: address of a MIL_DOUBLE Note: When retrieving the result for a string in the result buffer, or for a global result. Data type: array of type MIL_DOUBLE [optionally, in C++: a reference to a std::vector&lt;MIL_DOUBLE&gt; ] Required array size (either of the following): MdmrGetResult ( M_STRING_NUMBER ) MdmrGetResult ( M_STRING_HEIGHT + M_NB_ELEMENTS ) Note: When retrieving results for all strings in the result buffer. M_STRING_PITCH Retrieves the distance between successive dot centers in the string angle direction. ResultArrayPtr extra info Data type info: Data type: address of a MIL_DOUBLE &nbsp;|&nbsp; array of type MIL_DOUBLE [optionally, in C++: a reference to a std::vector&lt;MIL_DOUBLE&gt; ] MORE Data type: address of a MIL_DOUBLE Note: When retrieving the result for a string in the result buffer, or for a global result. Data type: array of type MIL_DOUBLE [optionally, in C++: a reference to a std::vector&lt;MIL_DOUBLE&gt; ] Required array size (either of the following): MdmrGetResult ( M_STRING_NUMBER ) MdmrGetResult ( M_STRING_PITCH + M_NB_ELEMENTS ) Note: When retrieving results for all strings in the result buffer. M_STRING_POSITION_X Retrieves the X-coordinate of the center of the bounding box of the string, or the bounding box encompassing all strings; this position is considered the position of the string, or bounding box of all strings. ResultArrayPtr extra info Data type info: Data type: address of a MIL_DOUBLE &nbsp;|&nbsp; array of type MIL_DOUBLE [optionally, in C++: a reference to a std::vector&lt;MIL_DOUBLE&gt; ] MORE Data type: address of a MIL_DOUBLE Note: When retrieving the result for a string in the result buffer, or for a global result. Data type: array of type MIL_DOUBLE [optionally, in C++: a reference to a std::vector&lt;MIL_DOUBLE&gt; ] Required array size (either of the following): MdmrGetResult ( M_STRING_NUMBER ) MdmrGetResult ( M_STRING_POSITION_X + M_NB_ELEMENTS ) Note: When retrieving results for all strings in the result buffer. M_STRING_POSITION_Y Retrieves the Y-coordinate of the center of the bounding box of the string, or the bounding box encompassing all strings; this position is considered the position of the string, or bounding box of all strings. ResultArrayPtr extra info Data type info: Data type: address of a MIL_DOUBLE &nbsp;|&nbsp; array of type MIL_DOUBLE [optionally, in C++: a reference to a std::vector&lt;MIL_DOUBLE&gt; ] MORE Data type: address of a MIL_DOUBLE Note: When retrieving the result for a string in the result buffer, or for a global result. Data type: array of type MIL_DOUBLE [optionally, in C++: a reference to a std::vector&lt;MIL_DOUBLE&gt; ] Required array size (either of the following): MdmrGetResult ( M_STRING_NUMBER ) MdmrGetResult ( M_STRING_POSITION_Y + M_NB_ELEMENTS ) Note: When retrieving results for all strings in the result buffer. M_STRING_WIDTH Retrieves the width of the string's bounding box, or the bounding box encompassing all strings. ResultArrayPtr extra info Data type info: Data type: address of a MIL_DOUBLE &nbsp;|&nbsp; array of type MIL_DOUBLE [optionally, in C++: a reference to a std::vector&lt;MIL_DOUBLE&gt; ] MORE Data type: address of a MIL_DOUBLE Note: When retrieving the result for a string in the result buffer, or for a global result. Data type: array of type MIL_DOUBLE [optionally, in C++: a reference to a std::vector&lt;MIL_DOUBLE&gt; ] Required array size (either of the following): MdmrGetResult ( M_STRING_NUMBER ) MdmrGetResult ( M_STRING_WIDTH + M_NB_ELEMENTS ) Note: When retrieving results for all strings in the result buffer. When retrieving results for characters in a string, set the ResultType parameter to one of the values below. In this case, set the StringIndex parameter to a string (one or all), and set the CharPositionIndex parameter to a character (one or all). Characters are ordered by their index position in their string. Note that M_CHAR_NAME cannot be used when the StringIndex parameter is set to M_ALL. For retrieving character results ResultType Description ResultArrayPtr - Possible values returned M_CHAR_BOX_BL_X Retrieves the X-coordinate of the bottom-left corner of the character's bounding box, relative to the angle at which the character was found. ResultArrayPtr extra info Data type info: Data type: address of a MIL_DOUBLE &nbsp;|&nbsp; array of type MIL_DOUBLE [optionally, in C++: a reference to a std::vector&lt;MIL_DOUBLE&gt; ] MORE Data type: address of a MIL_DOUBLE Note: When retrieving the result for a character in a string. Data type: array of type MIL_DOUBLE [optionally, in C++: a reference to a std::vector&lt;MIL_DOUBLE&gt; ] Required array size (either of the following): MdmrGetResult ( M_STRING_NUMBER ) MdmrGetResult ( M_CHAR_BOX_BL_X + M_NB_ELEMENTS ) Note: When retrieving the result for a character in all strings. Data type: array of type MIL_DOUBLE [optionally, in C++: a reference to a std::vector&lt;MIL_DOUBLE&gt; ] Required array size (either of the following): MdmrGetResult ( M_STRING_CHAR_NUMBER ) MdmrGetResult ( M_CHAR_BOX_BL_X + M_NB_ELEMENTS ) Note: When retrieving the result for all characters in a string. Data type: array of type MIL_DOUBLE [optionally, in C++: a reference to a std::vector&lt;MIL_DOUBLE&gt; ] Required array size: MdmrGetResult ( M_CHAR_BOX_BL_X + M_NB_ELEMENTS ) Note: When retrieving the result for all characters in all strings. In this case, sum the number of characters read (M_STRING_CHAR_NUMBER) for all strings read (M_STRING_NUMBER) to get the required array size. M_CHAR_BOX_BL_Y Retrieves the Y-coordinate of the bottom-left corner of the character's bounding box, relative to the angle at which the character was found. ResultArrayPtr extra info Data type info: Data type: address of a MIL_DOUBLE &nbsp;|&nbsp; array of type MIL_DOUBLE [optionally, in C++: a reference to a std::vector&lt;MIL_DOUBLE&gt; ] MORE Data type: address of a MIL_DOUBLE Note: When retrieving the result for a character in a string. Data type: array of type MIL_DOUBLE [optionally, in C++: a reference to a std::vector&lt;MIL_DOUBLE&gt; ] Required array size (either of the following): MdmrGetResult ( M_STRING_NUMBER ) MdmrGetResult ( M_CHAR_BOX_BL_Y + M_NB_ELEMENTS ) Note: When retrieving the result for a character in all strings. Data type: array of type MIL_DOUBLE [optionally, in C++: a reference to a std::vector&lt;MIL_DOUBLE&gt; ] Required array size (either of the following): MdmrGetResult ( M_STRING_CHAR_NUMBER ) MdmrGetResult ( M_CHAR_BOX_BL_Y + M_NB_ELEMENTS ) Note: When retrieving the result for all characters in a string. Data type: array of type MIL_DOUBLE [optionally, in C++: a reference to a std::vector&lt;MIL_DOUBLE&gt; ] Required array size: MdmrGetResult ( M_CHAR_BOX_BL_Y + M_NB_ELEMENTS ) Note: When retrieving the result for all characters in all strings. In this case, sum the number of characters read (M_STRING_CHAR_NUMBER) for all strings read (M_STRING_NUMBER) to get the required array size. M_CHAR_BOX_BR_X Retrieves the X-coordinate of the bottom-right corner of the character's bounding box, relative to the angle at which the character was found. ResultArrayPtr extra info Data type info: Data type: address of a MIL_DOUBLE &nbsp;|&nbsp; array of type MIL_DOUBLE [optionally, in C++: a reference to a std::vector&lt;MIL_DOUBLE&gt; ] MORE Data type: address of a MIL_DOUBLE Note: When retrieving the result for a character in a string. Data type: array of type MIL_DOUBLE [optionally, in C++: a reference to a std::vector&lt;MIL_DOUBLE&gt; ] Required array size (either of the following): MdmrGetResult ( M_STRING_NUMBER ) MdmrGetResult ( M_CHAR_BOX_BR_X + M_NB_ELEMENTS ) Note: When retrieving the result for a character in all strings. Data type: array of type MIL_DOUBLE [optionally, in C++: a reference to a std::vector&lt;MIL_DOUBLE&gt; ] Required array size (either of the following): MdmrGetResult ( M_STRING_CHAR_NUMBER ) MdmrGetResult ( M_CHAR_BOX_BR_X + M_NB_ELEMENTS ) Note: When retrieving the result for all characters in a string. Data type: array of type MIL_DOUBLE [optionally, in C++: a reference to a std::vector&lt;MIL_DOUBLE&gt; ] Required array size: MdmrGetResult ( M_CHAR_BOX_BR_X + M_NB_ELEMENTS ) Note: When retrieving the result for all characters in all strings. In this case, sum the number of characters read (M_STRING_CHAR_NUMBER) for all strings read (M_STRING_NUMBER) to get the required array size. M_CHAR_BOX_BR_Y Retrieves the Y-coordinate of the bottom-right corner of the character's bounding box, relative to the angle at which the character was found. ResultArrayPtr extra info Data type info: Data type: address of a MIL_DOUBLE &nbsp;|&nbsp; array of type MIL_DOUBLE [optionally, in C++: a reference to a std::vector&lt;MIL_DOUBLE&gt; ] MORE Data type: address of a MIL_DOUBLE Note: When retrieving the result for a character in a string. Data type: array of type MIL_DOUBLE [optionally, in C++: a reference to a std::vector&lt;MIL_DOUBLE&gt; ] Required array size (either of the following): MdmrGetResult ( M_STRING_NUMBER ) MdmrGetResult ( M_CHAR_BOX_BR_Y + M_NB_ELEMENTS ) Note: When retrieving the result for a character in all strings. Data type: array of type MIL_DOUBLE [optionally, in C++: a reference to a std::vector&lt;MIL_DOUBLE&gt; ] Required array size (either of the following): MdmrGetResult ( M_STRING_CHAR_NUMBER ) MdmrGetResult ( M_CHAR_BOX_BR_Y + M_NB_ELEMENTS ) Note: When retrieving the result for all characters in a string. Data type: array of type MIL_DOUBLE [optionally, in C++: a reference to a std::vector&lt;MIL_DOUBLE&gt; ] Required array size: MdmrGetResult ( M_CHAR_BOX_BR_Y + M_NB_ELEMENTS ) Note: When retrieving the result for all characters in all strings. In this case, sum the number of characters read (M_STRING_CHAR_NUMBER) for all strings read (M_STRING_NUMBER) to get the required array size. M_CHAR_BOX_UL_X Retrieves the X-coordinate of the top-left corner of the character's bounding box, relative to the angle at which the character was found. ResultArrayPtr extra info Data type info: Data type: address of a MIL_DOUBLE &nbsp;|&nbsp; array of type MIL_DOUBLE [optionally, in C++: a reference to a std::vector&lt;MIL_DOUBLE&gt; ] MORE Data type: address of a MIL_DOUBLE Note: When retrieving the result for a character in a string. Data type: array of type MIL_DOUBLE [optionally, in C++: a reference to a std::vector&lt;MIL_DOUBLE&gt; ] Required array size (either of the following): MdmrGetResult ( M_STRING_NUMBER ) MdmrGetResult ( M_CHAR_BOX_UL_X + M_NB_ELEMENTS ) Note: When retrieving the result for a character in all strings. Data type: array of type MIL_DOUBLE [optionally, in C++: a reference to a std::vector&lt;MIL_DOUBLE&gt; ] Required array size (either of the following): MdmrGetResult ( M_STRING_CHAR_NUMBER ) MdmrGetResult ( M_CHAR_BOX_UL_X + M_NB_ELEMENTS ) Note: When retrieving the result for all characters in a string. Data type: array of type MIL_DOUBLE [optionally, in C++: a reference to a std::vector&lt;MIL_DOUBLE&gt; ] Required array size: MdmrGetResult ( M_CHAR_BOX_UL_X + M_NB_ELEMENTS ) Note: When retrieving the result for all characters in all strings. In this case, sum the number of characters read (M_STRING_CHAR_NUMBER) for all strings read (M_STRING_NUMBER) to get the required array size. M_CHAR_BOX_UL_Y Retrieves the Y-coordinate of the top-left corner of the character's bounding box, relative to the angle at which the character was found. ResultArrayPtr extra info Data type info: Data type: address of a MIL_DOUBLE &nbsp;|&nbsp; array of type MIL_DOUBLE [optionally, in C++: a reference to a std::vector&lt;MIL_DOUBLE&gt; ] MORE Data type: address of a MIL_DOUBLE Note: When retrieving the result for a character in a string. Data type: array of type MIL_DOUBLE [optionally, in C++: a reference to a std::vector&lt;MIL_DOUBLE&gt; ] Required array size (either of the following): MdmrGetResult ( M_STRING_NUMBER ) MdmrGetResult ( M_CHAR_BOX_UL_Y + M_NB_ELEMENTS ) Note: When retrieving the result for a character in all strings. Data type: array of type MIL_DOUBLE [optionally, in C++: a reference to a std::vector&lt;MIL_DOUBLE&gt; ] Required array size (either of the following): MdmrGetResult ( M_STRING_CHAR_NUMBER ) MdmrGetResult ( M_CHAR_BOX_UL_Y + M_NB_ELEMENTS ) Note: When retrieving the result for all characters in a string. Data type: array of type MIL_DOUBLE [optionally, in C++: a reference to a std::vector&lt;MIL_DOUBLE&gt; ] Required array size: MdmrGetResult ( M_CHAR_BOX_UL_Y + M_NB_ELEMENTS ) Note: When retrieving the result for all characters in all strings. In this case, sum the number of characters read (M_STRING_CHAR_NUMBER) for all strings read (M_STRING_NUMBER) to get the required array size. M_CHAR_BOX_UR_X Retrieves the X-coordinate of the top-right corner of the character's bounding box, relative to the angle at which the character was found. ResultArrayPtr extra info Data type info: Data type: address of a MIL_DOUBLE &nbsp;|&nbsp; array of type MIL_DOUBLE [optionally, in C++: a reference to a std::vector&lt;MIL_DOUBLE&gt; ] MORE Data type: address of a MIL_DOUBLE Note: When retrieving the result for a character in a string. Data type: array of type MIL_DOUBLE [optionally, in C++: a reference to a std::vector&lt;MIL_DOUBLE&gt; ] Required array size (either of the following): MdmrGetResult ( M_STRING_NUMBER ) MdmrGetResult ( M_CHAR_BOX_UR_X + M_NB_ELEMENTS ) Note: When retrieving the result for a character in all strings. Data type: array of type MIL_DOUBLE [optionally, in C++: a reference to a std::vector&lt;MIL_DOUBLE&gt; ] Required array size (either of the following): MdmrGetResult ( M_STRING_CHAR_NUMBER ) MdmrGetResult ( M_CHAR_BOX_UR_X + M_NB_ELEMENTS ) Note: When retrieving the result for all characters in a string. Data type: array of type MIL_DOUBLE [optionally, in C++: a reference to a std::vector&lt;MIL_DOUBLE&gt; ] Required array size: MdmrGetResult ( M_CHAR_BOX_UR_X + M_NB_ELEMENTS ) Note: When retrieving the result for all characters in all strings. In this case, sum the number of characters read (M_STRING_CHAR_NUMBER) for all strings read (M_STRING_NUMBER) to get the required array size. M_CHAR_BOX_UR_Y Retrieves the Y-coordinate of the top-right corner of the character's bounding box, relative to the angle at which the character was found. ResultArrayPtr extra info Data type info: Data type: address of a MIL_DOUBLE &nbsp;|&nbsp; array of type MIL_DOUBLE [optionally, in C++: a reference to a std::vector&lt;MIL_DOUBLE&gt; ] MORE Data type: address of a MIL_DOUBLE Note: When retrieving the result for a character in a string. Data type: array of type MIL_DOUBLE [optionally, in C++: a reference to a std::vector&lt;MIL_DOUBLE&gt; ] Required array size (either of the following): MdmrGetResult ( M_STRING_NUMBER ) MdmrGetResult ( M_CHAR_BOX_UR_Y + M_NB_ELEMENTS ) Note: When retrieving the result for a character in all strings. Data type: array of type MIL_DOUBLE [optionally, in C++: a reference to a std::vector&lt;MIL_DOUBLE&gt; ] Required array size (either of the following): MdmrGetResult ( M_STRING_CHAR_NUMBER ) MdmrGetResult ( M_CHAR_BOX_UR_Y + M_NB_ELEMENTS ) Note: When retrieving the result for all characters in a string. Data type: array of type MIL_DOUBLE [optionally, in C++: a reference to a std::vector&lt;MIL_DOUBLE&gt; ] Required array size: MdmrGetResult ( M_CHAR_BOX_UR_Y + M_NB_ELEMENTS ) Note: When retrieving the result for all characters in all strings. In this case, sum the number of characters read (M_STRING_CHAR_NUMBER) for all strings read (M_STRING_NUMBER) to get the required array size. M_CHAR_FONT_INDEX Retrieves the index of the font, in the SureDotOCR context, that contains the representation of the character that was read in the string. ResultArrayPtr extra info Data type info: Data type: address of a MIL_DOUBLE &nbsp;|&nbsp; array of type MIL_DOUBLE [optionally, in C++: a reference to a std::vector&lt;MIL_DOUBLE&gt; ] MORE Data type: address of a MIL_DOUBLE Note: When retrieving the result for a character in a string. Data type: array of type MIL_DOUBLE [optionally, in C++: a reference to a std::vector&lt;MIL_DOUBLE&gt; ] Required array size (either of the following): MdmrGetResult ( M_STRING_NUMBER ) MdmrGetResult ( M_CHAR_FONT_INDEX + M_NB_ELEMENTS ) Note: When retrieving the result for a character in all strings. Data type: array of type MIL_DOUBLE [optionally, in C++: a reference to a std::vector&lt;MIL_DOUBLE&gt; ] Required array size (either of the following): MdmrGetResult ( M_STRING_CHAR_NUMBER ) MdmrGetResult ( M_CHAR_FONT_INDEX + M_NB_ELEMENTS ) Note: When retrieving the result for all characters in a string. Data type: array of type MIL_DOUBLE [optionally, in C++: a reference to a std::vector&lt;MIL_DOUBLE&gt; ] Required array size: MdmrGetResult ( M_CHAR_FONT_INDEX + M_NB_ELEMENTS ) Note: When retrieving the result for all characters in all strings. In this case, sum the number of characters read (M_STRING_CHAR_NUMBER) for all strings read (M_STRING_NUMBER) to get the required array size. Recommended casting type: Array of type MIL_INT M_CHAR_FONT_LABEL Retrieves the label of the font, in the SureDotOCR context, that contains the representation of the character that was read in the string. ResultArrayPtr extra info Data type info: Data type: address of a MIL_DOUBLE &nbsp;|&nbsp; array of type MIL_DOUBLE [optionally, in C++: a reference to a std::vector&lt;MIL_DOUBLE&gt; ] MORE Data type: address of a MIL_DOUBLE Note: When retrieving the result for a character in a string. Data type: array of type MIL_DOUBLE [optionally, in C++: a reference to a std::vector&lt;MIL_DOUBLE&gt; ] Required array size (either of the following): MdmrGetResult ( M_STRING_NUMBER ) MdmrGetResult ( M_CHAR_FONT_LABEL + M_NB_ELEMENTS ) Note: When retrieving the result for a character in all strings. Data type: array of type MIL_DOUBLE [optionally, in C++: a reference to a std::vector&lt;MIL_DOUBLE&gt; ] Required array size (either of the following): MdmrGetResult ( M_STRING_CHAR_NUMBER ) MdmrGetResult ( M_CHAR_FONT_LABEL + M_NB_ELEMENTS ) Note: When retrieving the result for all characters in a string. Data type: array of type MIL_DOUBLE [optionally, in C++: a reference to a std::vector&lt;MIL_DOUBLE&gt; ] Required array size: MdmrGetResult ( M_CHAR_FONT_LABEL + M_NB_ELEMENTS ) Note: When retrieving the result for all characters in all strings. In this case, sum the number of characters read (M_STRING_CHAR_NUMBER) for all strings read (M_STRING_NUMBER) to get the required array size. Recommended casting type: Array of type MIL_INT M_CHAR_HEIGHT Retrieves the height of the character's bounding box. ResultArrayPtr extra info Data type info: Data type: address of a MIL_DOUBLE &nbsp;|&nbsp; array of type MIL_DOUBLE [optionally, in C++: a reference to a std::vector&lt;MIL_DOUBLE&gt; ] MORE Data type: address of a MIL_DOUBLE Note: When retrieving the result for a character in a string. Data type: array of type MIL_DOUBLE [optionally, in C++: a reference to a std::vector&lt;MIL_DOUBLE&gt; ] Required array size (either of the following): MdmrGetResult ( M_STRING_NUMBER ) MdmrGetResult ( M_CHAR_HEIGHT + M_NB_ELEMENTS ) Note: When retrieving the result for a character in all strings. Data type: array of type MIL_DOUBLE [optionally, in C++: a reference to a std::vector&lt;MIL_DOUBLE&gt; ] Required array size (either of the following): MdmrGetResult ( M_STRING_CHAR_NUMBER ) MdmrGetResult ( M_CHAR_HEIGHT + M_NB_ELEMENTS ) Note: When retrieving the result for all characters in a string. Data type: array of type MIL_DOUBLE [optionally, in C++: a reference to a std::vector&lt;MIL_DOUBLE&gt; ] Required array size: MdmrGetResult ( M_CHAR_HEIGHT + M_NB_ELEMENTS ) Note: When retrieving the result for all characters in all strings. In this case, sum the number of characters read (M_STRING_CHAR_NUMBER) for all strings read (M_STRING_NUMBER) to get the required array size. M_CHAR_NAME Retrieves the name of the character in the string that was read. The name is returned as a regular string. It consists of the character name and the terminating null character. If a space was read, the name returned is an actual space (and the terminating null character). ResultArrayPtr extra info Data type info: Data type: array of type MIL_TEXT_CHAR MORE Data type: array of type MIL_TEXT_CHAR Required array size: MdmrGetResult ( M_CHAR_NAME + M_STRING_SIZE ) Note: When retrieving the result for a character in a string. Data type: array of type MIL_TEXT_CHAR Required array size: MdmrGetResult ( M_CHAR_NAME + M_STRING_SIZE ) Note: When retrieving the result for all characters in a string. In this case, you must sum the values returned by M_CHAR_NAME + M_STRING_SIZE for all characters (M_STRING_CHAR_NUMBER) in the string read, to get the required array size. M_CHAR_POSITION_X Retrieves the X-coordinate of the center of the bounding box of the character; this position is considered the position of the character. ResultArrayPtr extra info Data type info: Data type: address of a MIL_DOUBLE &nbsp;|&nbsp; array of type MIL_DOUBLE [optionally, in C++: a reference to a std::vector&lt;MIL_DOUBLE&gt; ] MORE Data type: address of a MIL_DOUBLE Note: When retrieving the result for a character in a string. Data type: array of type MIL_DOUBLE [optionally, in C++: a reference to a std::vector&lt;MIL_DOUBLE&gt; ] Required array size (either of the following): MdmrGetResult ( M_STRING_NUMBER ) MdmrGetResult ( M_CHAR_POSITION_X + M_NB_ELEMENTS ) Note: When retrieving the result for a character in all strings. Data type: array of type MIL_DOUBLE [optionally, in C++: a reference to a std::vector&lt;MIL_DOUBLE&gt; ] Required array size (either of the following): MdmrGetResult ( M_STRING_CHAR_NUMBER ) MdmrGetResult ( M_CHAR_POSITION_X + M_NB_ELEMENTS ) Note: When retrieving the result for all characters in a string. Data type: array of type MIL_DOUBLE [optionally, in C++: a reference to a std::vector&lt;MIL_DOUBLE&gt; ] Required array size: MdmrGetResult ( M_CHAR_POSITION_X + M_NB_ELEMENTS ) Note: When retrieving the result for all characters in all strings. In this case, sum the number of characters read (M_STRING_CHAR_NUMBER) for all strings read (M_STRING_NUMBER) to get the required array size. M_CHAR_POSITION_Y Retrieves the Y-coordinate of the center of the bounding box of the character; this position is considered the position of the character. ResultArrayPtr extra info Data type info: Data type: address of a MIL_DOUBLE &nbsp;|&nbsp; array of type MIL_DOUBLE [optionally, in C++: a reference to a std::vector&lt;MIL_DOUBLE&gt; ] MORE Data type: address of a MIL_DOUBLE Note: When retrieving the result for a character in a string. Data type: array of type MIL_DOUBLE [optionally, in C++: a reference to a std::vector&lt;MIL_DOUBLE&gt; ] Required array size (either of the following): MdmrGetResult ( M_STRING_NUMBER ) MdmrGetResult ( M_CHAR_POSITION_Y + M_NB_ELEMENTS ) Note: When retrieving the result for a character in all strings. Data type: array of type MIL_DOUBLE [optionally, in C++: a reference to a std::vector&lt;MIL_DOUBLE&gt; ] Required array size (either of the following): MdmrGetResult ( M_STRING_CHAR_NUMBER ) MdmrGetResult ( M_CHAR_POSITION_Y + M_NB_ELEMENTS ) Note: When retrieving the result for all characters in a string. Data type: array of type MIL_DOUBLE [optionally, in C++: a reference to a std::vector&lt;MIL_DOUBLE&gt; ] Required array size: MdmrGetResult ( M_CHAR_POSITION_Y + M_NB_ELEMENTS ) Note: When retrieving the result for all characters in all strings. In this case, sum the number of characters read (M_STRING_CHAR_NUMBER) for all strings read (M_STRING_NUMBER) to get the required array size. M_CHAR_SCORE Retrieves the character's score. This quantifies the similarity between the character in the target and the character in the font. If SureDotOCR reads an M_SPACE permitted character (MdmrControlStringModel()), its character score is always 100%. This score does not influence the string score (M_STRING_SCORE). ResultArrayPtr extra info Data type info: Data type: address of a MIL_DOUBLE &nbsp;|&nbsp; array of type MIL_DOUBLE [optionally, in C++: a reference to a std::vector&lt;MIL_DOUBLE&gt; ] MORE Data type: address of a MIL_DOUBLE Note: When retrieving the result for a character in a string. Data type: array of type MIL_DOUBLE [optionally, in C++: a reference to a std::vector&lt;MIL_DOUBLE&gt; ] Required array size (either of the following): MdmrGetResult ( M_STRING_NUMBER ) MdmrGetResult ( M_CHAR_SCORE + M_NB_ELEMENTS ) Note: When retrieving the result for a character in all strings. Data type: array of type MIL_DOUBLE [optionally, in C++: a reference to a std::vector&lt;MIL_DOUBLE&gt; ] Required array size (either of the following): MdmrGetResult ( M_STRING_CHAR_NUMBER ) MdmrGetResult ( M_CHAR_SCORE + M_NB_ELEMENTS ) Note: When retrieving the result for all characters in a string. Data type: array of type MIL_DOUBLE [optionally, in C++: a reference to a std::vector&lt;MIL_DOUBLE&gt; ] Required array size: MdmrGetResult ( M_CHAR_SCORE + M_NB_ELEMENTS ) Note: When retrieving the result for all characters in all strings. In this case, sum the number of characters read (M_STRING_CHAR_NUMBER) for all strings read (M_STRING_NUMBER) to get the required array size. M_CHAR_WIDTH Retrieves the width of the character's bounding box. ResultArrayPtr extra info Data type info: Data type: address of a MIL_DOUBLE &nbsp;|&nbsp; array of type MIL_DOUBLE [optionally, in C++: a reference to a std::vector&lt;MIL_DOUBLE&gt; ] MORE Data type: address of a MIL_DOUBLE Note: When retrieving the result for a character in a string. Data type: array of type MIL_DOUBLE [optionally, in C++: a reference to a std::vector&lt;MIL_DOUBLE&gt; ] Required array size (either of the following): MdmrGetResult ( M_STRING_NUMBER ) MdmrGetResult ( M_CHAR_WIDTH + M_NB_ELEMENTS ) Note: When retrieving the result for a character in all strings. Data type: array of type MIL_DOUBLE [optionally, in C++: a reference to a std::vector&lt;MIL_DOUBLE&gt; ] Required array size (either of the following): MdmrGetResult ( M_STRING_CHAR_NUMBER ) MdmrGetResult ( M_CHAR_WIDTH + M_NB_ELEMENTS ) Note: When retrieving the result for all characters in a string. Data type: array of type MIL_DOUBLE [optionally, in C++: a reference to a std::vector&lt;MIL_DOUBLE&gt; ] Required array size: MdmrGetResult ( M_CHAR_WIDTH + M_NB_ELEMENTS ) Note: When retrieving the result for all characters in all strings. In this case, sum the number of characters read (M_STRING_CHAR_NUMBER) for all strings read (M_STRING_NUMBER) to get the required array size. Combination value for M_FORMATTED_STRING , M_STRING , M_CHAR_NAME. You can add the following value to the above-mentioned values to get the size of a string. For retrieving the size of a string ResultType combination value Description ResultArrayPtr - Possible values returned M_STRING_SIZE Retrieves the number of characters in the string, including the terminating null character. When specifying M_FORMATTED_STRING + M_STRING_SIZE, the number returned also include spaces, if any were read in the target string. When specifying M_STRING + M_STRING_SIZE, the number returned can also include spaces, but only if they correspond to a space permitted character constraint in the string model. When specifying M_CHAR_NAME + M_STRING_SIZE, the number returned can include a space, if that was the character read. For M_CHAR_NAME, the name of each letter at each position is itself a string, with its own terminating null character. You must sum them all to get the required array size for a string. ResultArrayPtr extra info Data type info: Data type: address of a MIL_DOUBLE MORE Data type: address of a MIL_DOUBLE Recommended casting type: MIL_INT Combination values for M_FORMATTED_STRING , M_STRING , M_CHAR_NAME , M_STRING_SIZE. You can add one of the following values to the above-mentioned values to determine the UTF-16 (Unicode) character name information, which can be useful when working in an ASCII environment. If you are in an ASCII environment and you are getting results about character names (for example, with M_CHAR_NAME) that are within the Basic Latin range, SureDotOCR does not consider the Unicode name, by default. For example, if SureDotOCR reads the character 'A', which is a Basic Latin character, and you use M_CHAR_NAME to get the name of that character, SureDotOCR returns 'A', even if you explicitly named it \"\\x0041\" in the font. To return information about the character's UTF-16 (Unicode) name (that is, \"\\x0041\"), use the combination value M_HEX_UTF16_FOR_ALL. If you are in an ASCII environment and you are getting results about character names beyond the Basic Latin range, you can only retrieve information about the character name in hexadecimal format. For example, Basic Latin does not include the smiley face character; it must be named in hexadecimal format (\"\\x263A\") in the font. Note how the string size is affected. For example, the string \"abc?\" nominally consists of four characters plus the null-terminating character. However, in an ASCII environment, getting a string size result (retrieved with, for example, M_STRING + M_STRING_SIZE) will return 10 as the string size, because the string is read as \"abc\\x263A\". For the same string mentioned above (\"abc?\"), when M_HEX_UTF16_FOR_ALL is specified, you will obtain \"\\x0061\\x0062\\x0063\\x263A\" and a string size of 25. In a Unicode environment, the character representations are returned (for example, the smiley face), unless you explicitly specify a combination value (for example, to obtain \"\\x263A\" instead of the actual smiley face). For explicitly retrieving Unicode character name information (can be useful when working in ASCII) Combination value Description M_HEX_UTF16_FOR_ALL Retrieves results with the name of all characters in hexadecimal 16-bit Unicode (UTF-16) format. M_HEX_UTF16_FOR_NON_BASIC_LATIN Retrieves results with the names of characters that fall out of the Basic Latin range, in hexadecimal 16-bit Unicode (UTF-16) format. SureDotOCR returns information about Basic Latin characters according to their ASCII character representation even if they were added to the font in Unicode in hexadecimal format. Combination value for Tables: For retrieving global results For retrieving string results For retrieving global or string results For retrieving character results the values listed in all the parameter association tables. You can add the following value to the above-mentioned values to determine whether a result is available. For determining whether results are available ResultType Description ResultArrayPtr - Possible values returned M_AVAILABLE Retrieves whether the requested result type is available for retrieval. ResultArrayPtr extra info Data type info: Data type: array of type MIL_DOUBLE [optionally, in C++: a reference to a std::vector&lt;MIL_DOUBLE&gt; ] &nbsp;|&nbsp; address of a MIL_DOUBLE MORE Data type: array of type MIL_DOUBLE [optionally, in C++: a reference to a std::vector&lt;MIL_DOUBLE&gt; ] Required array size:(defined elsewhere) Note: When multiple results. Data type: address of a MIL_DOUBLE Note: When a single result. Recommended casting type: Array of type MIL_INT M_FALSE Specifies that the requested result type is not available. M_TRUE Specifies that the requested result type is available. Combination value for the values listed in For retrieving string results, For retrieving global or string results, For retrieving character results; (exceptions might exist) and for the following values: M_FORMATTED_STRING_CHAR_INVALID_INDICES , M_STRING_CHAR_INVALID_INDICES. You can add the following value to the above-mentioned values to determine the required array size (number of elements) to store the returned values. For determining the required array size (number of elements) to store the returned values ResultType combination value Description ResultArrayPtr - Possible values returned M_NB_ELEMENTS Retrieves the required array size (number of elements) to store the returned values. ResultArrayPtr extra info Data type info: Data type: address of a MIL_DOUBLE MORE Data type: address of a MIL_DOUBLE Recommended casting type: MIL_INT Combination values for the values listed in For retrieving global results, For retrieving global or string results; and for the following values: M_FORMATTED_STRING_CHAR_INVALID_INDICES , M_FORMATTED_STRING_CHAR_NUMBER , M_SKIPPED_POSITIONS , M_STRING_CHAR_INVALID_INDICES , M_STRING_CHAR_NUMBER , M_STRING_MODEL_INDEX , M_STRING_MODEL_LABEL , M_STRING_SCORE , M_CHAR_BOX_BL_X , M_CHAR_BOX_BL_Y , M_CHAR_BOX_BR_X , M_CHAR_BOX_BR_Y , M_CHAR_BOX_UL_X , M_CHAR_BOX_UL_Y , M_CHAR_BOX_UR_X , M_CHAR_BOX_UR_Y , M_CHAR_FONT_INDEX , M_CHAR_FONT_LABEL , M_CHAR_HEIGHT , M_CHAR_POSITION_X , M_CHAR_POSITION_Y , M_CHAR_SCORE , M_CHAR_WIDTH , M_STRING_SIZE. You can add one of the following values to the above-mentioned values to cast the requested results to a required data type. Note: In C++, when using a standard vector (std::vector) instead of an array, the values listed in this combination table must not be used. If you need to use a specific data type, instantiate the vector with the necessary data type. For casting the result to a required data type ResultType Description ResultArrayPtr - Possible values returned M_TYPE_MIL_DOUBLE Casts the requested results to a MIL_DOUBLE. ResultArrayPtr extra info Data type info: Data type: address of a MIL_DOUBLE &nbsp;|&nbsp; array of type MIL_DOUBLE [optionally, in C++: a reference to a std::vector&lt;MIL_DOUBLE&gt; ] MORE Data type: address of a MIL_DOUBLE Note: When a single result. Data type: array of type MIL_DOUBLE [optionally, in C++: a reference to a std::vector&lt;MIL_DOUBLE&gt; ] Required array size:(defined elsewhere) Note: When multiple results. M_TYPE_MIL_FLOAT Casts the requested results to a MIL_FLOAT. ResultArrayPtr extra info Data type info: Data type: address of a MIL_FLOAT &nbsp;|&nbsp; array of type MIL_FLOAT [optionally, in C++: a reference to a std::vector&lt;MIL_FLOAT&gt; ] MORE Data type: address of a MIL_FLOAT Note: When a single result. Data type: array of type MIL_FLOAT [optionally, in C++: a reference to a std::vector&lt;MIL_FLOAT&gt; ] Required array size:(defined elsewhere) Note: When multiple results. M_TYPE_MIL_ID Casts the requested results to a MIL_ID. ResultArrayPtr extra info Data type info: Data type: address of a MIL_ID &nbsp;|&nbsp; array of type MIL_ID [optionally, in C++: a reference to a std::vector&lt;MIL_ID&gt; ] MORE Data type: address of a MIL_ID Note: When a single result. Data type: array of type MIL_ID [optionally, in C++: a reference to a std::vector&lt;MIL_ID&gt; ] Required array size:(defined elsewhere) Note: When multiple results. M_TYPE_MIL_INT Casts the requested results to a MIL_INT. ResultArrayPtr extra info Data type info: Data type: address of a MIL_INT &nbsp;|&nbsp; array of type MIL_INT [optionally, in C++: a reference to a std::vector&lt;MIL_INT&gt; ] MORE Data type: address of a MIL_INT Note: When a single result. Data type: array of type MIL_INT [optionally, in C++: a reference to a std::vector&lt;MIL_INT&gt; ] Required array size:(defined elsewhere) Note: When multiple results. M_TYPE_MIL_INT16 Casts the requested results to a MIL_INT16. ResultArrayPtr extra info Data type info: Data type: address of a MIL_INT16 &nbsp;|&nbsp; array of type MIL_INT16 [optionally, in C++: a reference to a std::vector&lt;MIL_INT16&gt; ] MORE Data type: address of a MIL_INT16 Note: When a single result. Data type: array of type MIL_INT16 [optionally, in C++: a reference to a std::vector&lt;MIL_INT16&gt; ] Required array size:(defined elsewhere) Note: When multiple results. M_TYPE_MIL_INT32 Casts the requested results to a MIL_INT32. ResultArrayPtr extra info Data type info: Data type: address of a MIL_INT32 &nbsp;|&nbsp; array of type MIL_INT32 [optionally, in C++: a reference to a std::vector&lt;MIL_INT32&gt; ] MORE Data type: address of a MIL_INT32 Note: When a single result. Data type: array of type MIL_INT32 [optionally, in C++: a reference to a std::vector&lt;MIL_INT32&gt; ] Required array size:(defined elsewhere) Note: When multiple results. M_TYPE_MIL_INT64 Casts the requested results to a MIL_INT64. ResultArrayPtr extra info Data type info: Data type: address of a MIL_INT64 &nbsp;|&nbsp; array of type MIL_INT64 [optionally, in C++: a reference to a std::vector&lt;MIL_INT64&gt; ] MORE Data type: address of a MIL_INT64 Note: When a single result. Data type: array of type MIL_INT64 [optionally, in C++: a reference to a std::vector&lt;MIL_INT64&gt; ] Required array size:(defined elsewhere) Note: When multiple results. Compilation information Header Include mil.h. Library Use mil.lib; mildmr.lib. DLL Requires mil.dll; mildmr.dll. Syntax Description Parameters - ResultDmrId - StringIndex For specifying the string for which to get results, or for specifying global results - CharPositionIndex For specifying the character for which to get results, or for specifying global or string results - ResultType - ResultArrayPtr Parameter Associations For retrieving global results For retrieving string results For retrieving global or string results For retrieving character results + For retrieving the size of a string + For explicitly retrieving Unicode character name information (can be useful when working in ASCII) + For determining whether results are available + For determining the required array size (number of elements) to store the returned values + For casting the result to a required data type Compilation information ",
      "wordCount": 9566,
      "subEntries": []
    },
    {
      "id": "Reference_dmr_MdmrImportFont",
      "version": null,
      "title": "MdmrImportFont",
      "subTitles": null,
      "location": "MIL Reference",
      "pageURL": "content\\Reference\\dmr\\MdmrImportFont.htm",
      "text": " MdmrImportFont Synopsis Import characters from a font file into a new or existing font of a SureDotOCR context. Syntax void MdmrImportFont( MIL_CONST_TEXT_PTR&nbsp;FileName, //in MIL_INT64&nbsp;FileFormat, //in MIL_ID&nbsp;ContextDmrId, //in MIL_INT64&nbsp;FontLabelOrIndex, //in MIL_CONST_TEXT_PTR&nbsp;CharList, //in MIL_INT64&nbsp;ControlFlag //in ) Description This function imports characters from a font file into a new or existing font of a SureDotOCR context. The fonts of a context contain the characters that string models use to read dot-matrix text. Fonts should only contain characters you want to read. For easier use with other Matrox Imaging software products, you should import characters from a SureDotOCR font file. This is a text file saved with the extension MDMRF. The file must be in UTF-16 (little-endian order) with a BOM (Byte Order Mark) indicating this; the BOM value is U+FEFF. You can also import a font from a SureDotOCR font file exported from a SureDotOCR context, using MdmrExportFont(). The content of SureDotOCR font files must adhere to the expected format. Below is an example of how the character 'A' should appear in a SureDotOCR font file. SureDotOCR font files should have \"File Representation\" and \"MIL_DOT_FONT\" in lines 1 and 2. Lines 4 and greater should specify the characters; separate each with a blank line. Every character should begin with the word \"CharValue\" and its name. Names can be in UTF-16 byte hexadecimal by beginning them with \"\\x\" (for example, 'A' would use \"\\x0041\"). The character's dot-matrix must be below the \"CharValue\" line. Use \"FF\" for dots that represent the character; otherwise use \"00\". The dot-matrix of the font's characters should be identical to the dot-matrix of the characters in the strings to read. Every dot-matrix in a font must have the same number of columns and rows. MIL installs SureDotOCR console-based font utilities, such as DmrEditFontFile (accessible from the Matrox Example Launcher), and predefined SureDotOCR font files (for example, *.mdmrf in C:\\Program Files\\Matrox Imaging\\Contexts). Use them to create and update fonts. In this case, file and content requirements are automatically respected; ensure that you maintain these requirements as you develop your fonts. For more information, see the Fonts section of Chapter 15: SureDotOCR. When you call MdmrImportFont() to add a new font (or to add characters to an empty font), the dimensions of the characters' dot-matrix represent the dimensions of the dot-matrix template of the font. Subsequent characters that you add to the font must use these dimensions or you will get an error. To inquire the dimensions, call MdmrInquireFont() with M_FONT_SIZE_COLUMNS and M_FONT_SIZE_ROWS. You can also use this function to inquire about other aspects of the font. To delete a font from a context, or to delete a character from a font, call MdmrControl() or MdmrControlFont(), respectively. You can also use these functions to set font-related control types, add an empty font to a context, or add characters to a font (or modify existing characters) by defining their representations in an array. Fonts should only contain characters you want to read. Delete all unnecessary characters. A SureDotOCR font file must be for a single font. To import multiple fonts, call MdmrImportFont() multiple times. Modifying a context's fonts can affect which strings are read in the target image. You must preprocess the SureDotOCR context after you have finished adjusting a context's fonts and before calling MdmrRead(). To know if a context needs to be preprocessed, call MdmrInquire() with M_PREPROCESSED. You cannot represent certain characters, such as null or the standard space (\"0x0020\"), in a font file. To establish the distance between characters in a target string that represents a space, call MdmrControl() with M_SPACE_SIZE_MAX and M_SPACE_SIZE_MIN. Parameters Parameters FileName Specifies the name and path of the SureDotOCR font file (MDMRF) from which to import the font. The function internally handles the opening and closing of the file. To specify the file name and path of a SureDotOCR font file, set this parameter to one of the values below: For specifying the file name and path Value Description M_INTERACTIVE [This is only applicable to Windows] Opens a dialog box from which you can interactively specify the drive, directory, and name of a SureDotOCR font file. MIL_TEXT(\"FileName\") 1 Specifies the drive, directory, and name of a SureDotOCR font file (for example, \"C:\\mydirectory\\MySweetSweetFont.mdmrf\"). To specify a SureDotOCR font file on a remote computer (under Distributed MIL), prefix the specified file name string with \"remote:///\" (for example, \"remote:///C:\\mydirectory\\MySweetSweetFont.mdmrf\"). 1 If you are passing the value in a variable, don't enclose it in MIL_TEXT(). FileFormat Specifies the format of the file from which to import the font. Set this parameter to the value below. For specifying the file format Value Description M_DMR_FONT_FILE Specifies a SureDotOCR font file format (MDMRF). ContextDmrId Specifies the identifier of the SureDotOCR context to which you are importing the characters. The context must have been previously allocated on the system using MdmrAlloc(). FontLabelOrIndex Specifies the label or index of an already existing font, or the addition of a new font. Set this parameter to one of the values below: For specifying an already existing font, or the addition of a new font Value Description M_DEFAULT Same as M_NEW_LABEL. M_FONT_INDEX( MIL_INT IndexValue ) Specifies an already existing font in the context by indicating its index. SureDotOCR imports the new characters to the specified font. Parameters IndexValue Set this parameter to the following: 0 &lt;= Value &lt; M_NUMBER_OF_FONTS Specifies the index of the font. M_FONT_LABEL( MIL_INT LabelValue ) Specifies to add a new font or to update an already existing font by indicating a label. If the specified label refers to a font in the context, SureDotOCR imports the new characters to it. If the specified label does not refer to a font in the context, SureDotOCR adds a new font to the context with that label, and imports the new characters to it. Parameters LabelValue Set this parameter to the following: Value &gt; 0 Specifies the label of the font. M_NEW_LABEL Specifies to add the imported characters as a new font in the context and to automatically assign it a label. To inquire about the label, use MdmrInquireFont() with M_FONT_LABEL_VALUE. To change the label, use MdmrControlFont() with M_FONT_LABEL_VALUE. CharList Specifies the characters to import from the SureDotOCR font file. Set this parameter to one of the values below: For specifying the characters to import Value Description M_NULL Same as M_IMPORT_ALL_CHARS. M_IMPORT_ALL_CHARS Imports all characters. MIL_TEXT(\"CharList\") 1 Specifies a null-terminated string indicating the names of the characters to import. Character names must refer to specific letters (such as 'o'), digits (such as '0'), and punctuation marks (such as '%') in the font. You cannot indicate a space. The specified string can contain one or more character names. List them all without separators. For example, to specify the twenty-second, the ninth, and the third uppercase letters of the alphabet, use the string \"VIC\". Specifying multiple characters is equivalent to calling this function multiple times, and listing one character each time. You can list character names in hexadecimal format beginning with \"\\x\". This is necessary if you are in an ASCII environment and you want Unicode characters beyond the Basic Latin range. For example, Basic Latin does not include the smiley face character; to specify it, use \"\\x263A\". You can also list a string of character names with mixed notation; in this case, use \"\\\\x\" instead (for example, \"VIC\\\\x263A\"). 1 If you are passing the value in a variable, don't enclose it in MIL_TEXT(). ControlFlag Specifies how to handle importing characters that have the same name as characters already in the font. A font in a context cannot have multiple characters with the same name. Set this parameter to one of the values below: For specifying how to handle characters with the same name Value Description M_DEFAULT Same as M_NO_OVERWRITE. M_NO_OVERWRITE Specifies to not overwrite characters already in the font with characters that you are importing, when the characters have the same name. M_OVERWRITE Specifies to overwrite characters already in the font with characters that you are importing, when the characters have the same name. Compilation information Header Include mil.h. Library Use mil.lib; mildmr.lib. DLL Requires mil.dll; mildmr.dll. Syntax Description Parameters - FileName For specifying the file name and path - FileFormat For specifying the file format - ContextDmrId - FontLabelOrIndex For specifying an already existing font, or the addition of a new font - CharList For specifying the characters to import - ControlFlag For specifying how to handle characters with the same name Compilation information ",
      "wordCount": 1400,
      "subEntries": []
    },
    {
      "id": "Reference_dmr_MdmrInquire",
      "version": null,
      "title": "MdmrInquire",
      "subTitles": null,
      "location": "MIL Reference",
      "pageURL": "content\\Reference\\dmr\\MdmrInquire.htm",
      "text": " MdmrInquire Synopsis Inquire about a SureDotOCR context or result buffer setting. Syntax MIL_INT MdmrInquire( MIL_ID&nbsp;ContextOrResultDmrId, //in MIL_INT64&nbsp;InquireType, //in void&nbsp;*UserVarPtr //out ) Description This function inquires about a setting of a SureDotOCR context or result buffer. Such settings are typically specified with MdmrControl(). If the inquired setting is set to M_DEFAULT (for example, in MdmrControl()), MdmrInquire() will return M_DEFAULT. To inquire the actual default value, add M_DEFAULT to the InquireType parameter. Parameters Parameters ContextOrResultDmrId Specifies the identifier of the SureDotOCR context or result buffer about which to inquire. The context must have been previously allocated on the system using MdmrAlloc(). The result buffer must have been previously allocated on the system using MdmrAllocResult(). InquireType Specifies the setting to inquire. See the Parameter associations section for possible values that can be specified. UserVarPtr Accepts the address of one of the following (see the Parameter associations section for specifics on which is expected): array of type MIL_DOUBLE [optionally, in C++: a reference to a std::vector&lt;MIL_DOUBLE&gt; ] array of type MIL_FLOAT [optionally, in C++: a reference to a std::vector&lt;MIL_FLOAT&gt; ] array of type MIL_ID [optionally, in C++: a reference to a std::vector&lt;MIL_ID&gt; ] array of type MIL_INT [optionally, in C++: a reference to a std::vector&lt;MIL_INT&gt; ] array of type MIL_INT16 [optionally, in C++: a reference to a std::vector&lt;MIL_INT16&gt; ] array of type MIL_INT32 [optionally, in C++: a reference to a std::vector&lt;MIL_INT32&gt; ] array of type MIL_INT64 [optionally, in C++: a reference to a std::vector&lt;MIL_INT64&gt; ] array of type MIL_TEXT_CHAR [optionally, in C++: a reference to a MIL_STRING] MIL_DOUBLE MIL_FLOAT MIL_ID MIL_INT MIL_INT16 MIL_INT32 MIL_INT64 Specifies the address in which to write the requested information. Since the MdmrInquire() function also returns the requested information, you can set this parameter to M_NULL. See the Parameter associations section for possible values that can be returned. Parameter associations The tables below list possible values for the InquireType parameter and possible values returned to the UserVarPtr parameter. For inquiring about a SureDotOCR context For inquiring about a SureDotOCR result buffer To inquire about the SureDotOCR context specified with the ContextOrResultDmrId parameter, set the InquireType parameter to one of the values below. SureDotOCR can only read strings that adhere to these settings (they apply to all string models in the context). For inquiring about a SureDotOCR context InquireType Description UserVarPtr - Possible values returned M_DOT_DIAMETER Inquires the diameter of the dots that make up the characters in the strings. UserVarPtr extra info Data type info: Data type: address of a MIL_DOUBLE Data type: address of a MIL_DOUBLE M_INVALID Specifies an invalid diameter. Set the diameter to a valid value, using MdmrControl() with M_DOT_DIAMETER. Value &gt; 0.0 Specifies the diameter, in pixels. M_DOT_DIAMETER_SPREAD Inquires the range of possible dot diameter deviations, in pixels, centered at the M_DOT_DIAMETER. In other words, the maximum allowed dot diameter deviation over and below the specified dot diameter is half this value. UserVarPtr extra info Data type info: Data type: address of a MIL_DOUBLE Data type: address of a MIL_DOUBLE M_DEFAULT Specifies the default value; the default value is 1.0. Value &gt;= 0.0 Specifies the spread, in pixels. M_DOT_DIAMETER_SPREAD_MODE Inquires whether the range of possible dot diameter deviations is enabled, or not. UserVarPtr extra info Data type info: Data type: address of a MIL_DOUBLE MORE Data type: address of a MIL_DOUBLE Recommended casting type: MIL_INT M_DEFAULT Same as M_DISABLE. M_DISABLE Specifies that range of dot diameter deviations is disabled. M_ENABLE Specifies that range of dot diameter deviations is enabled. M_DOT_DIAMETER_STEP Inquires the step that will be used inside the range of dot diameter deviation. UserVarPtr extra info Data type info: Data type: address of a MIL_DOUBLE Data type: address of a MIL_DOUBLE M_DEFAULT Specifies the default value; the default value is 0.1. Value &gt; 0.0 Specifies the step, in pixels. M_FOREGROUND_VALUE Inquires the foreground value of the characters in the strings. UserVarPtr extra info Data type info: Data type: address of a MIL_DOUBLE MORE Data type: address of a MIL_DOUBLE Recommended casting type: MIL_INT M_DEFAULT Same as M_FOREGROUND_BLACK. M_FOREGROUND_BLACK Specifies that strings with characters darker than the background will be read. M_FOREGROUND_WHITE Specifies that strings with characters lighter than the background will be read. M_ITALIC_ANGLE Inquires the italic angle at which to read the characters in the strings. M_ITALIC_ANGLE only has an effect if M_ITALIC_ANGLE_MODE is set to M_ANGLE. UserVarPtr extra info Data type info: Data type: address of a MIL_DOUBLE Data type: address of a MIL_DOUBLE M_DEFAULT Specifies the default value; the default value is 0. -90.0 &lt;= Value &lt;= 90.0 Specifies the italic angle, in degrees. M_ITALIC_ANGLE_MODE Inquires whether the italic angle is detected automatically or explicitly specified. UserVarPtr extra info Data type info: Data type: address of a MIL_DOUBLE MORE Data type: address of a MIL_DOUBLE Recommended casting type: MIL_INT M_DEFAULT Specifies the default value; the default value is M_AUTO. M_ANGLE Specifies to use the italic angle specified with M_ITALIC_ANGLE. M_AUTO Specifies that the italic angle is detected automatically. M_ITALIC_PITCH Inquires the distance between successive dot centers, in the italic angle direction, at which to read the characters in the strings. M_ITALIC_PITCH only has an effect if M_ITALIC_PITCH_MODE is set to M_USER_DEFINED. UserVarPtr extra info Data type info: Data type: address of a MIL_DOUBLE Data type: address of a MIL_DOUBLE M_DEFAULT Specifies the default value; the default value is 3.0 pixels. Value &gt; 0.0 Specifies the pitch, in pixels. M_ITALIC_PITCH_MODE Inquires whether the distance between successive dot centers, in the italic angle direction, is detected automatically or explicitly specified. UserVarPtr extra info Data type info: Data type: address of a MIL_DOUBLE MORE Data type: address of a MIL_DOUBLE Recommended casting type: MIL_INT M_DEFAULT Specifies the default value; the default value is M_AUTO. M_AUTO Specifies to automatically establish the distance between dot centers in the italic angle direction. M_USER_DEFINED Specifies to use the value set with M_ITALIC_PITCH. M_MAX_INTENSITY Inquires the maximum pixel intensity of a character's dots. UserVarPtr extra info Data type info: Data type: address of a MIL_DOUBLE Data type: address of a MIL_DOUBLE M_DEFAULT Specifies the default value; the default value is 255.0. 0.0 &lt;= Value &lt;= 255.0 Specifies the maximum pixel intensity. M_MAX_INTENSITY_MODE Inquires how to establish the maximum pixel intensity of a character's dots. UserVarPtr extra info Data type info: Data type: address of a MIL_DOUBLE MORE Data type: address of a MIL_DOUBLE Recommended casting type: MIL_INT M_DEFAULT Same as M_AUTO. M_AUTO Specifies to automatically establish the maximum pixel intensity of a character's dots. M_USER_DEFINED Specifies to use the maximum pixel intensity value set with M_MAX_INTENSITY. M_MIN_CONTRAST Inquires the minimum contrast between a character and its background. UserVarPtr extra info Data type info: Data type: address of a MIL_DOUBLE Data type: address of a MIL_DOUBLE M_DEFAULT Specifies the default value; the default value is 15.0. 0.0 &lt;= Value &lt;= 255.0 Specifies the minimum contrast. M_MIN_CONTRAST_MODE Inquires how to establish the minimum contrast between a character and its background. UserVarPtr extra info Data type info: Data type: address of a MIL_DOUBLE MORE Data type: address of a MIL_DOUBLE Recommended casting type: MIL_INT M_DEFAULT Same as M_AUTO. M_AUTO Specifies to automatically establish the minimum contrast of characters. M_USER_DEFINED Specifies to use the minimum contrast value set with M_MIN_CONTRAST. M_MIN_INTENSITY Inquires the minimum pixel intensity of a character's dots. UserVarPtr extra info Data type info: Data type: address of a MIL_DOUBLE Data type: address of a MIL_DOUBLE M_DEFAULT Specifies the default value; the default value is 0.0. 0.0 &lt;= Value &lt;= 255.0 Specifies the minimum pixel intensity. M_MIN_INTENSITY_MODE Inquires how to establish the minimum pixel intensity of a character's dots. UserVarPtr extra info Data type info: Data type: address of a MIL_DOUBLE MORE Data type: address of a MIL_DOUBLE Recommended casting type: MIL_INT M_DEFAULT Same as M_AUTO. M_AUTO Specifies to automatically establish the minimum pixel intensity of character dots. M_USER_DEFINED Specifies to use the minimum pixel intensity value set with M_MIN_INTENSITY. M_MODIFICATION_COUNT Inquires the current value of the modification counter. The modification counter is increased by one each time settings for the context are modified. Although you cannot identify the modification counter's contents, you can compare them throughout your application to know if the context has been altered. If the modification counter has changed you can, for example, prompt the user to save before closing the application. UserVarPtr extra info Data type info: Data type: address of a MIL_DOUBLE MORE Data type: address of a MIL_DOUBLE Recommended casting type: MIL_INT Value Specifies the current value of the modification counter. M_NUMBER_OF_FONTS Inquires the number of fonts in the context. To add and remove fonts, use MdmrControl(). To import fonts, use MdmrImportFont(). UserVarPtr extra info Data type info: Data type: address of a MIL_DOUBLE MORE Data type: address of a MIL_DOUBLE Recommended casting type: MIL_INT Value &gt;= 0 Specifies the number of fonts. M_NUMBER_OF_STRING_MODELS Inquires the number of string models in the context. To add and remove string models, use MdmrControl(). UserVarPtr extra info Data type info: Data type: address of a MIL_DOUBLE MORE Data type: address of a MIL_DOUBLE Recommended casting type: MIL_INT Value &gt;= 0 Specifies the number of string models. M_OWNER_SYSTEM Inquires the identifier of the system on which the context was allocated. UserVarPtr extra info Data type info: Data type: address of a MIL_DOUBLE MORE Data type: address of a MIL_DOUBLE Recommended casting type: MIL_ID M_DEFAULT_HOST Specifies the default Host system of the current MIL application. MIL system identifier Specifies a valid system identifier, previously allocated using MsysAlloc(). M_PREPROCESSED Inquires whether the context is preprocessed. The context must be preprocessed, using MdmrPreprocess(), before calling MdmrRead(). After certain modifications to the context, as can be done with MdmrControl(), MdmrControlFont(), or MdmrControlStringModel(), this inquire type will indicate that the context is no longer in its preprocessed state. UserVarPtr extra info Data type info: Data type: address of a MIL_DOUBLE MORE Data type: address of a MIL_DOUBLE Recommended casting type: MIL_INT M_FALSE Specifies that the context is not preprocessed. M_TRUE Specifies that the context is preprocessed. M_SPACE_SIZE_MAX Inquires the value with which to determine the maximum width of a space character. UserVarPtr extra info Data type info: Data type: address of a MIL_DOUBLE Data type: address of a MIL_DOUBLE M_DEFAULT Specifies the default value; the default value is 3.0. Value &gt; 0.0 Specifies the maximum width value. M_SPACE_SIZE_MAX_MODE Inquires how to determine the maximum width of a space character. UserVarPtr extra info Data type info: Data type: address of a MIL_DOUBLE MORE Data type: address of a MIL_DOUBLE Recommended casting type: MIL_INT M_DEFAULT Same as M_CHAR_WIDTH_FACTOR. M_CHAR_WIDTH_FACTOR Specifies that the maximum width of a space character is determined by multiplying the M_SPACE_SIZE_MAX value by the string's maximum character width, in pixels. M_DISABLE Specifies no maximum space width. M_SPACE_SIZE_MIN Inquires the value with which to determine the minimum width of a space character. UserVarPtr extra info Data type info: Data type: address of a MIL_DOUBLE Data type: address of a MIL_DOUBLE M_DEFAULT Specifies the default value; the default value is 1.0. Value &gt; 0.0 Specifies the minimum width value. M_SPACE_SIZE_MIN_MODE Inquires how to determine the minimum width of a space character. UserVarPtr extra info Data type info: Data type: address of a MIL_DOUBLE MORE Data type: address of a MIL_DOUBLE Recommended casting type: MIL_INT M_DEFAULT Same as M_CHAR_WIDTH_FACTOR. M_CHAR_WIDTH_FACTOR Specifies that the minimum width of a space character is determined by multiplying the M_SPACE_SIZE_MIN value by the string's maximum character width, in pixels. M_DISABLE Specifies no minimum space width. M_STRING_ANGLE Inquires the angle at which to read a string. UserVarPtr extra info Data type info: Data type: address of a MIL_DOUBLE Data type: address of a MIL_DOUBLE M_DEFAULT Specifies the default value; the default value is 0. M_ACCORDING_TO_REGION Specifies that the angle is set to the angle of the target image's ROI. 0.0 &lt;= Value &lt;= 360.0 Specifies a fixed angle at which to read a string, in degrees. M_STRING_ANGLE_INPUT_UNITS Inquires the coordinate system that is used for M_STRING_ANGLE. This is ignored when M_STRING_ANGLE is set to M_ACCORDING_TO_REGION. UserVarPtr extra info Data type info: Data type: address of a MIL_DOUBLE MORE Data type: address of a MIL_DOUBLE Recommended casting type: MIL_INT M_DEFAULT Same as M_PIXEL. M_PIXEL Specifies to interpret the value in pixel units, with respect to the pixel coordinate system. M_WORLD Specifies to interpret the value in world units, with respect to the relative coordinate system. M_STRING_ANGLE_MODE Inquires whether the string angle is detected automatically or explicitly specified. UserVarPtr extra info Data type info: Data type: address of a MIL_DOUBLE MORE Data type: address of a MIL_DOUBLE Recommended casting type: MIL_INT M_DEFAULT Specifies the default value; the default value is M_AUTO. M_ANGLE Specifies to use the angle specified with M_STRING_ANGLE; the string will be read from left to right with the characters facing upward along the specified angle. M_AUTO Specifies that the string angle is detected automatically; M_STRING_ANGLE is ignored. M_ORIENTATION Specifies that the string will be read from left to right with the characters facing upward, or from right to left with the character facing downward. M_STRING_PARTIAL_CHAR_INVALID Inquires the single character string to replace invalid or unrecognized characters if M_STRING_PARTIAL_MODE is enabled. UserVarPtr extra info Data type info: Data type: array of type MIL_TEXT_CHAR [optionally, in C++: MIL_STRING ] MORE Data type: array of type MIL_TEXT_CHAR [optionally, in C++: MIL_STRING ] Required array size: MdmrInquire ( M_STRING_PARTIAL_CHAR_INVALID + M_STRING_SIZE ) Note: When using C++, you can pass a reference to a MIL_STRING instead. In this case, the function will automatically determine the correct string size. MIL_TEXT(\"SingleCharacterString\") 1 Specifies the single character string to replace invalid or unrecognized characters. M_STRING_PARTIAL_MODE Inquires how partial strings are returned during the reading process. UserVarPtr extra info Data type info: Data type: address of a MIL_DOUBLE MORE Data type: address of a MIL_DOUBLE Recommended casting type: MIL_INT M_DISABLE Specifies that only complete strings will be returned. M_ENABLE Specifies that the best match for a partial string will be returned; unrecognized characters in the string will be replaced with M_STRING_PARTIAL_CHAR_INVALID. M_STRING_PITCH Inquires the distance between successive dot centers, in the string angle direction, at which to read the characters in the strings. M_STRING_PITCH only has an effect if M_STRING_PITCH_MODE is set to M_USER_DEFINED. UserVarPtr extra info Data type info: Data type: address of a MIL_DOUBLE Data type: address of a MIL_DOUBLE M_DEFAULT Specifies the default value; the default value is 3.0 pixels. Value &gt; 0.0 Specifies the pitch, in pixels. M_STRING_PITCH_MODE Inquires whether the distance between successive dot centers, in the string angle direction, is detected automatically or explicitly specified. UserVarPtr extra info Data type info: Data type: address of a MIL_DOUBLE MORE Data type: address of a MIL_DOUBLE Recommended casting type: MIL_INT M_DEFAULT Specifies the default value; the default value is M_AUTO. M_AUTO Specifies to automatically establish the distance between dot centers in the string angle direction. M_USER_DEFINED Specifies to use the value set with M_STRING_PITCH. M_TEXT_BLOCK_HEIGHT Inquires the height of the text block. This is the area that encloses all dot-matrix text in the image buffer (or in the buffer's associated region of interest). UserVarPtr extra info Data type info: Data type: address of a MIL_DOUBLE Data type: address of a MIL_DOUBLE M_INVALID Specifies an invalid height. Set the height to a valid value, using MdmrControl() with M_TEXT_BLOCK_HEIGHT. Value &gt; 0.0 Specifies the height, in pixels. M_TEXT_BLOCK_SIZE_MODE Inquires how to establish the size of the text block. This is the area that encloses all dot-matrix text in the image buffer (or in the buffer's associated region of interest). UserVarPtr extra info Data type info: Data type: address of a MIL_DOUBLE MORE Data type: address of a MIL_DOUBLE Recommended casting type: MIL_INT M_DEFAULT Same as M_USER_DEFINED. M_USER_DEFINED Specifies that the size of the rectangular block is defined by the M_TEXT_BLOCK_HEIGHT and M_TEXT_BLOCK_WIDTH settings. M_TEXT_BLOCK_WIDTH Inquires the width of the text block. This is the area that encloses all dot-matrix text in the image buffer (or in the buffer's associated region of interest). UserVarPtr extra info Data type info: Data type: address of a MIL_DOUBLE Data type: address of a MIL_DOUBLE M_INVALID Specifies an invalid width. Set the width to a valid value, using MdmrControl() with M_TEXT_BLOCK_WIDTH. Value &gt; 0.0 Specifies the width, in pixels. M_TIMEOUT Inquires the maximum read time for MdmrRead(). UserVarPtr extra info Data type info: Data type: address of a MIL_DOUBLE Data type: address of a MIL_DOUBLE M_DEFAULT Specifies the default value; the default value is 2000.0 msec. M_DISABLE Specifies an infinite amount of read time. Value &gt;= 0.0 Specifies the maximum read time, in msec. 1 If the value was passed in a variable, it won't be returned enclosed in MIL_TEXT(). Combination value for M_STRING_PARTIAL_CHAR_INVALID. You can add the following value to the above-mentioned value to get the size of a string.. For retrieving the size of a string InquireType combination value Description UserVarPtr - Possible values returned M_STRING_SIZE Retrieves the number of characters in the string, including the terminating null character. UserVarPtr extra info Data type info: Data type: address of a MIL_DOUBLE MORE Data type: address of a MIL_DOUBLE Recommended casting type: MIL_INT To inquire about the SureDotOCR result buffer specified with the ContextOrResultDmrId parameter, set the InquireType parameter to one of the values below. For inquiring about a SureDotOCR result buffer InquireType Description UserVarPtr - Possible values returned M_RESULT_OUTPUT_UNITS Inquires whether to return results in pixels or world units. UserVarPtr extra info Data type info: Data type: address of a MIL_DOUBLE MORE Data type: address of a MIL_DOUBLE Recommended casting type: MIL_INT M_ACCORDING_TO_CALIBRATION Specifies that results are returned in world units if the result was calculated on an image associated with a camera calibration context; otherwise, specifies that results are returned in pixel units. M_PIXEL Specifies that results are returned in pixel units, with respect to the pixel coordinate system. M_WORLD Specifies that results are returned in world units, with respect to the relative coordinate system. Combination value for the values listed in For inquiring about a SureDotOCR context, For inquiring about a SureDotOCR result buffer. You can add the following value to the above-mentioned values to get the default value of an inquire type, regardless of the current value of the inquire type. For inquiring the default value InquireType Description UserVarPtr - Possible values returned M_DEFAULT Inquires the default value of the specified inquire type. UserVarPtr extra info Data type info: Data type: address of a MIL_DOUBLE Data type: address of a MIL_DOUBLE Combination values for the values listed in For inquiring about a SureDotOCR context, For inquiring about a SureDotOCR result buffer. You can add one of the following values to the above-mentioned values to determine whether an inquire type is supported for the SureDotOCR context currently being inquired. For inquiring if an inquire type is supported InquireType Description UserVarPtr - Possible values returned M_HAS_DEFAULT Inquires whether the specified inquire type has a default value. UserVarPtr extra info Data type info: Data type: address of a MIL_DOUBLE Data type: address of a MIL_DOUBLE M_FALSE Specifies that the inquire type does not have a default value. M_TRUE Specifies that the inquire type has a default value. M_SUPPORTED Inquires whether the specified inquire type is supported. UserVarPtr extra info Data type info: Data type: address of a MIL_DOUBLE MORE Data type: address of a MIL_DOUBLE Recommended casting type: MIL_INT M_FALSE Specifies that the inquire type is not supported. M_TRUE Specifies that the inquire type is supported. Combination values for the values listed in For inquiring about a SureDotOCR context, For inquiring about a SureDotOCR result buffer; (exceptions might exist) and for the following value: M_STRING_SIZE. You can add one of the following values to the above-mentioned values to cast the requested results to a required data type. Note: In C++, when using a standard vector (std::vector) instead of an array, the values listed in this combination table must not be used. If you need to use a specific data type, instantiate the vector with the necessary data type. For casting the result to a required data type InquireType Description UserVarPtr - Possible values returned M_TYPE_MIL_DOUBLE Casts the requested results to a MIL_DOUBLE. UserVarPtr extra info Data type info: Data type: address of a MIL_DOUBLE &nbsp;|&nbsp; array of type MIL_DOUBLE [optionally, in C++: a reference to a std::vector&lt;MIL_DOUBLE&gt; ] MORE Data type: address of a MIL_DOUBLE Note: When a single result. Data type: array of type MIL_DOUBLE [optionally, in C++: a reference to a std::vector&lt;MIL_DOUBLE&gt; ] Required array size:(defined elsewhere) Note: When multiple results. M_TYPE_MIL_FLOAT Casts the requested results to a MIL_FLOAT. UserVarPtr extra info Data type info: Data type: address of a MIL_FLOAT &nbsp;|&nbsp; array of type MIL_FLOAT [optionally, in C++: a reference to a std::vector&lt;MIL_FLOAT&gt; ] MORE Data type: address of a MIL_FLOAT Note: When a single result. Data type: array of type MIL_FLOAT [optionally, in C++: a reference to a std::vector&lt;MIL_FLOAT&gt; ] Required array size:(defined elsewhere) Note: When multiple results. M_TYPE_MIL_ID Casts the requested results to a MIL_ID. UserVarPtr extra info Data type info: Data type: address of a MIL_ID &nbsp;|&nbsp; array of type MIL_ID [optionally, in C++: a reference to a std::vector&lt;MIL_ID&gt; ] MORE Data type: address of a MIL_ID Note: When a single result. Data type: array of type MIL_ID [optionally, in C++: a reference to a std::vector&lt;MIL_ID&gt; ] Required array size:(defined elsewhere) Note: When multiple results. M_TYPE_MIL_INT Casts the requested results to a MIL_INT. UserVarPtr extra info Data type info: Data type: address of a MIL_INT &nbsp;|&nbsp; array of type MIL_INT [optionally, in C++: a reference to a std::vector&lt;MIL_INT&gt; ] MORE Data type: address of a MIL_INT Note: When a single result. Data type: array of type MIL_INT [optionally, in C++: a reference to a std::vector&lt;MIL_INT&gt; ] Required array size:(defined elsewhere) Note: When multiple results. M_TYPE_MIL_INT16 Casts the requested results to a MIL_INT16. UserVarPtr extra info Data type info: Data type: address of a MIL_INT16 &nbsp;|&nbsp; array of type MIL_INT16 [optionally, in C++: a reference to a std::vector&lt;MIL_INT16&gt; ] MORE Data type: address of a MIL_INT16 Note: When a single result. Data type: array of type MIL_INT16 [optionally, in C++: a reference to a std::vector&lt;MIL_INT16&gt; ] Required array size:(defined elsewhere) Note: When multiple results. M_TYPE_MIL_INT32 Casts the requested results to a MIL_INT32. UserVarPtr extra info Data type info: Data type: address of a MIL_INT32 &nbsp;|&nbsp; array of type MIL_INT32 [optionally, in C++: a reference to a std::vector&lt;MIL_INT32&gt; ] MORE Data type: address of a MIL_INT32 Note: When a single result. Data type: array of type MIL_INT32 [optionally, in C++: a reference to a std::vector&lt;MIL_INT32&gt; ] Required array size:(defined elsewhere) Note: When multiple results. M_TYPE_MIL_INT64 Casts the requested results to a MIL_INT64. UserVarPtr extra info Data type info: Data type: address of a MIL_INT64 &nbsp;|&nbsp; array of type MIL_INT64 [optionally, in C++: a reference to a std::vector&lt;MIL_INT64&gt; ] MORE Data type: address of a MIL_INT64 Note: When a single result. Data type: array of type MIL_INT64 [optionally, in C++: a reference to a std::vector&lt;MIL_INT64&gt; ] Required array size:(defined elsewhere) Note: When multiple results. Return value The returned value is the requested information, cast to a MIL_INT. If the requested information does not fit into a MIL_INT, this function will return M_NULL or truncate the information. Compilation information Header Include mil.h. Library Use mil.lib; mildmr.lib. DLL Requires mil.dll; mildmr.dll. Syntax Description Parameters - ContextOrResultDmrId - InquireType - UserVarPtr Parameter Associations For inquiring about a SureDotOCR context + For retrieving the size of a string For inquiring about a SureDotOCR result buffer + For inquiring the default value + For inquiring if an inquire type is supported + For casting the result to a required data type Return value Compilation information ",
      "wordCount": 3894,
      "subEntries": []
    },
    {
      "id": "Reference_dmr_MdmrInquireFont",
      "version": null,
      "title": "MdmrInquireFont",
      "subTitles": null,
      "location": "MIL Reference",
      "pageURL": "content\\Reference\\dmr\\MdmrInquireFont.htm",
      "text": " MdmrInquireFont Synopsis Inquire about a global setting of a font in a SureDotOCR context, or inquire about a character in a font. Syntax MIL_INT MdmrInquireFont( MIL_ID&nbsp;ContextDmrId, //in MIL_INT64&nbsp;FontLabelOrIndex, //in MIL_INT64&nbsp;CharIndex, //in MIL_CONST_TEXT_PTR&nbsp;CharNamePtr, //in MIL_INT64&nbsp;InquireType, //in void&nbsp;*UserVarPtr //out ) Description This function inquires about a global setting of a font in a SureDotOCR context, or inquires about a character in a font. Font settings can be specified with MdmrControlFont(). Characters you are inquiring about are typically imported into a font with MdmrImportFont(). You can also inquire about characters added to a font with MdmrControlFont(). If the inquired setting is set to M_DEFAULT (for example, in MdmrControlFont()), MdmrInquireFont() will return M_DEFAULT. To inquire the actual default value, add M_DEFAULT to the InquireType parameter. Parameters Parameters ContextDmrId Specifies the identifier of the SureDotOCR context that contains the font about which to inquire. The context must have been previously allocated on the system using MdmrAlloc(). FontLabelOrIndex Specifies the font about which to inquire. Set this parameter to one of the values below: For specifying the font Value Description M_FONT_INDEX( MIL_INT IndexValue ) Specifies to inquire about the font by indicating its index. Parameters IndexValue Specifies the index of the font. 0 &lt;= Value &lt; M_NUMBER_OF_FONTS Specifies the index of the font to control. M_FONT_LABEL( MIL_INT LabelValue ) Specifies to inquire about the font by indicating its label. Parameters LabelValue Specifies the label of the font. 0 &lt; Value &lt; 2097152 Specifies the label of the font about which to inquire. CharIndex Specifies the index of a character in the font, if required. Set this parameter to one of the values below: For specifying the index of a character Value Description M_DEFAULT Specifies that this parameter is not required. Value &gt;= 0 Specifies the index of a character. CharNamePtr Specifies the name of a character in the font, if required. Set this parameter to one of the values below: For specifying the name of the character Value Description M_NULL Specifies that this parameter is not required. MIL_TEXT(\"CharName\") 1 Specifies the character name. For example, 'A' is the name that identifies the first uppercase letter of the English alphabet. When using the CharNamePtr parameter to specify a character, the CharIndex parameter must be set to M_DEFAULT. 1 If you are passing the value in a variable, don't enclose it in MIL_TEXT(). InquireType Specifies the type of inquire to perform. See the Parameter associations section for possible values that can be specified. UserVarPtr Accepts the address of one of the following (see the Parameter associations section for specifics on which is expected): array of type MIL_TEXT_CHAR [optionally, in C++: a reference to a MIL_STRING] array of type MIL_UINT8 [optionally, in C++: a reference to a std::vector&lt;MIL_UINT8&gt; ] MIL_DOUBLE MIL_INT MIL_INT32 MIL_INT64 MIL_UINT8 Specifies the address in which to write the requested information. Since the MdmrInquireFont() function also returns the requested information, you can set this parameter to M_NULL. See the Parameter associations section for possible values that can be returned. Parameter associations The tables below list possible values for the InquireType parameter and possible values returned to the UserVarPtr parameter. For inquiring about a global setting of a font For inquiring about a font's characters To inquire about a global setting of a font, set the InquireType parameter to one of the values below. Unless otherwise specified, set the FontLabelOrIndex parameter to the label or index of a font, the CharIndex parameter to M_DEFAULT, and the CharNamePtr parameter to M_NULL. For inquiring about a global setting of a font InquireType Description UserVarPtr - Possible values returned M_FONT_INDEX_VALUE Inquires the index value of a font. Set the FontLabelOrIndex parameter to the font's label. UserVarPtr extra info Data type info: Data type: address of a MIL_DOUBLE MORE Data type: address of a MIL_DOUBLE Recommended casting type: MIL_INT M_INVALID Specifies that the font to which you are referring does not exist in the context. 0 &lt;= Value &lt;= 255 Specifies the index of the font. M_FONT_LABEL_VALUE Inquires the label value of the font. Set the FontLabelOrIndex parameter to the font's index. UserVarPtr extra info Data type info: Data type: address of a MIL_DOUBLE MORE Data type: address of a MIL_DOUBLE Recommended casting type: MIL_INT 0 &lt; Value &lt; 2097152 Specifies the font's label value. If SureDotOCR cannot return the requested information (no such font exists in the context), you will get an error. M_FONT_SIZE_COLUMNS Inquires the number of columns in the font's dot-matrix template. UserVarPtr extra info Data type info: Data type: address of a MIL_DOUBLE MORE Data type: address of a MIL_DOUBLE Recommended casting type: MIL_INT M_DEFAULT Specifies the default value; the default value is 5 columns. Value &gt; 0 Specifies the number of columns, as an integer. M_FONT_SIZE_ROWS Inquires the number of rows in the font's dot-matrix template. UserVarPtr extra info Data type info: Data type: address of a MIL_DOUBLE MORE Data type: address of a MIL_DOUBLE Recommended casting type: MIL_INT M_DEFAULT Specifies the default value; the default value is 7 rows. Value &gt; 0 Specifies the number of rows, as an integer. M_FONT_SIZE_TEMPLATE Inquires the total number of dots possible in the font's dot-matrix template. The returned value corresponds to M_FONT_SIZE_COLUMNS * M_FONT_SIZE_ROWS. UserVarPtr extra info Data type info: Data type: address of a MIL_DOUBLE MORE Data type: address of a MIL_DOUBLE Recommended casting type: MIL_INT Value &gt;= 0 Specifies the number of dots. M_NUMBER_OF_CHARS Inquires the number of characters in the font. Characters are added with MdmrImportFont() or MdmrControlStringModel(). UserVarPtr extra info Data type info: Data type: address of a MIL_DOUBLE MORE Data type: address of a MIL_DOUBLE Recommended casting type: MIL_INT Value &gt;= 0 Specifies the number of characters. Combination value for M_FONT_SIZE_COLUMNS , M_FONT_SIZE_ROWS. You can add the following value to the above-mentioned values to get the default value of an inquire type (if supported), regardless of the current value of the inquire type. For inquiring the default value InquireType Description UserVarPtr - Possible values returned M_DEFAULT Inquires the default value of the specified inquire type. UserVarPtr extra info Data type info: Data type: address of a MIL_DOUBLE Data type: address of a MIL_DOUBLE To inquire about a font's characters, set the InquireType parameter to one of the values below. Unless otherwise specified, the FontLabelOrIndex parameter must be set to the label or index of a font, and either the CharIndex or CharNamePtr parameter must specify a character. For inquiring about a font's characters InquireType Description UserVarPtr - Possible values returned M_CHAR_INDEX_VALUE Inquires the index value of the character, based on its name. Set the CharIndex parameter to M_DEFAULT and the CharNamePtr parameter to the name of the character in the font. UserVarPtr extra info Data type info: Data type: address of a MIL_DOUBLE MORE Data type: address of a MIL_DOUBLE Recommended casting type: MIL_INT M_INVALID Specifies that the character to which you are referring does not exist in the font. Value &gt;= 0 Specifies the index of the character. M_CHAR_NAME Inquires the name of the character, based on its index. Set the CharIndex parameter to the index of a character in the font and the CharNamePtr parameter to M_NULL. M_CHAR_NAME is returned as a regular string. It consists of all characters including the terminating null character. UserVarPtr extra info Data type info: Data type: array of type MIL_TEXT_CHAR [optionally, in C++: MIL_STRING ] MORE Data type: array of type MIL_TEXT_CHAR [optionally, in C++: MIL_STRING ] Required array size: MdmrInquireFont ( M_CHAR_NAME + M_STRING_SIZE ) Note: When using C++, you can pass a reference to a MIL_STRING instead. In this case, the function will automatically determine the correct string size. Value Specifies the name. M_CHAR_TEMPLATE Inquires the dot-matrix that represents the character in the font. The dot-matrix is returned as array data, organized one row contiguously after the other, where 255 (0xFF) represents a dot and 0 represents a blank. UserVarPtr extra info Data type info: Data type: array of type MIL_UINT8 [optionally, in C++: a reference to a std::vector&lt;MIL_UINT8&gt; ] MORE Data type: array of type MIL_UINT8 [optionally, in C++: a reference to a std::vector&lt;MIL_UINT8&gt; ] Required array size (either of the following): MdmrInquireFont ( M_FONT_SIZE_ROWS ) * MdmrInquireFont ( M_FONT_SIZE_COLUMNS ) MdmrInquireFont ( M_CHAR_TEMPLATE + M_NB_ELEMENTS ) Value Specifies the character's dot-matrix. Combination value for M_CHAR_TEMPLATE. You can add the following value to the above-mentioned value to determine the required array size (number of elements) to store the returned values. For determining the required array size (number of elements) to store the returned values InquireType combination value Description UserVarPtr - Possible values returned M_NB_ELEMENTS Retrieves the required array size (number of elements) to store the returned values. UserVarPtr extra info Data type info: Data type: address of a MIL_DOUBLE MORE Data type: address of a MIL_DOUBLE Recommended casting type: MIL_INT Combination value for M_CHAR_NAME. You can add the following value to the above-mentioned value to get the size of a string. For inquiring the size of a string InquireType combination value Description UserVarPtr - Possible values returned M_STRING_SIZE Inquires the number of characters in the string. This number accounts for every character, including the terminating null character. All strings have the terminating null character, even though you need not explicitly list it when specifying the string. UserVarPtr extra info Data type info: Data type: address of a MIL_DOUBLE MORE Data type: address of a MIL_DOUBLE Recommended casting type: MIL_INT Combination values for M_CHAR_NAME , M_STRING_SIZE. You can add one of the following values to the above-mentioned values to determine the UTF-16 (Unicode) character name information, which can be useful when working in an ASCII environment. If you are in an ASCII environment and you are inquiring about character names (for example, with M_CHAR_NAME) that are within the Basic Latin range, SureDotOCR does not consider the Unicode name, by default. For example, if SureDotOCR reads the character 'A', which is a Basic Latin character, and you use M_CHAR_NAME to get the name of that character, SureDotOCR returns 'A', even if you explicitly named it \"\\x0041\" in the font. To return information about the character's UTF-16 (Unicode) name (that is, \"\\x0041\"), use the combination value M_HEX_UTF16_FOR_ALL. If you are in an ASCII environment and you are inquiring about character names beyond the Basic Latin range, you can only retrieve information about the character name in hexadecimal format. For example, Basic Latin does not include the smiley face character; it is named in hexadecimal format (\"\\x263A\") in the font. Note that the string size information can change when these combination values are added. For example, in an ASCII environment, if the first four characters in the font are \"abc?\", using M_CHAR_NAME + M_HEX_UTF16_FOR_NON_BASIC_LATIN returns \"b\" for the character at index 1, and \"\\x263A\" for the character at index 3. Consequently, the string sizes are 2 and 7, respectively (inquired with M_CHAR_NAME + M_STRING_SIZE + M_HEX_UTF16_FOR_NON_BASIC_LATIN). If M_HEX_UTF16_FOR_ALL is specified, the preceding example returns \"\\x0062\" and \"\\x263A\" for the respective character names, and 7 for each string size. Recall that the null-terminating character is included in the string size. In a Unicode environment, the character representations are returned (for example, the smiley face), unless you explicitly specify a combination value (for example, to obtain \"\\x263A\" instead of the actual smiley face). For explicitly inquiring about Unicode character name information (can be useful when working in ASCII) Combination value Description M_HEX_UTF16_FOR_ALL Retrieves results with the name of all characters in hexadecimal 16-bit Unicode (UTF-16) format. M_HEX_UTF16_FOR_NON_BASIC_LATIN Retrieves results with the names of characters that fall out of the Basic Latin range, in hexadecimal 16-bit Unicode (UTF-16) format. Combination values for the values listed in For inquiring about a global setting of a font, For inquiring about a font's characters. You can add one of the following values to the above-mentioned values to determine whether an inquire type is supported for the font currently being inquired. For inquiring if an inquire type is supported InquireType Description UserVarPtr - Possible values returned M_HAS_DEFAULT Inquires whether the specified inquire type has a default value. UserVarPtr extra info Data type info: Data type: address of a MIL_DOUBLE Data type: address of a MIL_DOUBLE M_FALSE Specifies that the inquire type does not have a default value. M_TRUE Specifies that the inquire type has a default value. M_SUPPORTED Inquires whether the specified inquire type is supported. UserVarPtr extra info Data type info: Data type: address of a MIL_DOUBLE MORE Data type: address of a MIL_DOUBLE Recommended casting type: MIL_INT M_FALSE Specifies that the inquire type is not supported. M_TRUE Specifies that the inquire type is supported. Combination values for the values listed in For inquiring about a global setting of a font; and for the following values: M_CHAR_INDEX_VALUE , M_CHAR_TEMPLATE , M_STRING_SIZE. You can add one of the following values to the above-mentioned values to cast the requested information to the required data type. For casting the requested information to the required data type InquireType Description UserVarPtr - Possible values returned M_TYPE_MIL_DOUBLE Casts the requested information to a MIL_DOUBLE. UserVarPtr extra info Data type info: Data type: address of a MIL_DOUBLE Data type: address of a MIL_DOUBLE M_TYPE_MIL_INT Casts the requested information to a MIL_INT. UserVarPtr extra info Data type info: Data type: address of a MIL_INT Data type: address of a MIL_INT M_TYPE_MIL_INT32 Casts the requested information to a MIL_INT32. UserVarPtr extra info Data type info: Data type: address of a MIL_INT32 Data type: address of a MIL_INT32 M_TYPE_MIL_INT64 Casts the requested information to a MIL_INT64. UserVarPtr extra info Data type info: Data type: address of a MIL_INT64 Data type: address of a MIL_INT64 M_TYPE_MIL_UINT8 Casts the requested information to a MIL_UINT8. UserVarPtr extra info Data type info: Data type: address of a MIL_UINT8 Data type: address of a MIL_UINT8 Return value The returned value is the requested information, cast to a MIL_INT. If the requested information does not fit into a MIL_INT, this function will return M_NULL or truncate the information. Compilation information Header Include mil.h. Library Use mil.lib; mildmr.lib. DLL Requires mil.dll; mildmr.dll. Syntax Description Parameters - ContextDmrId - FontLabelOrIndex For specifying the font - CharIndex For specifying the index of a character - CharNamePtr For specifying the name of the character - InquireType - UserVarPtr Parameter Associations For inquiring about a global setting of a font + For inquiring the default value For inquiring about a font's characters + For determining the required array size (number of elements) to store the returned values + For inquiring the size of a string + For explicitly inquiring about Unicode character name information (can be useful when working in ASCII) + For inquiring if an inquire type is supported + For casting the requested information to the required data type Return value Compilation information ",
      "wordCount": 2434,
      "subEntries": []
    },
    {
      "id": "Reference_dmr_MdmrInquireStringModel",
      "version": null,
      "title": "MdmrInquireStringModel",
      "subTitles": null,
      "location": "MIL Reference",
      "pageURL": "content\\Reference\\dmr\\MdmrInquireStringModel.htm",
      "text": " MdmrInquireStringModel Synopsis Inquire about a global setting of a SureDotOCR string model, or inquire about a position (constraint) in a string model. Syntax MIL_INT MdmrInquireStringModel( MIL_ID&nbsp;ContextDmrId, //in MIL_INT64&nbsp;StringModelLabelOrIndex, //in MIL_INT64&nbsp;Position, //in MIL_INT64&nbsp;PermittedCharEntry, //in MIL_INT64&nbsp;InquireType, //in void&nbsp;*UserVarPtr //out ) Description This function inquires about a global setting of a SureDotOCR string model, or inquires about the different positions (constraints) in a string model. String models are defined with MdmrControlStringModel(). To inquire about the default constraints for the positions in the string model, call this function and pass M_DEFAULT to the Position parameter; to inquire about explicit constraints for a position, pass M_POSITION_IN_STRING(n) instead, where n is the explicitly constrained position. Note that constraints typically refer to the characters that are permitted to be read, according to a character type and font. If you want to loop through all explicitly constrained positions, you can set the Position parameter to M_POSITION_CONSTRAINED_ORDER(n), where n is the order in which the position was explicitly constrained. Note that the constrained order of a position changes if you reset previously constrained positions to be implicitly constrained, using MdmrControlStringModel() with M_RESET_POSITION_TO_IMPLICIT_CONSTRAINTS. If the inquired setting is set to M_DEFAULT (for example, in MdmrControlStringModel()), MdmrInquireStringModel() will return M_DEFAULT. To inquire the actual default value, add M_DEFAULT to the InquireType parameter. Parameters Parameters ContextDmrId Specifies the identifier of the SureDotOCR context that contains the string model about which to inquire. The context must have been previously allocated on the system using MdmrAlloc(). StringModelLabelOrIndex Specifies the string model about which to inquire. Set this parameter to one of the values below: For specifying the string model Value Description M_STRING_INDEX( MIL_INT IndexValue ) Specifies to inquire about the string model by indicating its index. Parameters IndexValue Specifies the index of the string model. 0 &lt;= Value &lt; M_NUMBER_OF_STRING_MODELS Specifies the index of the string model about which to inquire. M_STRING_LABEL( MIL_INT LabelValue ) Specifies to inquire about the string model by indicating its label. Parameters LabelValue Specifies the label of the string model. 0 &lt; Value &lt; 2097152 Specifies the label of the string model about which to inquire. Position Specifies how to inquire about the string model. Set this parameter to one of the values below: For specifying how to inquire about the string model Value Description M_DEFAULT Specifies to inquire about a global setting of a string model. M_POSITION_CONSTRAINED_ORDER( MIL_INT OrderValue ) Specifies to inquire about an explicitly constrained position in the string model by indicating the order in which the position was explicitly constrained. Parameters OrderValue Specifies the order in which the position was explicitly constrained. 0 &lt;= Value &lt;= 255 Specifies the order in which the position was explicitly constrained. For example, if you explicitly constrained positions 19, 5, and 24, their respective constrained order values are 0, 1, and 2. M_POSITION_IN_STRING( MIL_INT PositionValue ) Specifies to inquire about an explicitly constrained position in the string model by indicating its position. If you specify a position that is not explicitly constrained, you will get an error. To inquire about the default constraints for the positions in the string model, you must set this parameter to M_DEFAULT. Parameters PositionValue Specifies the explicitly constrained position. 0 &lt;= Value &lt;= 255 Specifies the explicitly constrained position about which to inquire. PermittedCharEntry Specifies the permitted character about which to inquire. SureDotOCR keeps track of each permitted character that you specify as an entry (MdmrControlStringModel() with M_ADD_PERMITTED_CHARS_ENTRY). The PermittedCharEntry parameter allows you to inquire about a specific entry. Set this parameter to one of the values below: For specifying the permitted character Value Description M_DEFAULT Specifies that this parameter is not required. Value &gt;= 0 Specifies the permitted character about which to inquire. InquireType Specifies the type of inquire to perform. See the Parameter associations section for possible values that can be specified. UserVarPtr Accepts the address of one of the following (see the Parameter associations section for specifics on which is expected): array of type MIL_TEXT_CHAR [optionally, in C++: a reference to a MIL_STRING] MIL_DOUBLE MIL_INT MIL_INT32 MIL_INT64 Specifies the address in which to write the requested information. Since the MdmrInquireStringModel() function also returns the requested information, you can set this parameter to M_NULL. See the Parameter associations section for possible values that can be returned. Parameter associations The tables below list possible values for the InquireType parameter and possible values returned to the UserVarPtr parameter. For inquiring about a global setting of a string model For inquiring about constraints for the different positions in the string model To inquire about a global setting of a string model, set the InquireType parameter to one of the values below. Unless otherwise specified, set the StringModelLabelOrIndex parameter to the label or index of a string model, set the Position parameter to M_DEFAULT, and set the PermittedCharEntry parameter to M_DEFAULT. For inquiring about a global setting of a string model InquireType Description UserVarPtr - Possible values returned M_CHAR_ACCEPTANCE Inquires the acceptance level for the score of the string's characters. UserVarPtr extra info Data type info: Data type: address of a MIL_DOUBLE Data type: address of a MIL_DOUBLE M_DEFAULT Specifies the default value; the default value is 50.0 %. 0.0 &lt;= Value &lt;= 100.0 Specifies the acceptance level for the character score, as a percentage. M_NUMBER_OF_CONSTRAINED_POSITIONS Inquires the number of explicitly constrained positions. These are set with MdmrControlStringModel(). UserVarPtr extra info Data type info: Data type: address of a MIL_DOUBLE MORE Data type: address of a MIL_DOUBLE Recommended casting type: MIL_INT Value &gt;= 0 Specifies the number of explicitly constrained positions. M_STRING_ACCEPTANCE Inquires the acceptance level for the string's score. UserVarPtr extra info Data type info: Data type: address of a MIL_DOUBLE Data type: address of a MIL_DOUBLE M_DEFAULT Specifies the default value; the default value is 50.0 %. 0.0 &lt;= Value &lt;= 100.0 Specifies the acceptance level for the string's score, as a percentage. M_STRING_CERTAINTY Inquires the certainty level for the string's score. UserVarPtr extra info Data type info: Data type: address of a MIL_DOUBLE Data type: address of a MIL_DOUBLE M_DEFAULT Specifies the default value; the default value is 70.0 %. 0.0 &lt;= Value &lt;= 100.0 Specifies the certainty level for the string score, as a percentage. M_STRING_INDEX_VALUE Inquires the index of the string model. Set the StringModelLabelOrIndex parameter to the string model's label. UserVarPtr extra info Data type info: Data type: address of a MIL_DOUBLE MORE Data type: address of a MIL_DOUBLE Recommended casting type: MIL_INT M_INVALID Specifies that the string model you are referring to does not exist in the context. Value &gt;= 0 Specifies the index. M_STRING_LABEL_VALUE Inquires the label of the string model. Set the StringModelLabelOrIndex parameter to the string model's index. UserVarPtr extra info Data type info: Data type: address of a MIL_DOUBLE MORE Data type: address of a MIL_DOUBLE Recommended casting type: MIL_INT Value &gt; 0 Specifies the label. M_STRING_RANK Inquires the order in which to read a string, relative to the other strings to read. UserVarPtr extra info Data type info: Data type: address of a MIL_DOUBLE MORE Data type: address of a MIL_DOUBLE Recommended casting type: MIL_INT M_DEFAULT Specifies the default value; the default value is 0. Value &gt;= 0 Specifies the order in which to read a string. M_STRING_SIZE_MAX Inquires the maximum number of characters in the string. UserVarPtr extra info Data type info: Data type: address of a MIL_DOUBLE MORE Data type: address of a MIL_DOUBLE Recommended casting type: MIL_INT M_DEFAULT Same as M_INVALID. M_INVALID Specifies an invalid maximum number of characters. Set the maximum number of characters to a valid value, using MdmrControlStringModel() with M_STRING_SIZE_MAX. 1 &lt;= Value &lt;= 256 Specifies the maximum number of characters. M_STRING_SIZE_MIN Inquires the minimum number of characters in the string. UserVarPtr extra info Data type info: Data type: address of a MIL_DOUBLE MORE Data type: address of a MIL_DOUBLE Recommended casting type: MIL_INT M_DEFAULT Specifies the default value; the default value is 1. 1 &lt;= Value &lt;= 256 Specifies the minimum number of characters. To inquire about constraints for the different positions in the string model, set the InquireType parameter to one of the values below. In this case, set the StringModelLabelOrIndex parameter to the label or index of a string model. To inquire about the default constraints for the positions in the string model, set the Position parameter to M_DEFAULT, unless otherwise specified. To inquire about explicit constraints for a position, set the Position parameter to the required position, unless otherwise specified. For inquiring about constraints for the different positions in the string model InquireType Description UserVarPtr - Possible values returned M_CHAR_LIST Inquires the names of the characters that can be read. This is returned as a regular string. It consists of all characters including the terminating null character. Characters can come from one or any font (M_FONT_LABEL_VALUE). M_CHAR_LIST is set as a permitted character constraint (M_ADD_PERMITTED_CHARS_ENTRY). There can be many permitted character constraint entries for a single character position. To specify which to inquire about, use the PermittedCharEntry parameter. UserVarPtr extra info Data type info: Data type: array of type MIL_TEXT_CHAR [optionally, in C++: MIL_STRING ] MORE Data type: array of type MIL_TEXT_CHAR [optionally, in C++: MIL_STRING ] Required array size: MdmrInquireStringModel ( M_CHAR_LIST + M_STRING_SIZE ) Note: When using C++, you can pass a reference to a MIL_STRING instead. In this case, the function will automatically determine the correct string size. CharName Specifies the character names. Retrieving an empty string (\"\") indicates that any character can be read. M_CONSTRAINED_ORDER Inquires the order in which the position was explicitly constrained. Set the Position parameter to M_POSITION_IN_STRING(). UserVarPtr extra info Data type info: Data type: address of a MIL_DOUBLE MORE Data type: address of a MIL_DOUBLE Recommended casting type: MIL_INT Value &gt;= 0 Specifies the constrained order. This value will be less than M_NUMBER_OF_CONSTRAINED_POSITIONS. M_FONT_LABEL_VALUE Inquires the label of the font from which the character to read must come. This is set as a permitted character constraint (M_ADD_PERMITTED_CHARS_ENTRY). There can be many such permitted character constraint entries (allowable fonts) for a single character position. To specify which to inquire about, use the PermittedCharEntry parameter. To inquire the corresponding font index, call MdmrInquireFont() with M_FONT_INDEX_VALUE and the label value returned by M_FONT_LABEL_VALUE. UserVarPtr extra info Data type info: Data type: address of a MIL_DOUBLE MORE Data type: address of a MIL_DOUBLE Recommended casting type: MIL_INT M_ANY Specifies that the character can come from any font in the context. Value &gt; 0 Specifies the label of the font. If SureDotOCR cannot return the requested information (no such font exists in the context), you will get an error. M_IS_OPTIONAL Inquires whether a position in a string model is optional. Optional positions can be skipped if their constraints cannot be met (up to a maximum of M_STRING_SIZE_MAX- M_STRING_SIZE_MIN skips). UserVarPtr extra info Data type info: Data type: address of a MIL_DOUBLE MORE Data type: address of a MIL_DOUBLE Recommended casting type: MIL_INT M_DEFAULT Same as M_FALSE. M_FALSE Specifies that the model position is not optional. M_TRUE Specifies that the model position is optional. M_NUMBER_OF_PERMITTED_CHARS_ENTRIES Inquires the number of permitted character entries. This is the number of permitted characters specified with M_ADD_PERMITTED_CHARS_ENTRY. Having no permitted character entries indicates you are reading any character from any font (initial default behavior). UserVarPtr extra info Data type info: Data type: address of a MIL_DOUBLE MORE Data type: address of a MIL_DOUBLE Recommended casting type: MIL_INT Value &gt;= 0 Specifies the number of permitted character entries. M_POSITION Inquires the position within the string model, corresponding to the order in which the position was explicitly constrained. Set the Position parameter to M_POSITION_CONSTRAINED_ORDER(). UserVarPtr extra info Data type info: Data type: address of a MIL_DOUBLE MORE Data type: address of a MIL_DOUBLE Recommended casting type: MIL_INT Value &gt;= 0 Specifies the position. M_TYPE Inquires the type of characters that can be read. This is set as a permitted character constraint (M_ADD_PERMITTED_CHARS_ENTRY). There can be many such allowable types of characters for a position. To specify the one about which to inquire, use the PermittedCharEntry parameter. If you are reading an explicitly defined list of characters, use M_CHAR_LIST to inquire the names of those characters. UserVarPtr extra info Data type info: Data type: address of a MIL_DOUBLE MORE Data type: address of a MIL_DOUBLE Recommended casting type: MIL_INT M_ANY Specifies to read all characters present in the font. M_CHAR_LIST Specifies to read an explicit list of characters. M_DIGITS Specifies to read characters '0' to '9'. M_LETTERS Specifies to read characters 'A' to 'Z' and 'a' to 'z'. M_LETTERS_LOWERCASE Specifies to read characters 'a' to 'z'. M_LETTERS_UPPERCASE Specifies to read characters 'A' to 'Z'. M_SPACE Specifies to read a space. Combination value for M_CHAR_LIST. You can add the following value to the above-mentioned value to get the size of a string. For inquiring about the size of a string InquireType combination value Description UserVarPtr - Possible values returned M_STRING_SIZE Inquires the number of characters in the string. This number accounts for every character, including the terminating null character. All strings have the terminating null character, even though you need not explicitly list it when specifying the string. UserVarPtr extra info Data type info: Data type: address of a MIL_DOUBLE MORE Data type: address of a MIL_DOUBLE Recommended casting type: MIL_INT Combination values for M_CHAR_LIST , M_STRING_SIZE. You can add one of the following values to the above-mentioned values to determine the UTF-16 (Unicode) character name information, which can be useful when working in an ASCII environment. If you are in an ASCII environment and you are inquiring about character names (for example, with M_CHAR_LIST) that are within the Basic Latin range, SureDotOCR does not consider the Unicode name, by default. For example, if SureDotOCR reads the character 'A', which is a Basic Latin character, and you use M_CHAR_LIST to get the name of that character, SureDotOCR returns 'A', even if you explicitly named it \"\\x0041\" in the font. To return information about the character's UTF-16 (Unicode) name (that is, \"\\x0041\"), use the combination value M_HEX_UTF16_FOR_ALL. If you are in an ASCII environment and you are inquiring about character names beyond the Basic Latin range, you can only retrieve information about the character name in hexadecimal format. For example, Basic Latin does not include the smiley face character; it is named in hexadecimal format (\"\\x263A\") in the font. Note that the string size information can change when these combination values are added. For example, in an ASCII environment, if the first four characters in the font are \"abc?\", using M_CHAR_LIST + M_HEX_UTF16_FOR_NON_BASIC_LATIN returns \"b\" for the character at index 1, and \"\\x263A\" for the character at index 3. Consequently, the string sizes are 2 and 7, respectively (inquired with M_CHAR_LIST + M_STRING_SIZE + M_HEX_UTF16_FOR_NON_BASIC_LATIN). If M_HEX_UTF16_FOR_ALL is specified, the preceding example returns \"\\x0062\" and \"\\x263A\" for the respective character names, and 7 for each string size. Recall that the null-terminating character is included in the string size. In a Unicode environment, the character representations are returned (for example, the smiley face), unless you explicitly specify a combination value (for example, to obtain \"\\x263A\" instead of the actual smiley face). For explicitly inquiring about Unicode character name information (can be useful when working in ASCII) Combination value Description M_HEX_UTF16_FOR_ALL Retrieves results with the name of all characters in hexadecimal 16-bit Unicode (UTF-16) format. M_HEX_UTF16_FOR_NON_BASIC_LATIN Retrieves results with the names of characters that fall out of the Basic Latin range, in hexadecimal 16-bit Unicode (UTF-16) format. Combination value for the values listed in For inquiring about a global setting of a string model, For inquiring about constraints for the different positions in the string model. (exceptions might exist) You can add the following value to the above-mentioned values to get the default value of an inquire type, regardless of the current value of the inquire type. For inquiring the default value InquireType Description UserVarPtr - Possible values returned M_DEFAULT Inquires the default value of the specified inquire type. UserVarPtr extra info Data type info: Data type: address of a MIL_DOUBLE Data type: address of a MIL_DOUBLE Combination values for the values listed in For inquiring about a global setting of a string model, For inquiring about constraints for the different positions in the string model. You can add one of the following values to the above-mentioned values to determine whether an inquire type is supported for the font currently being inquired. For inquiring if an inquire type is supported InquireType Description UserVarPtr - Possible values returned M_HAS_DEFAULT Inquires whether the specified inquire type has a default value. UserVarPtr extra info Data type info: Data type: address of a MIL_DOUBLE Data type: address of a MIL_DOUBLE M_FALSE Specifies that the inquire type does not have a default value. M_TRUE Specifies that the inquire type has a default value. M_SUPPORTED Inquires whether the specified inquire type is supported. UserVarPtr extra info Data type info: Data type: address of a MIL_DOUBLE MORE Data type: address of a MIL_DOUBLE Recommended casting type: MIL_INT M_FALSE Specifies that the inquire type is not supported. M_TRUE Specifies that the inquire type is supported. Combination values for the values listed in For inquiring about a global setting of a string model; and for the following values: M_CONSTRAINED_ORDER , M_FONT_LABEL_VALUE , M_IS_OPTIONAL , M_NUMBER_OF_PERMITTED_CHARS_ENTRIES , M_POSITION , M_TYPE , M_STRING_SIZE. You can add one of the following values to the above-mentioned values to cast the requested information to the required data type. For casting information to the required data type. InquireType Description UserVarPtr - Possible values returned M_TYPE_MIL_DOUBLE Casts the requested information to a MIL_DOUBLE. UserVarPtr extra info Data type info: Data type: address of a MIL_DOUBLE Data type: address of a MIL_DOUBLE M_TYPE_MIL_INT Casts the requested information to a MIL_INT. UserVarPtr extra info Data type info: Data type: address of a MIL_INT Data type: address of a MIL_INT M_TYPE_MIL_INT32 Casts the requested information to a MIL_INT32. UserVarPtr extra info Data type info: Data type: address of a MIL_INT32 Data type: address of a MIL_INT32 M_TYPE_MIL_INT64 Casts the requested information to a MIL_INT64. UserVarPtr extra info Data type info: Data type: address of a MIL_INT64 Data type: address of a MIL_INT64 Return value The returned value is the requested information, cast to a MIL_INT. If the requested information does not fit into a MIL_INT, this function will return M_NULL or truncate the information. Compilation information Header Include mil.h. Library Use mil.lib; mildmr.lib. DLL Requires mil.dll; mildmr.dll. Syntax Description Parameters - ContextDmrId - StringModelLabelOrIndex For specifying the string model - Position For specifying how to inquire about the string model - PermittedCharEntry For specifying the permitted character - InquireType - UserVarPtr Parameter Associations For inquiring about a global setting of a string model For inquiring about constraints for the different positions in the string model + For inquiring about the size of a string + For explicitly inquiring about Unicode character name information (can be useful when working in ASCII) + For inquiring the default value + For inquiring if an inquire type is supported + For casting information to the required data type. Return value Compilation information ",
      "wordCount": 3158,
      "subEntries": []
    },
    {
      "id": "Reference_dmr_MdmrName",
      "version": null,
      "title": "MdmrName",
      "subTitles": null,
      "location": "MIL Reference",
      "pageURL": "content\\Reference\\dmr\\MdmrName.htm",
      "text": " MdmrName Synopsis Perform name operations for fonts and string models. Syntax void MdmrName( MIL_ID&nbsp;ContextDmrId, //in MIL_INT64&nbsp;Operation, //in MIL_INT64&nbsp;LabelOrIndex, //in MIL_TEXT_PTR&nbsp;Name, //in-out MIL_INT&nbsp;*ValuePtr, //out MIL_INT64&nbsp;ControlFlag //in ) Description This function allows you to perform name operations for fonts and string models in a SureDotOCR context. Use this function to set the name of a font or string model, release the name of a font or string model, or retrieve either the label or index of a font or string model based on its name. These operations allow you to more easily manage your data; they do not impact how strings are processed and read. Parameters Parameters ContextDmrId Specifies the identifier of the SureDotOCR context containing the font or string model with which to perform the name operation. The context must have been previously allocated on the system using MdmrAlloc(). Operation Specifies the name operation to perform. Set this parameter to one of the values below. Unless otherwise specified, the LabelOrIndex parameter can specify a font or string model, the Name parameter must specify the name information related to the operation, and the ValuePtr parameter must specify the address at which to write the information requested by the name operation. For specifying the name operation Value Description M_GET_FONT_INDEX Retrieves the index of the font, based on the specified name. Set the LabelOrIndex parameter to M_DEFAULT. M_GET_FONT_LABEL Retrieves the label of the font, based on the specified name. Set the LabelOrIndex parameter to M_DEFAULT. M_GET_NAME Retrieves the name, and name length, of the specified font or string model. Use the Name parameter to retrieve the name. Use the ValuePtr parameter to retrieve the length of the name. M_GET_STRING_INDEX Retrieves the index of the string model, based on the specified name. Set the LabelOrIndex parameter to M_DEFAULT. M_GET_STRING_LABEL Retrieves the label of the string model, based on the specified name. Set the LabelOrIndex parameter to M_DEFAULT. M_SET_NAME Sets the name of the font or string model, or releases the name of the font or string model. When setting a name, ensure it is not already used. All font names must be unique among font names and all string model names must be unique among string model names. When releasing a name, set the Name parameter to M_NULL. Once released, you can use the name again. LabelOrIndex Specifies the label or index value of the font or string model with which to perform the name operation. Set this parameter to M_DEFAULT when not required by the name operation. For specifying the label or index value Value Description M_FONT_INDEX( MIL_INT IndexValue ) Specifies a font by indicating its index. Parameters IndexValue Set this parameter to the following: 0 &lt;= Value &lt; M_NUMBER_OF_FONTS Specifies the index of the font. M_FONT_LABEL( MIL_INT LabelValue ) Specifies a font by indicating its label. Parameters LabelValue Set this parameter to the following: Value &gt; 0 Specifies the label of the font. M_STRING_INDEX( MIL_INT IndexValue ) Specifies a string model by indicating its index. Parameters IndexValue Set this parameter to the following: 0 &lt;= Value &lt; M_NUMBER_OF_STRING_MODELS Specifies the index of the string model. M_STRING_LABEL( MIL_INT LabelValue ) Specifies a string model by indicating its label. Parameters LabelValue Set this parameter to the following: Value &gt; 0 Specifies the label of the string model. Name Specifies the name. Use this parameter to set, get, or release the name, depending on the name operation. If the operation is getting a label and it fails, SureDotOCR returns 0. If the operation is getting an index and it fails, SureDotOCR returns -1. To release the name of a font or string model, set this parameter to M_NULL and specify M_SET_NAME. To determine the length of the current name of the font or string model, set this parameter to M_NULL and specify M_GET_NAME. ValuePtr Specifies the address at which to write the information requested by the name operation. Set this parameter to M_NULL when not required by the name operation. ControlFlag Reserved for future expansion and must be set to M_DEFAULT. Compilation information Header Include mil.h. Library Use mil.lib; mildmr.lib. DLL Requires mil.dll; mildmr.dll. Syntax Description Parameters - ContextDmrId - Operation For specifying the name operation - LabelOrIndex For specifying the label or index value - Name - ValuePtr - ControlFlag Compilation information ",
      "wordCount": 709,
      "subEntries": []
    },
    {
      "id": "Reference_dmr_MdmrPreprocess",
      "version": null,
      "title": "MdmrPreprocess",
      "subTitles": null,
      "location": "MIL Reference",
      "pageURL": "content\\Reference\\dmr\\MdmrPreprocess.htm",
      "text": " MdmrPreprocess Synopsis Preprocess a SureDotOCR context. Syntax void MdmrPreprocess( MIL_ID&nbsp;ContextDmrId, //in MIL_INT64&nbsp;ControlFlag //in ) Description This function prepares a SureDotOCR context for a read operation. This allows SureDotOCR to make internal refinements so it can execute optimized and robust dot-matrix character recognition processes. You must call this function before the first call to MdmrRead(). To preprocess a context without error, it must contain at least one font, one character, and one string model. Changes to a context or to any of its content often require you to preprocess the context again. To inquire a context's preprocessing state, call MdmrInquire() with M_PREPROCESSED. Saving a context does not save preprocessing changes. Upon restoration, you must preprocess the context again. Parameters Parameters ContextDmrId Specifies the identifier of the SureDotOCR context to preprocess. The context must have been previously allocated on the system using MdmrAlloc(). ControlFlag Specifies whether to preprocess the SureDotOCR context. Set this parameter to one of the values below: For specifying whether to preprocess the context Value Description M_DEFAULT Preprocesses the context. M_RESET Un-preprocesses the context. Un-preprocessing the context can be useful if you want to conserve system memory within an application and preserve context settings. Compilation information Header Include mil.h. Library Use mil.lib; mildmr.lib. DLL Requires mil.dll; mildmr.dll. Syntax Description Parameters - ContextDmrId - ControlFlag For specifying whether to preprocess the context Compilation information ",
      "wordCount": 226,
      "subEntries": []
    },
    {
      "id": "Reference_dmr_MdmrRead",
      "version": null,
      "title": "MdmrRead",
      "subTitles": null,
      "location": "MIL Reference",
      "pageURL": "content\\Reference\\dmr\\MdmrRead.htm",
      "text": " MdmrRead Synopsis Read dot-matrix strings from a target image. Syntax void MdmrRead( MIL_ID&nbsp;ContextDmrId, //in MIL_ID&nbsp;TargetImageBufId, //in MIL_ID&nbsp;ResultDmrId, //in MIL_INT64&nbsp;ControlFlag //in ) Description This function uses a SureDotOCR context to read one or more dot-matrix strings from a target image. Results are stored in a SureDotOCR result buffer. To get the results, use MdmrGetResult(). Requirements for reading strings depend on the settings of the context, and the font and string models therein. To control these settings, use MdmrControl(), MdmrControlFont(), and MdmrControlStringModel(). MdmrRead() takes into account all settings. Before performing a read operation, there must be at least one font, one character, and one string model in the context; it must also be in a preprocessed state (MdmrPreprocess()). To read a string, it must not only meet the context's requirements, but it must also follow the basic rules of a string. It must, for example, be a linear sequence of characters. Strings are read in the natural Latin-based reading order; that is, from left to right, and from top to bottom (with respect to the angle of the target). A string's position is the position of the center of the bounding box of its first character. You can limit the read operation to a region of the target image buffer, using a rectangular ROI set with MbufSetRegion(). If the target image is not calibrated, results are calculated in the pixel coordinate system (pixel units). If the target image is calibrated, results are calculated in the world coordinate system (real-world units), but you can retrieve them in either world or pixel units. To specify this, call MdmrControl() with M_RESULT_OUTPUT_UNITS. In the presence of distortion, some results are meaningless when converted from real-world to pixel units (such as angle and scale). For example, if a string appears warped in the target image, but the camera calibration context compensates for this, the resulting angle is meaningful in the real-world coordinate system, and meaningless in the pixel coordinate system. If complex distortions exist, correct the image before using it with SureDotOCR. The read operation can occasionally take an unexpectedly long time to calculate. Use MdmrControl() with M_TIMEOUT to set a maximum read time. Parameters Parameters ContextDmrId Specifies the identifier of the SureDotOCR context to use for the read operation. The context must have been previously allocated on the required system using MdmrAlloc(), and preprocessed using MdmrPreprocess(). TargetImageBufId Specifies the identifier of the target image buffer which contains the dot-matrix strings to read. The target image buffer must be a 1-band, 8-bit unsigned buffer. Its maximum size is 65536x65536 pixels. This image buffer can only have a rectangular region of interest (ROI) defined using MbufSetRegion() (with or without rotation). In addition, the region must be defined in vector format from a 2D graphics list (M_VECTOR or M_VECTOR_AND_RASTER). An error will be generated if the ROI is only in raster format (M_RASTER) or a non-rectangular shape. ResultDmrId Specifies the identifier of the SureDotOCR result buffer in which to write the results of the read operation. The SureDotOCR result buffer must have been previously allocated on the required system using MdmrAllocResult(). ControlFlag Reserved for future expansion and must be set to M_DEFAULT. Compilation information Header Include mil.h. Library Use mil.lib; mildmr.lib. DLL Requires mil.dll; mildmr.dll. Syntax Description Parameters - ContextDmrId - TargetImageBufId - ResultDmrId - ControlFlag Compilation information ",
      "wordCount": 551,
      "subEntries": []
    },
    {
      "id": "Reference_dmr_MdmrRestore",
      "version": null,
      "title": "MdmrRestore",
      "subTitles": null,
      "location": "MIL Reference",
      "pageURL": "content\\Reference\\dmr\\MdmrRestore.htm",
      "text": " MdmrRestore Synopsis Restore a SureDotOCR context from disk. Syntax MIL_ID MdmrRestore( MIL_CONST_TEXT_PTR&nbsp;FileName, //in MIL_ID&nbsp;SysId, //in MIL_INT64&nbsp;ControlFlag, //in MIL_ID&nbsp;*ContextDmrIdPtr //out ) Description This function restores a SureDotOCR context that was previously saved to a file, using MdmrSave() or MdmrStream(). This function restores all of the context's settings (including font and string model settings) that were in effect when the context was saved. A restored context is not preprocessed; therefore, you must call MdmrPreprocess() before performing a read with MdmrRead(). When the restored SureDotOCR context is no longer required, release it using MdmrFree() unless M_UNIQUE_ID was specified during allocation; if M_UNIQUE_ID was specified, the smart identifier manages the restored SureDotOCR context's lifetime and you must not manually free it. Parameters Parameters FileName Specifies the name and path of the file from which to restore the SureDotOCR context. The function handles (internally) the opening and closing of the file. For easier use with other Matrox Imaging software products, files for SureDotOCR contexts should use the MDMR file extension. Predefined SureDotOCR context files are typically distributed with MIL and can be found in a local folder (for example, \"C:\\Program Files\\Matrox Imaging\\contexts\\\"). Set this parameter to one of the values below: For specifying the file name and path Value Description M_INTERACTIVE [This is only applicable to Windows] Opens a dialog box from which you can interactively specify the drive, directory, and name of the file. MIL_TEXT(\"FileName\") 1 Specifies the drive, directory, and name of the SureDotOCR context file (for example, \"C:\\mydirectory\\MyContext.mdmr\"). Typically, SureDotOCR context files have an MDMR extension. To specify a context file on a remote computer (under Distributed MIL), prefix the specified file name string with \"remote:///\" (for example, \"remote:///C:\\mydirectory\\MyContext.mdmr\"). 1 If you are passing the value in a variable, don't enclose it in MIL_TEXT(). SysId Specifies the identifier of the system on which to restore the SureDotOCR context. Set this parameter to one of the values below: For specifying the system identifier Value Description M_DEFAULT_HOST Specifies the default Host system of the current MIL application. MIL system identifier Specifies a valid system identifier, previously allocated using MsysAlloc(). ControlFlag Reserved for future expansion and must be set to M_DEFAULT. ContextDmrIdPtr Specifies the address of the variable in which to write the SureDotOCR context identifier or specifies the data type that the function should use to return the SureDotOCR context identifier. For retrieving the identifier or specifying how to return it Value Description M_NULL Specifies that you will use this function's return value to obtain the identifier of the allocated SureDotOCR context ; in this case, a standard MIL identifier of type MIL_ID is returned. M_UNIQUE_ID Specifies that you will use this function's return value to obtain the identifier of the allocated SureDotOCR context ; in this case, a MIL smart identifier of type MIL_UNIQUE_DMR_ID is returned instead of a standard MIL identifier. This setting is only available when using C++11 (or later). A MIL smart identifier manages the lifespan of the MIL object it owns (similar to a std::unique_ptr). Note, you can use a MIL smart identifier as though it were a standard MIL identifier, except that you cannot use it to manually free the SureDotOCR context (it is freed automatically). For more information, see the MIL smart identifiers subsection of the MIL custom data types, void pointers, extensions, and portability functions section of Chapter 2: Building an application. Address in which to write the identifier Specifies the address of a MIL_ID in which to write the identifier of the allocated SureDot OCR context. If restoration fails, M_NULL is written as the identifier. Return value The returned value is the SureDotOCR context identifier either as a standard identifier (MIL_ID) or a smart identifier (MIL_UNIQUE_DMR_ID). If allocation fails, M_NULL is returned (or nullptr if M_UNIQUE_ID was specified). Compilation information Header Include mil.h. Library Use mil.lib; mildmr.lib. DLL Requires mil.dll; mildmr.dll. Syntax Description Parameters - FileName For specifying the file name and path - SysId For specifying the system identifier - ControlFlag - ContextDmrIdPtr For retrieving the identifier or specifying how to return it Return value Compilation information ",
      "wordCount": 675,
      "subEntries": []
    },
    {
      "id": "Reference_dmr_MdmrSave",
      "version": null,
      "title": "MdmrSave",
      "subTitles": null,
      "location": "MIL Reference",
      "pageURL": "content\\Reference\\dmr\\MdmrSave.htm",
      "text": " MdmrSave Synopsis Save a SureDotOCR context to a file. Syntax void MdmrSave( MIL_CONST_TEXT_PTR&nbsp;FileName, //in MIL_ID&nbsp;ContextDmrId, //in MIL_INT64&nbsp;ControlFlag //in ) Description This function saves all the information about the previously allocated SureDotOCR context to disk, including all of the individual font and string model settings. This information can be reloaded, using MdmrRestore() or MdmrStream(). When you save the context, the preprocessing changes are not saved. Upon restoration, you must preprocess the context again. Parameters Parameters FileName Specifies the name and path of the file in which to save the SureDotOCR context. The function internally handles the opening and closing of this file. For easier use with other Matrox Imaging software products, files for SureDotOCR contexts should use the MDMR file extension. Predefined SureDotOCR context files are typically distributed with MIL and can be found in a local folder (for example, \"C:\\Program Files\\Matrox Imaging\\contexts\\\"). If you specify a file that already exists, it will be overwritten. Set this parameter to one of the values below: For specifying the file name and path Value Description M_INTERACTIVE [This is only applicable to Windows] Opens a dialog box from which you can interactively specify the drive, directory, and name of the file. MIL_TEXT(\"FileName\") 1 Specifies the drive, directory, and name of the SureDotOCR context file (for example, \"C:\\mydirectory\\MyContext.mdmr\"). Typically, SureDotOCR context files have an MDMR extension. To specify a context file on a remote computer (under Distributed MIL), prefix the specified file name string with \"remote:///\" (for example, \"remote:///C:\\mydirectory\\MyContext.mdmr\"). 1 If you are passing the value in a variable, don't enclose it in MIL_TEXT(). ContextDmrId Specifies the identifier of the SureDotOCR context to save. ControlFlag Reserved for future expansion and must be set to M_DEFAULT. Compilation information Header Include mil.h. Library Use mil.lib; mildmr.lib. DLL Requires mil.dll; mildmr.dll. Syntax Description Parameters - FileName For specifying the file name and path - ContextDmrId - ControlFlag Compilation information ",
      "wordCount": 313,
      "subEntries": []
    },
    {
      "id": "Reference_dmr_MdmrStream",
      "version": null,
      "title": "MdmrStream",
      "subTitles": null,
      "location": "MIL Reference",
      "pageURL": "content\\Reference\\dmr\\MdmrStream.htm",
      "text": " MdmrStream Synopsis Load, restore, or save a SureDotOCR context from/to a file or a memory stream. Syntax void MdmrStream( MIL_TEXT_PTR&nbsp;MemPtrOrFileName, //in-out MIL_ID&nbsp;SysId, //in MIL_INT64&nbsp;Operation, //in MIL_INT64&nbsp;StreamType, //in MIL_DOUBLE&nbsp;Version, //in MIL_INT64&nbsp;ControlFlag, //in MIL_ID&nbsp;*ContextDmrIdPtr, //in-out MIL_INT&nbsp;*SizeByteVarPtr //out ) Description This function can load or restore a SureDotOCR context from a file or memory stream. All of the context settings that were in effect when the context was saved will be restored. A loaded or restored context is not preprocessed. You must call MdmrPreprocess() before performing a read with MdmrRead(). This function can also save a SureDotOCR context to a file or memory stream. All information about the previously allocated context is saved, including all of the individual font and string model settings. Preprocessing changes are not saved. To inquire the number of bytes necessary to save a SureDotOCR context to memory stream, first call MdmrStream() with M_INQUIRE_SIZE_BYTE. The content saved to memory stream is equivalent to the content saved to file. In addition, any file saved using this function is equivalent to a file saved with MdmrSave(). You can use this and other MIL stream functions, for example, to save all required MIL objects, as well as any other custom data, for your application to a memory stream. Once in a memory stream, you can write the stream to a single file or transfer it over a network. You are responsible for concatenating the streams and for saving the stream to file. Parameters Parameters MemPtrOrFileName Accepts the address of one of the following (see the Parameter associations section for specifics on which is expected): MIL_TEXT_PTR [optionally, in C++: a reference to a MIL_STRING] Optionally, in C++: a reference to a std::vector of type MIL_UINT8 Specifies the file or memory stream. See the Parameter associations section for possible values that can be returned/specified. SysId Specifies the identifier of the system on which to restore the SureDotOCR context. See the Parameter associations section for possible values that can be specified. Operation Specifies the operation to perform on the SureDotOCR context. See the Parameter associations section for possible values that can be specified. StreamType Specifies the type of stream in which to store/from which to restore the SureDotOCR context. Set this parameter to one of the values below: For specifying the type of stream Value Description M_FILE Specifies a file stream. M_MEMORY Specifies a memory stream. You are responsible for allocating a block of memory for the stream. Version Specifies the MIL version of the SureDotOCR context. See the Parameter associations section for possible values that can be specified. ControlFlag Reserved for future expansion and must be set to M_DEFAULT. ContextDmrIdPtr Specifies the address of the variable in which to write or from which to read the identifier of the SureDotOCR context. See the Parameter associations section for possible values that can be returned/specified. SizeByteVarPtr Specifies the address of the variable in which to write the size of the SureDotOCR context, in bytes. If size is not required, set this parameter to M_NULL. The size of the context varies depending on the MIL version specified. Parameter associations The table below lists possible values for the MemPtrOrFileName, SysId, Operation, Version, and ContextDmrIdPtr parameters. For performing the stream operation. For performing the stream operation. Operation Description MemPtrOrFileName - Possible values passed or returned SysId Version ContextDmrIdPtr - Possible values passed or returned M_INQUIRE_SIZE_BYTE Inquires the number of bytes required to save a SureDotOCR context to memory stream. This operation is not supported when the StreamType parameter is set to M_FILE. MemPtrOrFileName This parameter must be set to M_NULL. SysId This parameter must be set to M_NULL. Version Specifies the MIL version with which the SureDotOCR context must be compatible when saved. The size of a context might differ from one MIL version to another. M_DEFAULT Specifies the current version of MIL. M_PROC_VERSION_100_PP2 Specifies the version as being MIL 10.0 Processing Pack 2. M_PROC_VERSION_100_PP3 Specifies the version as being MIL 10.0 Processing Pack 3. M_PROC_VERSION_100_SP4 Specifies the version as being MIL 10.0 Service Pack 4. M_PROC_VERSION_100_SP5 Specifies the version as being MIL 10.0 Service Pack 5. M_PROC_VERSION_100_SP6 Specifies the version as being MIL 10.0 Service Pack 6. M_PROC_VERSION_100_SP7 Specifies the version as being MIL 10.0 Service Pack 7. ContextDmrIdPtr Specifies the address of the variable containing the identifier of the SureDotOCR context. M_LOAD Loads the content of a specified file or memory stream into a previously allocated SureDotOCR context. MemPtrOrFileName Specifies the file or memory stream from which to load the context. M_INTERACTIVE [This is only applicable to Windows] Opens a dialog box from which you can interactively specify the drive, directory, and name of the context file, when the StreamType parameter is set to M_FILE. MIL_TEXT(\"FileName\") 1 Specifies the drive, directory, and name of the context file (for example, \"C:\\mydirectory\\MyContext.mdmr\"), when the StreamType parameter is set to M_FILE. SureDotOCR contexts typically have an MDMR file extension. The function handles (internally) the opening and closing of the file. Predefined SureDotOCR context files are typically distributed with MIL and can be found in a local folder (for example, \"C:\\Program Files\\Matrox Imaging\\contexts\\\"). To specify a context file on a remote computer (under Distributed MIL), prefix the specified file name string with \"remote:///\" (for example, \"remote:///C:\\mydirectory\\MyContext.mdmr\"). MemPtr Specifies the address of the block of memory, when the StreamType parameter is set to M_MEMORY. The block of memory should be of type MIL_UINT8. The specified address must correspond to the first memory address in which the object is located, and the block of memory must contain the entire object. Note that when using a C compiler (not a C++ or other compiler), you must cast the MIL_UINT8 pointer to a MIL_TEXT_PTR. SysId This parameter must be set to M_NULL. Version This parameter must be set to M_DEFAULT. ContextDmrIdPtr Specifies the address of the variable containing the identifier of the SureDotOCR context. All previous settings are overwritten with those of the loaded context, or are set to the default value if the settings didn't exist in the version of MIL from which the context is being loaded. M_RESTORE Restores a SureDotOCR context from a file or memory stream and assigns it a MIL identifier. MemPtrOrFileName Specifies the file or memory stream from which to restore the context. M_INTERACTIVE [This is only applicable to Windows] Opens a dialog box from which you can interactively specify the drive, directory, and name of the context file, when the StreamType parameter is set to M_FILE. MIL_TEXT(\"FileName\") 1 Specifies the drive, directory, and name of the context file (for example, \"C:\\mydirectory\\MyContext.mdmr\"), when the StreamType parameter is set to M_FILE. SureDotOCR contexts typically have an MDMR file extension. The function handles (internally) the opening and closing of the file. Predefined SureDotOCR context files are typically distributed with MIL and can be found in a local folder (for example, \"C:\\Program Files\\Matrox Imaging\\contexts\\\"). To specify a context file on a remote computer (under Distributed MIL), prefix the specified file name string with \"remote:///\" (for example, \"remote:///C:\\mydirectory\\MyContext.mdmr\"). MemPtr Specifies the address of the block of memory, when the StreamType parameter is set to M_MEMORY. The block of memory should be of type MIL_UINT8. The specified address must correspond to the first memory address in which the object is located, and the block of memory must contain the entire object. Note that when using a C compiler (not a C++ or other compiler), you must cast the MIL_UINT8 pointer to a MIL_TEXT_PTR. SysId Specifies the system on which to allocate the SureDotOCR context. M_DEFAULT_HOST Specifies the default Host system of the current MIL application. MIL system identifier Specifies a valid system identifier, previously allocated using MsysAlloc(). Version This parameter must be set to M_DEFAULT. ContextDmrIdPtr Specifies the address of the variable in which to write the identifier of the SureDotOCR context. If the operation is not successful, M_NULL is returned. M_SAVE Saves a SureDotOCR context to a specified file or memory stream. MemPtrOrFileName Specifies the file or memory stream. M_INTERACTIVE [This is only applicable to Windows] Opens a dialog box from which you can interactively specify the drive, directory, and name of the context file, when the StreamType parameter is set to M_FILE. MIL_TEXT(\"FileName\") 1 Specifies the drive, directory, and name of the context file (for example, \"C:\\mydirectory\\MyContext.mdmr\"), when the StreamType parameter is set to M_FILE. SureDotOCR contexts typically have an MDMR file extension. The function handles (internally) the opening and closing of the file. If the file already exists, it will be overwritten. Predefined SureDotOCR context files are typically distributed with MIL and can be found in a local folder (for example, \"C:\\Program Files\\Matrox Imaging\\contexts\\\"). To specify a context file on a remote computer (under Distributed MIL), prefix the specified file name string with \"remote:///\" (for example, \"remote:///C:\\mydirectory\\MyContext.mdmr\"). MemPtr Specifies the address of the block of memory, when the StreamType parameter is set to M_MEMORY. The block of memory should be of type MIL_UINT8. The specified address must correspond to the first memory address in which to write, and the block of memory must be large enough to stream the entire object. To determine the required size, call this function with M_INQUIRE_SIZE_BYTE. Note that when using a C compiler (not a C++ or other compiler), you must cast the MIL_UINT8 pointer to a MIL_TEXT_PTR. SysId This parameter must be set to M_NULL. Version Specifies the MIL version with which the SureDotOCR context must be compatible when saved. M_DEFAULT Specifies the current version of MIL. M_PROC_VERSION_100_PP2 Specifies the version as being MIL 10.0 Processing Pack 2. M_PROC_VERSION_100_PP3 Specifies the version as being MIL 10.0 Processing Pack 3. M_PROC_VERSION_100_SP4 Specifies the version as being MIL 10.0 Service Pack 4. M_PROC_VERSION_100_SP5 Specifies the version as being MIL 10.0 Service Pack 5. M_PROC_VERSION_100_SP6 Specifies the version as being MIL 10.0 Service Pack 6. M_PROC_VERSION_100_SP7 Specifies the version as being MIL 10.0 Service Pack 7. ContextDmrIdPtr Specifies the address of the variable containing the identifier of the SureDotOCR context to save. 1 If you are passing the value in a variable, don't enclose it in MIL_TEXT(). Compilation information Header Include mil.h. Library Use mil.lib; mildmr.lib. DLL Requires mil.dll; mildmr.dll. Syntax Description Parameters - MemPtrOrFileName - SysId - Operation - StreamType For specifying the type of stream - Version - ControlFlag - ContextDmrIdPtr - SizeByteVarPtr Parameter Associations For performing the stream operation. Compilation information ",
      "wordCount": 1708,
      "subEntries": []
    }
  ]
}]