[{
  "id": "Reference_disp",
  "version": "2024020714",
  "title": "disp",
  "subTitles": null,
  "location": "MIL Reference",
  "pageURL": "content\\Reference\\disp\\ModuleInformation.htm",
  "text": " Mdisp functions Synopsis The functions prefixed with Mdisp make up the Display module. The Display module allows you to display images and manipulate their display. The Display module offers many display effects, such as annotation, LUTs, and panning and zooming. Functions MdispAlloc MdispControl MdispFree MdispGetHookInfo MdispHookFunction MdispInquire MdispLut MdispPan MdispSelect MdispSelectWindow MdispZoom ",
  "wordCount": 54,
  "subEntries": [
    {
      "id": "Reference_disp_MdispAlloc",
      "version": null,
      "title": "MdispAlloc",
      "subTitles": null,
      "location": "MIL Reference",
      "pageURL": "content\\Reference\\disp\\MdispAlloc.htm",
      "text": " MdispAlloc Synopsis Allocate a display. Syntax MIL_ID MdispAlloc( MIL_ID&nbsp;SystemId, //in MIL_INT&nbsp;DispNum, //in MIL_CONST_TEXT_PTR&nbsp;DispFormat, //in MIL_INT64&nbsp;InitFlag, //in MIL_ID&nbsp;*DisplayIdPtr //out ) Description This function allocates a display on the specified system so that it can be used by subsequent MIL display functions. Use MdispSelect() to select the image buffer to display. Note that the buffer and the display should be allocated on the same system. In general, the display is presented on the computer running the main MIL application. However, if you are developing a Distributed MIL application or a MILweb server application, you can allocate a display to be shown on a remote computer. If you are developing a Distributed MIL controlling application and you allocate a display on a DMIL remote system, you can select image buffers allocated on that DMIL remote system to the display. By default, these buffers are displayed on the master computer. However, to display the buffers on the remote computer, combine M_EXCLUSIVE or M_WINDOWED with M_REMOTE_DISPLAY when allocating the display. This type of display is referred to as a remote display. If you are developing a MIL application that also acts as a MILweb server, you can allocate a display that can be presented in one or more instances of a MILweb client application (for example, running in a compatible web browser). To do so, use M_WEB when allocating the display. This type of display is referred to as a MILweb display. After allocating the display, you should check if the operation was successful, using MappGetError() or by verifying that the display identifier returned is not M_NULL (or nullptr if M_UNIQUE_ID was specified). When the display is no longer required, release it using MdispFree() unless M_UNIQUE_ID was specified during allocation; if M_UNIQUE_ID was specified, the smart identifier manages the display's lifetime and you must not manually free it. Parameters Parameters SystemId Specifies the system on which to allocate the display. This parameter should be set to one of the following values: For specifying the system Value Description M_DEFAULT_HOST Specifies the default Host system of the current MIL application. MIL system identifier Specifies a valid system identifier, previously allocated using MsysAlloc(). DispNum Specifies the device to use for image display. For a non-exclusive display, or for an exclusive display that you want MIL to choose the display device, set this parameter to the following value: For specifying the display device Value Description M_DEFAULT Specifies that MIL will use the most appropriate device for display purposes. If your imaging board has a display section, and it is available, MIL will typically use it for display purposes. For an exclusive display for which you want to specify the position of the display device in screen arrangements of up to 3x3 screens, this parameter can be set to a combination of the following values. For specifying the position of the device to use for an exclusive display Value Description M_BOTTOM Specifies to use the bottom-most device for an exclusive display. Note that this option cannot be combined with M_TOP. M_CENTER Specifies to use the center device for an exclusive display. M_LEFT Specifies to use the left-most device for an exclusive display. Note that this option cannot be combined with M_RIGHT. M_RIGHT Specifies to use the right-most device for an exclusive display. Note that this option cannot be combined with M_LEFT. M_TOP Specifies to use the top-most device for an exclusive display. Note that this option cannot be combined with M_BOTTOM. DispFormat Specifies the format of the display. For windowed displays, this parameter has no effect and should be set to \"M_DEFAULT\". For exclusive displays, this parameter specifies the screen resolution. For any type of display, this parameter can be set to the following value: For specifying the default display format Value Description MIL_TEXT(\"M_DEFAULT\") 1 Specifies the default display format. For windowed displays, this is the only supported setting. For exclusive displays, this specifies the default video configuration format (VCF), which can be set during installation and later modified using the MILConfig utility (Defaults tab). 1 If you are passing the value in a variable, don't enclose it in MIL_TEXT(). For exclusive displays, the DispFormat parameter can be set to the following: For exclusive displays Value Description M_CURRENT_RESOLUTION Specifies to use the current resolution of the screen. This option is only available for a M_EXCLUSIVE display. MIL_TEXT(\"vcf-file-name.vcf\") 1 Specifies the name of the video configuration format (VCF) that defines the resolution and refresh rate to use. The file typically has a VCF extension. The drive, directory, and name of the file must be specified, for example: \"C:\\mydirectory\\myfile\". For a file on the remote computer (under Distributed MIL), the path and file name must be preceded by \"remote:///\" (for example, \"remote:///C:\\mydirectory\\myfile\"). The file name string can be specified in, for example, the \"1024x768x32@60hz.vcf\" format. For the current list of video configuration format (VCF) files, see the MATROX IMAGING\\DRIVERS\\HOST\\VCF folder. 1 If you are passing the value in a variable, don't enclose it in MIL_TEXT(). InitFlag Specifies your display's type. This parameter can be set to one of the following: For specifying the display type Value Description M_DEFAULT Specifies the default display type, which can be set using the MILConfig utility. Typically, the default display type is M_WINDOWED. M_EXCLUSIVE Specifies to present the image buffer selected for display full-screen, without a windowed border, in one of Windows desktop screens. The image buffer is presented at the center of the screen. To use an exclusive display, your Windows desktop should be using more than one screen. Allocating an exclusive display on the main screen might not be convenient; if you do so, the MIL exclusive display will hide third-party applications designed to start on the main screen and hide the Windows taskbar. This display type requires MdispSelect() to display images. M_WEB Specifies to present the image buffer selected for display in one or more instances of a MILweb client application (for example, running in a compatible web browser). To use a MILweb display, you must enable MILweb server functionality in your application using MappControl() with M_WEB_CONNECTION. You must also publish the display using MobjControl() with M_WEB_PUBLISH. A MILweb display cannot be presented by your MIL application. It can only be presented by a connected MILweb client application (running on the local computer or a remote computer). This display type requires MdispSelect() to display images. M_WINDOWED Specifies to present the image buffer selected for display in its own window on the Windows desktop screen(s). The display window is tracked and updated with the image buffer selected for display; that is, if the window moves or is occluded, the window is updated with the image buffer accordingly. This display type can be used with MdispSelect() and MdispSelectWindow() to display images, unless combined with M_REMOTE_DISPLAY. A remote display requires MdispSelect() to display images. M_WPF Specifies to present the image buffer selected for display using a MILWPFDisplay control. See the Using WPF with MIL section of Chapter 60: Using MIL with .NET in the User Guide for details of how to use. This display type requires MdispSelect() to display images. Combination value for M_EXCLUSIVE , M_WINDOWED. You can add the following value to the above-mentioned values to set where and how the display is allocated. For controlling where and how the display is allocated Combination value Description M_REMOTE_DISPLAY Specifies that the display is displayed on the remote computer in a DMIL application. This setting is only available when the display is allocated on a DMIL remote system. If the display is allocated on a DMIL remote system but this setting is not specified, the display is presented on the local computer. To present the display on the remote computer, the Distributed MIL server cannot be running as a service; you must start it manually. To do so, assuming that Distributed MIL has already been installed during the setup, you must logon to the remote computer and, from the MILConfig utility, push the Start Server button, found in the Server Settings pane under the Distributed MIL item. For more information, see the Setting up the Distributed MIL server on remote computers subsection of the Preparing computers for Distributed MIL section of Chapter 62: Distributed MIL. This display type requires MdispSelect() to display images. DisplayIdPtr Specifies the address of the variable in which to write the display identifier or specifies the data type that the function should use to return the display identifier. For retrieving the identifier or specifying how to return it Value Description M_NULL Specifies that you will use this function's return value to obtain the identifier of the allocated display ; in this case, a standard MIL identifier of type MIL_ID is returned. M_UNIQUE_ID Specifies that you will use this function's return value to obtain the identifier of the allocated display ; in this case, a MIL smart identifier of type MIL_UNIQUE_DISP_ID is returned instead of a standard MIL identifier. This setting is only available when using C++11 (or later). A MIL smart identifier manages the lifespan of the MIL object it owns (similar to a std::unique_ptr). Note, you can use a MIL smart identifier as though it were a standard MIL identifier, except that you cannot use it to manually free the display (it is freed automatically). For more information, see the MIL smart identifiers subsection of the MIL custom data types, void pointers, extensions, and portability functions section of Chapter 2: Building an application. Address for the display identifier Specifies the address of a MIL_ID in which to write the identifier of the allocated display. If allocation fails, M_NULL is written as the identifier. Return value The returned value is the display identifier either as a standard identifier (MIL_ID) or a smart identifier (MIL_UNIQUE_DISP_ID). If allocation fails, M_NULL is returned (or nullptr if M_UNIQUE_ID was specified). Compilation information Header Include mil.h. Library Use mil.lib. DLL Requires mil.dll; mildisplay.dll. Syntax Description Parameters - SystemId For specifying the system - DispNum For specifying the display device For specifying the position of the device to use for an exclusive display - DispFormat For specifying the default display format For exclusive displays - InitFlag For specifying the display type + For controlling where and how the display is allocated - DisplayIdPtr For retrieving the identifier or specifying how to return it Return value Compilation information ",
      "wordCount": 1709,
      "subEntries": []
    },
    {
      "id": "Reference_disp_MdispControl",
      "version": null,
      "title": "MdispControl",
      "subTitles": null,
      "location": "MIL Reference",
      "pageURL": "content\\Reference\\disp\\MdispControl.htm",
      "text": " MdispControl Synopsis Control a MIL display setting. Syntax void MdispControl( MIL_ID&nbsp;DisplayId, //in MIL_INT64&nbsp;ControlType, //in MIL_DOUBLE&nbsp;ControlValue //in ) Description This function allows you to control the specified MIL display setting. Note that when using a C compiler (not a C++ or other compiler) in 64-bit mode, MdispControl() internally calls the MIL_INT64 version of this function (MdispControlInt64()). If you need to pass large integer values (including pointers), call the MIL_INT64 version of this function (MdispControlDouble()). Parameters Parameters DisplayId Specifies the identifier of the target display. ControlType Specifies the type of display setting to control. The control types for windowed displays can control the default MIL or user-specified window of the display (MdispSelect() or MdispSelectWindow()). See the Parameter associations section for possible values that can be specified. ControlValue Specifies the new value to assign to the display setting specified by the ControlType parameter. See the Parameter associations section for possible values that can be specified. Parameter associations The tables below list possible values for the ControlType and ControlValue parameters. For all types of displays For windowed displays For MIL windowed displays For user windowed displays For displays allocated on a DMIL remote system but displayed on the master computer Unless otherwise specified, the following ControlType and corresponding ControlValue parameter settings are available for all types of displays. For all types of displays ControlType Description ControlValue M_ASSOCIATED_GRAPHIC_LIST_ID Sets the 2D graphics list to associate with the display. Only one 2D graphics list can be associated with the display at a time. If you associate a 2D graphics list with a display that already has been associated with one, the previous 2D graphics list is disassociated from the display and the new one is associated. M_NULL Specifies that no 2D graphics list is associated with the display. This is the default value. MIL 2D graphics list identifier Specifies the identifier of the 2D graphics list to associate with the display. The 2D graphics list must have been previously allocated using MgraAllocList(). In this case, the vector-based graphics, contained within the 2D graphics list, will be used to annotate the display non-destructively. By default, modifications to the graphics within the list (added, deleted, or altered graphics) will be immediately reflected in the non-destructive annotation of the display. To change this behavior, use M_UPDATE_GRAPHIC_LIST. To release the 2D graphics list from memory, use MgraFree(). If the associated 2D graphics list is freed, it is automatically disassociated from the display. M_BACKGROUND_COLOR Sets the background color for the display. If the selected image buffer is smaller than the display or does not fill the display completely, the surrounding area will be displayed with this color. M_DEFAULT Same as M_COLOR_WHITE. M_RGB888( MIL_INT Red, MIL_INT Green, MIL_INT Blue ) Specifies the RGB value to which the background color will be set. Parameters Red Specifies the red component, as a value between 0 and 255. Green Specifies the green component, as a value between 0 and 255. Blue Specifies the blue component, as a value between 0 and 255. M_COLOR_BLACK Specifies the color black. M_COLOR_BLUE Specifies the color blue. M_COLOR_BRIGHT_GRAY Specifies the color bright gray. M_COLOR_CYAN Specifies the color cyan. M_COLOR_DARK_BLUE Specifies the color dark blue. M_COLOR_DARK_CYAN Specifies the color dark cyan. M_COLOR_DARK_GREEN Specifies the color dark green. M_COLOR_DARK_MAGENTA Specifies the color dark magenta. M_COLOR_DARK_RED Specifies the color dark red. M_COLOR_DARK_YELLOW Specifies the color dark yellow. M_COLOR_GRAY Specifies the color gray. M_COLOR_GREEN Specifies the color green. M_COLOR_LIGHT_BLUE Specifies the color light blue. M_COLOR_LIGHT_GRAY Specifies the color light gray. M_COLOR_LIGHT_GREEN Specifies the color light green. M_COLOR_LIGHT_WHITE Specifies the color light white. M_COLOR_MAGENTA Specifies the color magenta. M_COLOR_RED Specifies the color red. M_COLOR_WHITE Specifies the color white. M_COLOR_YELLOW Specifies the color yellow. M_CENTER_DISPLAY Sets whether a selected image buffer will be centered in the display, both in X and Y. M_DEFAULT Specifies the default value. The default value is M_ENABLE for a MIL default window and an exclusive display. The default value is M_DISABLE for a user-defined window display. M_DISABLE Specifies that the image buffer will not be centered in the display. This will overwrite the current panning offsets (MdispPan()) to (0,0). M_ENABLE Specifies that the image buffer will always be centered in the display, both in X and Y. This will offset the image buffer by ( (WindowSizeX - BufferSizeX)/2, (WindowSizeY - BufferSizeY)/2) in the window, and current panning offsets (MdispPan()) are overwritten with these values. M_GRAPHIC_LIST_INTERACTIVE Sets whether a user can interactively modify the graphics in the 2D graphics list associated with the display. Modifications to the graphics in the list include moving, resizing, and rotating. The user interacts with the graphics using the mouse. Clicking on a graphic selects it, which causes the graphic to be surrounded with a selection box. The selection box has handles around it that can be dragged to resize, rotate, or move the graphic. The user can select multiple graphics by holding down the Ctrl key and clicking on each graphic. New graphics can be added to the 2D graphics list interactively using MgraInteractive(). You can restrict the type of interactions the user can have using MgraControl() or MgraControlList(). M_DEFAULT Same as M_DISABLE. M_DISABLE Specifies that the 2D graphics list associated with the display cannot be affected by user interaction. M_ENABLE Specifies that the 2D graphics list associated with the display can be affected by user interaction. M_GRAPHIC_LIST_OPACITY Sets the opacity level of annotations generated from the 2D graphics list associated with the display. Note that this setting applies to the display, not to the associated 2D graphics list. If you associate another 2D graphics list with the display (using this function with M_ASSOCIATED_GRAPHIC_LIST_ID), the opacity that you set is also used with the new 2D graphics list. M_DEFAULT Same as M_DISABLE. M_DISABLE Specifies not to use partial opacity. 0 &lt;= Value &lt;= 100 Specifies the opacity (as a percentage), where 0 is completely transparent and 100 is completely opaque. M_INTERPOLATION_MODE Sets the type of interpolation used to display a zoomed image. M_DEFAULT Same as M_NEAREST_NEIGHBOR. M_AVERAGE Specifies averaging interpolation. M_INTERPOLATE Specifies interpolated resizing. This gives the best speed/result compromise for interpolated resizing. M_MAX Specifies an interpolation based on the maximum pixel value in the specified source image. M_MIN Specifies an interpolation based on the minimum pixel value in the specified source image. M_NEAREST_NEIGHBOR Specifies nearest neighbor interpolation. The new value is that of the pixel closest to the source point. M_KEYBOARD_USE Sets whether the user can interactively pan and zoom the display using the keyboard. The default key usage is: + Increases the X- and Y-zoom factors. - Decreases the X- and Y-zoom factors. Page-up Scrolls the image buffer up to the previous display section. Page-down Scrolls the image buffer down to the next display section. Up arrow Scrolls the image buffer up to the previous line. Down arrow Scrolls the image buffer down to the next line. Left arrow Scrolls the image buffer left by one pixel. Right arrow Scrolls the image buffer right by one pixel. Ctrl-Up arrow Scrolls the image buffer up to the previous display section. Ctrl-Down arrow Scrolls the image buffer down to the next display section. Ctrl-Left arrow Scrolls the image buffer left to the previous display section. Ctrl-Right arrow Scrolls the image buffer right to the next display section. M_DEFAULT For user-defined windowed displays, this value is the same as M_DISABLE; for MIL windowed and exclusive displays, this value is the same as M_ENABLE. M_DISABLE Specifies that using the keyboard to perform panning and zooming is disabled. This is the default value for user-defined windowed displays. M_ENABLE Specifies that using the keyboard to perform panning and zooming is enabled. This is the default value for MIL windowed and exclusive displays. M_MOUSE_CURSOR_CHANGE Sets whether the mouse cursor changes shape in a display with mouse-interaction enabled (M_MOUSE_USE). For example, if interactive panning is possible in the display, the cursor will change to a hand. If you have enabled M_GRAPHIC_LIST_INTERACTIVE, it is not necessary to enable this setting. M_DEFAULT For user-defined windowed displays, this value is the same as M_DISABLE; for MIL windowed and exclusive displays, this value is the same as M_ENABLE. M_DISABLE Specifies that mouse cursor change is disabled. This is the default value for user-defined windowed displays. M_ENABLE Specifies that mouse cursor change is enabled. This is the default value for MIL windowed and exclusive displays. M_MOUSE_USE Sets whether the user can interactively pan and zoom the display using the mouse. M_DEFAULT For user-defined windowed displays, this value is the same as M_DISABLE; for MIL windowed and exclusive displays, this value is the same as M_ENABLE. M_DISABLE Specifies that mouse-interaction will not work inside a display. This is the default value for user-defined windowed displays. M_ENABLE Specifies that mouse-interaction will work inside a display. This is the default value for MIL windowed and exclusive displays. M_OVERLAY Sets whether MIL's overlay mechanism is enabled. This mechanism allows you to annotate displayed image buffers non-destructively. For more information on MIL's overlay buffers, see the Annotating the displayed image non-destructively section of Chapter 25: Displaying an image. Once enabled, use MdispInquire() with the M_OVERLAY_ID inquire type to determine the MIL identifier of the overlay buffer. Note that once created, the overlay buffer is like any other image buffer. That is, you can perform operations on it as you would on a normal buffer (except for grabbing). M_DISABLE Specifies to disable MIL's overlay mechanism. This is the default value. M_ENABLE Specifies to enable MIL's overlay mechanism. M_OVERLAY_CLEAR Sets the value to which the overlay buffer associated with the display should be cleared. The buffer is cleared to the specified value immediately after this control type setting is changed. M_DEFAULT Same as M_TRANSPARENT_COLOR. M_RGB888( MIL_INT Red, MIL_INT Green, MIL_INT Blue ) Specifies the RGB value to which the display's overlay buffer will be cleared for a non 8-bit display mode. Specifies the RGB value. The buffer must be a non 8-bit 3-band buffer. Parameters Red Specifies the red component, as a value between 0 and 255. Green Specifies the green component, as a value between 0 and 255. Blue Specifies the blue component, as a value between 0 and 255. M_COLOR_BLACK Specifies the color black. M_COLOR_BLUE Specifies the color blue. M_COLOR_BRIGHT_GRAY Specifies the color bright gray. M_COLOR_CYAN Specifies the color cyan. M_COLOR_DARK_BLUE Specifies the color dark blue. M_COLOR_DARK_CYAN Specifies the color dark cyan. M_COLOR_DARK_GREEN Specifies the color dark green. M_COLOR_DARK_MAGENTA Specifies the color dark magenta. M_COLOR_DARK_RED Specifies the color dark red. M_COLOR_DARK_YELLOW Specifies the color dark yellow. M_COLOR_GRAY Specifies the color gray. M_COLOR_GREEN Specifies the color green. M_COLOR_LIGHT_BLUE Specifies the color light blue. M_COLOR_LIGHT_GRAY Specifies the color light gray. M_COLOR_LIGHT_GREEN Specifies the color light green. M_COLOR_LIGHT_WHITE Specifies the color light white. M_COLOR_MAGENTA Specifies the color magenta. M_COLOR_RED Specifies the color red. M_COLOR_WHITE Specifies the color white. M_COLOR_YELLOW Specifies the color yellow. M_TRANSPARENT_COLOR Specifies that the display's overlay buffer will be cleared to the transparency color. Set the transparency color with the M_TRANSPARENT_COLOR control type. M_OVERLAY_OPACITY Sets the opacity of the display's overlay buffer. Any pixels in the overlay image which have the keying color (M_TRANSPARENT_COLOR) are always transparent, regardless of this setting. M_DEFAULT Same as M_DISABLE. M_DISABLE Specifies not to use partial opacity. This is equivalent to setting an opacity of 100. 0 &lt;= Value &lt;= 100 Specifies the opacity (as a percentage), where 0 is completely transparent and 100 is completely opaque. M_OVERLAY_SHOW Sets whether the display's overlay buffer is visible. M_DISABLE Specifies that the overlay buffer is not visible. Display the image buffer selected on the display only. M_ENABLE Specifies that the overlay buffer is visible. Annotations or other changes made to the overlay buffer in a color other than the transparency color will annotate the image selected to the display. Set the transparency color with the M_TRANSPARENT_COLOR control type. This is the default value. M_OPAQUE Specifies that only the overlay buffer is visible. The image buffer selected will be hidden. M_REGION_INSIDE_COLOR Sets the color that will be used to clear the pixels that are part of a region of interest associated with the selected buffer. The pixels are cleared to the specified color immediately after this control type setting is changed. M_DEFAULT Same as M_COLOR_GREEN. M_RGB888( MIL_INT Red, MIL_INT Green, MIL_INT Blue ) Specifies the RGB value to which the pixels that are part of a region will be cleared for a non 8-bit display mode. Specifies the RGB value. The buffer must be a non 8-bit 3-band buffer. Parameters Red Specifies the red component, as a value between 0 and 255. Green Specifies the green component, as a value between 0 and 255. Blue Specifies the blue component, as a value between 0 and 255. M_COLOR_BLACK Specifies the color black. M_COLOR_BLUE Specifies the color blue. M_COLOR_BRIGHT_GRAY Specifies the color bright gray. M_COLOR_CYAN Specifies the color cyan. M_COLOR_DARK_BLUE Specifies the color dark blue. M_COLOR_DARK_CYAN Specifies the color dark cyan. M_COLOR_DARK_GREEN Specifies the color dark green. M_COLOR_DARK_MAGENTA Specifies the color dark magenta. M_COLOR_DARK_RED Specifies the color dark red. M_COLOR_DARK_YELLOW Specifies the color dark yellow. M_COLOR_GRAY Specifies the color gray. M_COLOR_GREEN Specifies the color green. M_COLOR_LIGHT_BLUE Specifies the color light blue. M_COLOR_LIGHT_GRAY Specifies the color light gray. M_COLOR_LIGHT_GREEN Specifies the color light green. M_COLOR_LIGHT_WHITE Specifies the color light white. M_COLOR_MAGENTA Specifies the color magenta. M_COLOR_RED Specifies the color red. M_COLOR_WHITE Specifies the color white. M_COLOR_YELLOW Specifies the color yellow. M_REGION_INSIDE_SHOW Sets how to display the pixels that are part of a region of interest associated with the selected buffer, if such a region exist. M_DEFAULT Same as M_TRANSPARENT. M_GRAPHIC_LIST_OPACITY Specifies that pixels in the region are displayed with a color overlay using the opacity specified with M_GRAPHIC_LIST_OPACITY. The color is specified with M_REGION_INSIDE_COLOR. M_OPAQUE Specifies that pixels in the region are cleared to the color specified using M_REGION_INSIDE_COLOR. M_TRANSPARENT Specifies that pixels in the region are displayed as is. M_REGION_OUTSIDE_COLOR Sets the color that will be used to clear the pixels that are not part of a region of interest associated with the selected buffer. The pixels are cleared to the specified color immediately after this control type setting is changed. M_DEFAULT Same as M_COLOR_RED. M_RGB888( MIL_INT Red, MIL_INT Green, MIL_INT Blue ) Specifies the RGB value to which the pixels that are part of a region will be cleared for a non 8-bit display mode. Specifies the RGB value. The buffer must be a non 8-bit 3-band buffer. Parameters Red Specifies the red component, as a value between 0 and 255. Green Specifies the green component, as a value between 0 and 255. Blue Specifies the blue component, as a value between 0 and 255. M_COLOR_BLACK Specifies the color black. M_COLOR_BLUE Specifies the color blue. M_COLOR_BRIGHT_GRAY Specifies the color bright gray. M_COLOR_CYAN Specifies the color cyan. M_COLOR_DARK_BLUE Specifies the color dark blue. M_COLOR_DARK_CYAN Specifies the color dark cyan. M_COLOR_DARK_GREEN Specifies the color dark green. M_COLOR_DARK_MAGENTA Specifies the color dark magenta. M_COLOR_DARK_RED Specifies the color dark red. M_COLOR_DARK_YELLOW Specifies the color dark yellow. M_COLOR_GRAY Specifies the color gray. M_COLOR_GREEN Specifies the color green. M_COLOR_LIGHT_BLUE Specifies the color light blue. M_COLOR_LIGHT_GRAY Specifies the color light gray. M_COLOR_LIGHT_GREEN Specifies the color light green. M_COLOR_LIGHT_WHITE Specifies the color light white. M_COLOR_MAGENTA Specifies the color magenta. M_COLOR_RED Specifies the color red. M_COLOR_WHITE Specifies the color white. M_COLOR_YELLOW Specifies the color yellow. M_REGION_OUTSIDE_SHOW Sets how to display the pixels that are not part of a region of interest associated with the selected buffer, if such a region exist. M_DEFAULT Same as M_TRANSPARENT. M_GRAPHIC_LIST_OPACITY Specifies that pixels outside of the region are displayed with a color overlay using the opacity specified with M_GRAPHIC_LIST_OPACITY. The color is specified with M_REGION_OUTSIDE_COLOR. M_OPAQUE Specifies that pixels outside of the region are cleared to the color specified using M_REGION_OUTSIDE_COLOR. M_TRANSPARENT Specifies that pixels outside of the region are displayed as is. M_RESTRICT_CURSOR Sets whether to restrict the mouse cursor so that it cannot move over the exclusive display. This control type is only applicable to exclusive displays. M_DISABLE Specifies to permit the mouse cursor to move over the display. M_ENABLE Specifies to restrict the mouse cursor so that it cannot move over the display. This is the default value. M_SCALE_DISPLAY Sets whether to fill the display with the selected image buffer, while keeping the same aspect ratio. You can inquire the automatically calculated zoom factor used to scale the image, using MdispInquire() with M_ZOOM_FACTOR_X and M_ZOOM_FACTOR_Y. M_DISABLE Specifies that the image will not be scaled to fit the display. Unless a zoom factor has been applied, using MdispZoom(), the image will retain its original size and aspect ratio, leaving unused portions of the display to the default background color. This is the default value. M_ENABLE Specifies to always scale the selected image buffer to fit the display, while keeping the same aspect ratio. In this case, the image is not distorted. This setting overrides current pannning offsets (MdispPan()), as well as the previous zoom factors (MdispZoom()). M_ONCE Specifies to compute the scale factors corresponding to M_ENABLE and call MdispZoom() with these factors. Unlike M_ENABLE, this setting changes the scale factors only once and these scale factors will not change if an image buffer with a different size is selected to the display. M_TITLE Sets the display's title to the specified string. For windowed displays, set whether the window's title bar is visible using the M_WINDOW_TITLE_BAR control type. If M_NULL is specified, the window is given a default title (\"MIL Display #x\"). M_NULL Specifies to use the default title. This is the default value. MIL_TEXT(\"WindowTitle\") 1 Specifies the name of the window title (or display's title). Note, if using a C compiler, you must pass the value as M_PTR_TO_MIL_INT(MIL_TEXT(\"WindowTitle\")). M_TRANSPARENT_COLOR Sets the transparency (keying) color. Pixels of the image buffer selected to the display are displayed only where the corresponding pixels of the overlay buffer are set to the transparency color. M_DEFAULT Specifies the optimal transparency color. M_RGB888( MIL_INT Red, MIL_INT Green, MIL_INT Blue ) Specifies the RGB value to which to set the transparency color for a non 8-bit display mode. Parameters Red Specifies the red component, as a value between 0 and 255. Green Specifies the green component, as a value between 0 and 255. Blue Specifies the blue component, as a value between 0 and 255. M_COLOR_BLACK Specifies the color black. M_COLOR_BLUE Specifies the color blue. M_COLOR_BRIGHT_GRAY Specifies the color bright gray. M_COLOR_CYAN Specifies the color cyan. M_COLOR_DARK_BLUE Specifies the color dark blue. M_COLOR_DARK_CYAN Specifies the color dark cyan. M_COLOR_DARK_GREEN Specifies the color dark green. M_COLOR_DARK_MAGENTA Specifies the color dark magenta. M_COLOR_DARK_RED Specifies the color dark red. M_COLOR_DARK_YELLOW Specifies the color dark yellow. M_COLOR_GRAY Specifies the color gray. M_COLOR_GREEN Specifies the color green. M_COLOR_LIGHT_BLUE Specifies the color light blue. M_COLOR_LIGHT_GRAY Specifies the color light gray. M_COLOR_LIGHT_GREEN Specifies the color light green. M_COLOR_LIGHT_WHITE Specifies the color light white. M_COLOR_MAGENTA Specifies the color magenta. M_COLOR_RED Specifies the color red. M_COLOR_WHITE Specifies the color white. M_COLOR_YELLOW Specifies the color yellow. M_UPDATE Sets whether MIL should update the display. This control type can be used to temporarily disable display updates when the image buffer is being modified by more than one operation; the display can then be updated at the end of all operations. M_DISABLE Specifies not to update the display. M_ENABLE Specifies to update the display. Also, the display is forced to update immediately. This is the default value. M_NOW Specifies to force an immediate update of the display. In this case, the display is updated even if M_UPDATE is set to M_DISABLE. M_UPDATE_GRAPHIC_LIST Sets whether MIL should update the display when modifications are made to the display's associated 2D graphics list. To associate a 2D graphics list to the display, use M_ASSOCIATED_GRAPHIC_LIST_ID. With M_UPDATE_GRAPHIC_LIST, you can temporarily disable display updates (M_DISABLE) when the 2D graphics list is being modified by multiple operations; you can then enable display updates (M_ENABLE) at the end of all operations. M_DISABLE Specifies that the display is not updated when the associated 2D graphics list is modified. M_ENABLE Specifies that the display is immediately updated when the associated 2D graphics list is modified (refresh not required). This is the default value. M_UPDATE_RATE_DIVIDER Sets after how many buffer modifications to update the display, regardless of the time lapsed. For example, if you set M_UPDATE_RATE_DIVIDER to 10, one out of every 10 buffer modifications will cause a display update. If fewer than the specified number of buffer modifications occur, the display is not updated. The display is only updated with the last buffer modification. This control type is useful when performing a continuous grab. If the display is allocated on a DMIL remote system but displayed on the master computer, another mechanism is also available to limit the number of display updates. You can set an upper limit to the number of display updates to perform per second, using M_UPDATE_RATE_MAX. In this case, updates of modified areas of the buffer are accumulated into one update between transmissions. M_DEFAULT Specifies the default value; the default value is 1. Value Specifies the frequency of the update. M_UPDATE_RATE_MAX Sets the maximum rate at which to update the display. To update the display only after a specific number of buffer modifications, regardless of the time lapsed, use M_UPDATE_RATE_DIVIDER instead. M_DEFAULT Same as M_INFINITE. M_INFINITE Specifies to perform updates as fast as possible (limited by the available bandwidth and transmission delay). Value &gt; 0 Specifies the maximum number of updates per second. Only integer values are accepted. A minimum delay of 1/ Value seconds will be respected between two consecutive updates. M_UPDATE_SYNCHRONIZATION [This is only applicable to Windows] Sets the update mode currently used to update the display. This control type allows you to serialize paint messages sent to update the display. When the display uses a user-defined window, one paint message can interrupt another. This can cause deadlock if, for example, you set up an event handler for the paint message which tries to update the image buffer selected on the display. This will cause another paint message to be called to update the display. This results in the paint message recursively calling itself, causing a deadlock. To solve this problem M_UPDATE_SYNCHRONIZATION can be set to enforce the serialization of paint messages. This control type allows you to serialize the published image data stream with your remote display. M_DEFAULT Specifies the default update mode. The default mode corresponds to M_ASYNCHRONOUS, if the user-defined window thread is the same as the current one. Otherwise, it is M_SYNCHRONOUS. Same as M_ASYNCHRONOUS. M_ASYNCHRONOUS Specifies that the display is updated when possible. The paint messages are queued and that the application's window procedure (WndProc) will update the display whenever possible. Basically, when a paint message is issued, MIL calls the Windows InvalidateRect() function. For more information on InvalidateRect(), refer to the MSDN library. The published image data stream to be asynchronous. The function will return immediately while internal threads are sending data to all clients that are listening for the data stream. MdispControl() using M_UPDATE_SYNCHRONIZATION with a valid display identifier will result in a call to the Remote module's RemoteSetAttribute function, with the proper parameters set. M_SYNCHRONOUS Specifies that the display is updated immediately. The display is updated immediately upon reception of a paint message. Basically, when a paint message is issued, MIL calls the Windows InvalidateRect() function followed by the Windows UpdateWindow() function. For more information on InvalidateRect() and UpdateWindow(), refer to the MSDN library. The published image data stream will be synchronous. The function will return only when the information is sent to all clients that are listening for the data stream. The call to MdispControl() using M_UPDATE_SYNCHRONIZATION with a valid display ID will result in a call to the Remote module's RemoteSetAttribute function, with the proper parameters set. M_VIEW_BIT_SHIFT Sets the number of bits by which to bit-shift the pixel values of the image buffer selected to the display, when the M_VIEW_MODE control type is set to M_BIT_SHIFT. Value Specifies the number of bits. This value should be set to the number of significant bits in the image buffer minus 8. For example, if a 16-bit image buffer contains data grabbed from a 10-bit digitizer, a shift of 2 should be used. The default value is 0. M_VIEW_MODE Sets the view mode of the display. The view mode establishes how an image buffer gets remapped to the display; this is especially useful when displaying a non 8-bit image buffer. M_DEFAULT Specifies the default value. The default value is M_TRANSPARENT unless the buffer selected on the display is a 1-bit buffer; when a 1-bit buffer is used, the default value is M_AUTO_SCALE. M_AUTO_SCALE [For essential MIL-Lite information, see remarks ] Specifies to remap the pixel values to the display so that the minimum and maximum values in the image (not the full range of the image buffer) are set to 0 and 255, respectively. If the image buffer contains a single value, the displayed value is determined by linearly remapping the full range of the image buffer to that of the display (for example, (0 to 64K) to (0 to 255)). M_BIT_SHIFT Specifies to bit-shift the pixel values of the image buffer by the specified number of bits upon updating the display. Specify the number of bits with the M_VIEW_BIT_SHIFT control type. M_MULTI_BYTES Specifies to display each byte of the image buffer in separate display pixels. In other words, each pixel of a 16-bit image buffer will occupy two consecutive display pixels. Each pixel of a 32-bit image buffer will occupy four consecutive display pixels. This mode is only supported for 16-bit and 32-bit 1-band buffer. This mode is primarily useful when grabbing from a multi-tap camera. M_TRANSPARENT Specifies that no pixel remapping will be performed. Note that only the 8 least-significant bits of the image buffer will be displayed. 1 If you are passing the value in a variable, don't enclose it in MIL_TEXT(). The following ControlType and corresponding ControlValue parameter settings are available for all windowed displays. For windowed displays ControlType Description ControlValue M_WINDOW_ANNOTATIONS Advises MIL whether annotations will be drawn directly to the window's device context (DC) using GDI functions. M_DEFAULT [This is only applicable to Windows] Same as M_ENABLE. M_NULL [This is only applicable to Linux] Specifies to advise MIL that the X display connection has not been set. M_DISABLE [This is only applicable to Windows] Specifies not to draw directly to the window's device context using GDI functions. M_ENABLE [This is only applicable to Windows] Specifies to draw directly to the window's device context using GDI functions. Value [This is only applicable to Linux] Specifies the pointer to the X display connection. M_WINDOW_UPDATE_ON_PAINT [This is only applicable to Windows] Sets when the display will be updated. M_DEFAULT Allows MIL to decide which message to receive before updating the display. M_DISABLE Updates the display on reception of a WM_ERASEBKGND message in Windows. M_ENABLE Updates the display on reception of a WM_PAINT message in Windows. The following ControlType and corresponding ControlValue parameter settings are only available for MIL windowed displays (selected using MdispSelect()), and are not available for user windowed displays (selected using MdispSelectWindow()): For MIL windowed displays ControlType Description ControlValue M_FULL_SCREEN Sets whether the window should be maximized and shown without the title bar or menu (full screen mode). M_DEFAULT Same as M_DISABLE. M_DISABLE Specifies that the window will not be maximized and shown with the title bar and menu. M_ENABLE Specifies that the window will be maximized and shown without the title bar or menu. M_WINDOW_INITIAL_POSITION_X Sets the initial, left-most, X-coordinate of the window. Value Specifies the X-coordinate, in pixels. M_WINDOW_INITIAL_POSITION_Y Sets the initial, top-most, Y-coordinate of the window. Value Specifies the Y-coordinate, in pixels. M_WINDOW_INITIAL_SIZE_X Sets the initial width of the window. M_DEFAULT Specifies that MIL will calculate the optimal width. Value &gt; 0 Specifies the width, in pixels. M_WINDOW_INITIAL_SIZE_Y Sets the initial height of the window. M_DEFAULT Specifies that MIL will calculate the optimal height. Value &gt; 0 Specifies the height, in pixels. M_WINDOW_MAXBUTTON [This is only applicable to Windows] Sets whether the window's maximize button is visible. M_DEFAULT Same as M_ENABLE. M_DISABLE Specifies that the button is not visible. M_ENABLE Specifies that the button is visible. M_WINDOW_MINBUTTON [This is only applicable to Windows] Sets whether the window's minimize button is visible. M_DEFAULT Same as M_ENABLE. M_DISABLE Specifies that the button is not visible. M_ENABLE Specifies that the button is visible. M_WINDOW_MOVE [This is only applicable to Windows] Sets whether window movement is allowed. M_DISABLE Specifies not to allow window movement. M_ENABLE Specifies to allow window movement. This is the default value. M_WINDOW_OVERLAP [This is only applicable to Windows] Sets whether the window can be overlapped by another. M_DISABLE Specifies not to allow the window to be overlapped by another (keep window on top). M_ENABLE Specifies to allow the window to be overlapped by another. This is the default value. M_WINDOW_RESIZE [This is only applicable to Windows] Sets whether window resizing is allowed. M_DISABLE Specifies not to allow window resizing. M_ENABLE Specifies to allow window resizing. This is the default value. M_WINDOW_SHOW Sets whether the window should be shown or hidden. M_DISABLE Specifies that the window should be hidden. M_ENABLE Specifies that the window should be shown. This is the default value. M_WINDOW_SIZE_AUTO_RESET Sets whether the window should be resized when using MdispSelect(). By default, MdispSelect() automatically resizes the MIL display window to be the same size of the selected buffer. M_DEFAULT Same as M_ENABLE. M_DISABLE Specifies that MIL will not resize the window. M_ENABLE Specifies that MIL will resize the window to be the same size of the selected buffer. M_WINDOW_SYSBUTTON [This is only applicable to Windows] Sets whether the window's system buttons are visible. The system buttons refer to the collection of the window's minimize, maximize, and close buttons. To individually set whether the minimize and maximize buttons are visible, change the M_WINDOW_MAXBUTTON or M_WINDOW_MINBUTTON control type settings. M_DEFAULT Same as M_ENABLE. M_DISABLE Specifies that the button is not visible. M_ENABLE Specifies that the button is visible. M_WINDOW_TITLE_BAR Sets whether the window's title bar is visible. M_DISABLE Specifies that the title bar is not visible. M_ENABLE Specifies that the title bar is visible. This is the default value. M_WINDOW_TITLE_BAR_CHANGE Sets whether the presence of the window's title bar can be toggled with the M_WINDOW_TITLE_BAR control type. M_DISABLE Specifies not to allow toggling. M_ENABLE Specifies to allow toggling. This is the default value. The following ControlType and corresponding ControlValue parameter settings are only available for user windowed displays (selected using MdispSelectWindow()), and are not available for MIL windowed displays (selected using MdispSelect()): For user windowed displays ControlType Description ControlValue M_GTK_MODE Sets whether to configure the display for use in a window created using the third-party GTK framework. Present the display in this window using MdispSelectWindow(). If this setting is disabled and the display is selected to a window created using GTK, the display might not appear correctly. M_DISABLE Specifies not to configure the display for use in a window created using the GTK framework. This is the default value. M_ENABLE Specifies not to configure the display for use in a window created using the GTK framework. M_QT_MODE Sets whether to configure the display for use in a window created using the third-party Qt framework. Present the display in this window using MdispSelectWindow(). If this setting is disabled and the display is selected to a window created using Qt, the display might not appear correctly. M_DISABLE Specifies not to configure the display for use in a window created using the Qt framework. This is the default value. M_ENABLE Specifies to configure the display for use in a window created using the Qt framework. M_TK_MODE Sets whether to configure the display for use in a window created using the third-party Tk framework. Present the display in this window using MdispSelectWindow(). If this setting is disabled and the display is selected to a window created using Tk, the display might not appear correctly. M_DISABLE Specifies not to configure the display for use in a window created using the Tk framework. This is the default value. M_ENABLE Specifies to configure the display for use in a window created using the Tk framework. The following ControlType and corresponding ControlValue parameter settings are available for displays allocated on a DMIL remote system but displayed on the master computer. For displays allocated on a DMIL remote system but displayed on the master computer ControlType Description ControlValue M_ASYNC_UPDATE Sets whether to send display updates from the remote computer to the master computer in asynchronous or synchronous mode. M_DEFAULT Specifies to use the default mode, which can be selected using the MILConfig utility. In the MILConfig utility, if you select the High quality display option, the default mode is M_DISABLE; if you select the Optimized for bandwidth usage display option, the default mode is M_ENABLE. M_DISABLE Specifies to send display updates in synchronous mode. In synchronous mode, the display is updated after each modification to the displayed image buffer (or the overlay buffer), and the application waits for the data to be transferred to the display before continuing. When an image, located on a remote computer, is displayed on the master computer, the update time can significantly slow your application. M_ENABLE Specifies that data will be sent asynchronously. In asynchronous mode, the required display updates are queued using multiple internal image bufferss and the application continues once the update has been queued. This mode maximizes your bandwidth usage while minimizing processing delays. There will be a delay of 1/ M_UPDATE_RATE_MAX between two consecutive updates. M_COMPRESSION_TYPE [For essential MIL-Lite information, see remarks ] Sets how to compress data being transmitted from the remote computer to the master computer. M_DEFAULT Specifies to use the default compression type, which can be selected using the MILConfig utility. In the MILConfig utility, if you select the High quality display option, compression is disabled (M_NULL); if you select the Optimized for bandwidth usage display option, compression is enabled and the compression type is set to M_JPEG_LOSSY. M_NULL Specifies that compression is disabled. M_JPEG2000_LOSSLESS Specifies that JPEG2000 lossless compression will be used. The supported data formats are: 1-band, 8- or 16-bit data. JPEG2000 compression supports much higher ratios of compression. You might need to use this compression type, for example, when there are fine details in your image or overlay buffer. Note, however, you should avoid this compression type unless absolutely necessary since compression/decompression time is high; you should only use it when the benefits of compression outweigh the overhead associated with the compression/decompression. M_JPEG2000_LOSSY Specifies JPEG2000 lossy compression will be used. JPEG2000 compression supports much higher ratios of compression without compromising image quality. You might need to use this compression type, for example, when there are fine details in your image or overlay buffer. Note, however, you should avoid this compression type unless absolutely necessary since compression/decompression time is high; you should only use it when the benefits of compression outweigh the overhead associated with the compression/decompression. You can manually set the compression factor using M_Q_FACTOR. M_JPEG_LOSSLESS Specifies JPEG lossless compression will be used. The supported data formats are: 1-band, 8- or 16-bit data. M_JPEG_LOSSLESS_INTERLACED Specifies that JPEG lossless compression will be used in separate fields. The supported data formats are 1-band, 8- or 16-bit data. M_JPEG_LOSSY Specifies that JPEG lossy compression will be used. You can manually set the compression factor using M_Q_FACTOR. M_JPEG_LOSSY_INTERLACED Specifies that JPEG lossy compression will be used in separate fields. You can manually set the compression factor using M_Q_FACTOR. M_Q_FACTOR [For essential MIL-Lite information, see remarks ] Sets the quantization factor. This control type is only applied when lossy compression is used. The Q factor is applied to all bands. M_DEFAULT Specifies the default value; the default value is 80. 1 &lt;= Value &lt;= 99 Specifies the quantization factor. Only integer values are accepted. The higher the factor, the more the compression, but the lower the image quality. Remarks [MIL-Lite] MIL-Lite does not support displaying a 32-bit image buffer in a display that has its M_VIEW_MODE control type set to M_AUTO_SCALE, unless you have purchased the MIL Image Analysis license. [MIL-Lite] Note that during development and at runtime, compression support requires the presence of a MIL license that grants access to the compression/decompression package. This access is only granted by default with the development license dongle for the full version of MIL. In other cases, you must purchase access to this package separately. Type-specific versions of the function when using a C compiler under 64-bit void MdispControlDouble (MIL_ID DisplayId, MIL_INT64 ControlType, MIL_DOUBLE ControlValue) Details Parameters DisplayId See DisplayId of the main function for a description. ControlType See ControlType of the main function for a description. ControlValue See ControlValue of the main function for a description. void MdispControlInt64 (MIL_ID DisplayId, MIL_INT64 ControlType, MIL_INT64 ControlValue) Details Parameters DisplayId See DisplayId of the main function for a description. ControlType See ControlType of the main function for a description. ControlValue See ControlValue of the main function for a description. Compilation information Header Include mil.h. Library Use mil.lib. DLL Requires mil.dll; mildisplay.dll. Syntax Description Parameters - DisplayId - ControlType - ControlValue Parameter Associations For all types of displays For windowed displays For MIL windowed displays For user windowed displays For displays allocated on a DMIL remote system but displayed on the master computer Remarks Type-specific versions of the function when using a C compiler under 64-bit Compilation information ",
      "wordCount": 6188,
      "subEntries": []
    },
    {
      "id": "Reference_disp_MdispFree",
      "version": null,
      "title": "MdispFree",
      "subTitles": null,
      "location": "MIL Reference",
      "pageURL": "content\\Reference\\disp\\MdispFree.htm",
      "text": " MdispFree Synopsis Free a display. Syntax void MdispFree( MIL_ID&nbsp;DisplayId //in ) Description This function deallocates a display previously allocated with MdispAlloc(). If an image buffer was selected to the display using MdispSelect(), MdispFree() also closes the associated window for windowed displays; if an image buffer was selected to the display using MdispSelectWindow(), the associated window is left open but it is left blank. For exclusive displays, this causes the display to disappear, allowing the desktop to reappear on the screen. All displays allocated on a particular system must be freed before the system can be freed, unless M_UNIQUE_ID was specified during allocation. Parameters Parameter DisplayId Specifies the identifier of the display. Compilation information Header Include mil.h. Library Use mil.lib. DLL Requires mil.dll; mildisplay.dll. Syntax Description Parameters - DisplayId Compilation information ",
      "wordCount": 132,
      "subEntries": []
    },
    {
      "id": "Reference_disp_MdispGetHookInfo",
      "version": null,
      "title": "MdispGetHookInfo",
      "subTitles": null,
      "location": "MIL Reference",
      "pageURL": "content\\Reference\\disp\\MdispGetHookInfo.htm",
      "text": " MdispGetHookInfo Synopsis Get information about a display hook event. Syntax MIL_INT MdispGetHookInfo( MIL_ID&nbsp;EventId, //in MIL_INT64&nbsp;InfoType, //in void&nbsp;*UserVarPtr //out ) Description This function allows you to get information about the event that caused the hook-handler function to be called. MdispGetHookInfo() should only be called within the scope of a display hook-handler function (see MdispHookFunction()). Parameters Parameters EventId Specifies the display event identifier received by the hook-handler function (see MdispHookFunction()). InfoType Specifies the type of information about the event to return. See the Parameter associations section for possible values that can be specified. UserVarPtr Accepts the address of one of the following (see the Parameter associations section for specifics on which is expected): MIL_DOUBLE MIL_ID MIL_INT Specifies the address in which to write the requested information. See the Parameter associations section for possible values that can be returned. Parameter associations The tables below list possible values for the InfoType parameter and possible values returned to the UserVarPtr parameter. For retrieving information about a general display hook event For retrieving information regarding mouse events For retrieving information regarding keyboard events For retrieving information regarding either a mouse or keyboard event Regardless of the display event that caused the hook-handler function to be called, the InfoType parameter can be set to the value below. For retrieving information about a general display hook event InfoType Description UserVarPtr - Possible values returned M_DISPLAY Retrieves the MIL identifier of the display that generated the event. UserVarPtr extra info Data type info: Data type: address of a MIL_ID Data type: address of a MIL_ID MIL display identifier Specifies the MIL identifier of the display that generated the event. If the hook-handler function was called due to an M_MOUSE_... event type, the InfoType parameter can be set to one of the values below. For retrieving information regarding mouse events InfoType Description UserVarPtr - Possible values returned M_MOUSE_POSITION_BUFFER_X Retrieves the X-position of the cursor, in buffer coordinates. UserVarPtr extra info Data type info: Data type: address of a MIL_DOUBLE Data type: address of a MIL_DOUBLE Value Specifies the X-position of the cursor, in buffer coordinates. M_MOUSE_POSITION_BUFFER_Y Retrieves the Y-position of the cursor, in buffer coordinates. UserVarPtr extra info Data type info: Data type: address of a MIL_DOUBLE Data type: address of a MIL_DOUBLE Value Specifies the Y-position of the cursor, in buffer coordinates. M_MOUSE_POSITION_X Retrieves the X-position of the cursor, in display coordinates. UserVarPtr extra info Data type info: Data type: address of a MIL_INT Data type: address of a MIL_INT Value Specifies the X-position of the cursor, in display coordinates. M_MOUSE_POSITION_Y Retrieves the Y-position of the cursor, in display coordinates. UserVarPtr extra info Data type info: Data type: address of a MIL_INT Data type: address of a MIL_INT Value Specifies the Y-position of the cursor, in display coordinates. M_MOUSE_WHEEL_VALUE Retrieves the value for the mouse wheel's rotation. Note, this value can only be retrieved if the hook-handler function was called due to the M_MOUSE_WHEEL event. UserVarPtr extra info Data type info: Data type: address of a MIL_INT Data type: address of a MIL_INT Value Specifies the value for the mouse wheel's rotation. A positive value indicates that the wheel was rotated forward, away from the user; a negative value indicates that the wheel was rotate backward, toward the user. If the hook-handler function was called due to an M_KEY_... event type, the InfoType parameter can be set to the value below. For retrieving information regarding keyboard events InfoType Description UserVarPtr - Possible values returned M_KEY_VALUE Retrieves the operating system's key code for the keyboard key that triggered the event. UserVarPtr extra info Data type info: Data type: address of a MIL_INT Data type: address of a MIL_INT Value Specifies the key code. M_MIL_KEY_VALUE Retrieves the MIL operating system-independent key code for the keyboard key that triggered the event. Note, this value can only be retrieved if the hook-handler function was called due to the M_KEY_DOWN or M_KEY_UP event. UserVarPtr extra info Data type info: Data type: address of a MIL_INT Data type: address of a MIL_INT M_KEY_ADD Specifies the Add key (+). M_KEY_ARROW_DOWN Specifies the Down Arrow key. M_KEY_ARROW_LEFT Specifies the Left Arrow key. M_KEY_ARROW_RIGHT Specifies the Right Arrow key. M_KEY_ARROW_UP Specifies the Up Arrow key. M_KEY_BACK Specifies the Back key. M_KEY_CLEAR Specifies the Clear key. M_KEY_DECIMAL Specifies the Period key located on your number pad. M_KEY_DELETE Specifies the Delete key. M_KEY_DIVIDE Specifies the Divide key (/). M_KEY_END Specifies the End key. M_KEY_ESC Specifies the Esc key. M_KEY_EXECUTE Specifies the Execute key. M_KEY_Fn Specifies the n key, where n is a value from 1 to 24. M_KEY_HOME Specifies the Home key. M_KEY_INSERT Specifies the Insert key. M_KEY_MULTIPLY Specifies the Multiply key (*). M_KEY_n Specifies the n key, where n is a value from 0 to 9. M_KEY_NUM_LOCK Specifies the Num Lock key. M_KEY_NUMPADn Specifies the n key, where n is a value from 0 to 9. M_KEY_PAGEDOWN Specifies the Pagedown key. M_KEY_PAGEUP Specifies the Pageup key. M_KEY_PAUSE Specifies the Pause key. M_KEY_RETURN Specifies the Return key (Enter). M_KEY_SCROLL_LOCK Specifies the Scroll Lock key. M_KEY_SEPARATOR Specifies the Separator key. M_KEY_SPACE Specifies the Space key. M_KEY_SUBTRACT Specifies the Subtract key (-). M_KEY_TAB Specifies the Tab key. M_KEY_xxx Specifies the letter key xxx, where xxx can be a letter from A to Z. If the hook-handler function was called due to either an M_KEY_... or M_MOUSE_... event type, the InfoType parameter can be set to the value below. For retrieving information regarding either a mouse or keyboard event InfoType Description UserVarPtr - Possible values returned M_COMBINATION_KEYS Retrieves which combination keys or mouse buttons triggered the event. Note that a combination of the values below can be returned. Bitwise operators must be used to establish the specific keys or buttons pressed. UserVarPtr extra info Data type info: Data type: address of a MIL_INT MORE Data type: address of a MIL_INT Bitwise return value; values listed below can be established using bitwise operators. Data type: address of a MIL_INT M_KEY_ALT Specifies the Alt key. M_KEY_CTRL Specifies the Ctrl key. M_KEY_SHIFT Specifies the Shift key. M_KEY_WIN Specifies the Windows key. M_MOUSE_LEFT_BUTTON Specifies the left mouse button. M_MOUSE_MIDDLE_BUTTON Specifies the middle mouse button. M_MOUSE_RIGHT_BUTTON Specifies the right mouse button. Return value The returned value is M_NULL if successful. If the operation fails, a non-null (!M_NULL) value is returned. Compilation information Header Include mil.h. Library Use mil.lib. DLL Requires mil.dll; mildisplay.dll. Syntax Description Parameters - EventId - InfoType - UserVarPtr Parameter Associations For retrieving information about a general display hook event For retrieving information regarding mouse events For retrieving information regarding keyboard events For retrieving information regarding either a mouse or keyboard event Return value Compilation information M_KEY_Fn M_KEY_n M_KEY_NUMPADn M_KEY_xxx ",
      "wordCount": 1106,
      "subEntries": []
    },
    {
      "id": "Reference_disp_MdispHookFunction",
      "version": null,
      "title": "MdispHookFunction",
      "subTitles": null,
      "location": "MIL Reference",
      "pageURL": "content\\Reference\\disp\\MdispHookFunction.htm",
      "text": " MdispHookFunction Synopsis Hook a function to a display event. Syntax void MdispHookFunction( MIL_ID&nbsp;DisplayId, //in MIL_INT&nbsp;HookType, //in MIL_DISP_HOOK_FUNCTION_PTR&nbsp;HookHandlerPtr, //in void&nbsp;*UserDataPtr //in-out ) Description This function allows you to attach or detach a user-defined function to a specified display event. Once a hook-handler function is defined and hooked to an event, it is automatically called when the event occurs. You can hook more than one function to an event by making separate calls to MdispHookFunction() for each function that you want to hook. MIL automatically chains and keeps an internal list of all these hooked functions. When a function is hooked, this new function is added to the end of the list. When the event happens, all user-defined functions in the list will be executed in the same order that they were hooked to the event. You can also remove any function from the list; in this case, MIL preserves the order of the remaining functions in the list. Note that this function is not available on network displays. Parameters Parameters DisplayId Specifies the identifier of the target display. HookType Specifies the display event type. This parameter can be set to the following: For specifying the display event type Value Description M_KEY_CHAR Calls the hook-handler function each time the user presses a character key, while the mouse cursor is in the display. M_KEY_DOWN Calls the hook-handler function each time the user presses a keyboard key, while the mouse cursor is in the display. M_KEY_UP Calls the hook-handler function each time the user releases a keyboard key, while the mouse cursor is in the display. M_MOUSE_LEFT_BUTTON_DOWN Calls the hook-handler function each time the user clicks the left mouse button, while the mouse cursor is in the display. M_MOUSE_LEFT_BUTTON_UP Calls the hook-handler function each time the user releases the left mouse button, while the mouse cursor is in the display. M_MOUSE_LEFT_DOUBLE_CLICK Calls the hook-handler function each time the user double-clicks the left mouse button, while the mouse cursor is in the display. M_MOUSE_MIDDLE_BUTTON_DOWN Calls the hook-handler function each time the user clicks the middle mouse button, while the mouse cursor is in the display. M_MOUSE_MIDDLE_BUTTON_UP Calls the hook-handler function each time the user releases the middle mouse button, while the mouse cursor is in the display. M_MOUSE_MOVE Calls the hook-handler function each time the mouse cursor moves, while in the display. M_MOUSE_RIGHT_BUTTON_DOWN Calls the hook-handler function each time the user clicks the right mouse button, while the mouse cursor is in the display. M_MOUSE_RIGHT_BUTTON_UP Calls the hook-handler function each time the user releases the right mouse button, while the mouse cursor is in the display. M_MOUSE_WHEEL Calls the hook-handler function each time the user scrolls the mouse wheel (up or down), while the mouse cursor is in the display. Combination value for the values listed in For specifying the display event type. You can add the following value to the above-mentioned values to set whether to detach the hook-handler function. For detaching the hook-handler function Combination value Description M_UNHOOK Unhooks the specified function if hooked to the specified event. When you use M_UNHOOK, you must provide the same values for all the parameters as when you originally hooked the function. HookHandlerPtr Specifies the address of the function that should be called when the specified event occurs. The hook-handler function, pointed to by HookHandlerPtr, must be declared as follows: MIL_INT MFTYPE HookHandler( MIL_INT HookType, MIL_ID EventId, void *UserDataPtr ) Parameters HookType Type of event hooked. EventId Event identifier to pass to MdispGetHookInfo() when inquiring about the hooked event. UserDataPtr Data pointer that was passed to MdispHookFunction(). Upon successful completion, the hook-handler function should return M_NULL. Note, MFTYPE and MIL_DISP_HOOK_FUNCTION_PTR are reserved MIL predefined types for functions and data pointers. UserDataPtr Specifies the address of the user data that you want to make available to the hook-handler function. This address is passed to the hook-handler function, through its UserDataPtr parameter, when the specified event occurs. Set this parameter to M_NULL if not used. Compilation information Header Include mil.h. Library Use mil.lib. DLL Requires mil.dll; mildisplay.dll. Syntax Description Parameters - DisplayId - HookType For specifying the display event type + For detaching the hook-handler function - HookHandlerPtr - UserDataPtr Compilation information ",
      "wordCount": 696,
      "subEntries": []
    },
    {
      "id": "Reference_disp_MdispInquire",
      "version": null,
      "title": "MdispInquire",
      "subTitles": null,
      "location": "MIL Reference",
      "pageURL": "content\\Reference\\disp\\MdispInquire.htm",
      "text": " MdispInquire Synopsis Inquire about a display setting. Syntax MIL_INT MdispInquire( MIL_ID&nbsp;DisplayId, //in MIL_INT64&nbsp;InquireType, //in void&nbsp;*UserVarPtr //out ) Description This function inquires about a specified display setting. Parameters Parameters DisplayId Specifies the identifier of the display. InquireType Specifies the type of display setting about which to inquire. See the Parameter associations section for possible values that can be specified. UserVarPtr Accepts the address of one of the following (see the Parameter associations section for specifics on which is expected): array of type MIL_TEXT_CHAR [optionally, in C++: a reference to a MIL_STRING] MIL_DOUBLE MIL_ID MIL_INT MIL_INT64 MIL_WINDOW_HANDLE Specifies the address in which to write the requested information. Since the MdispInquire() function also returns the requested information, you can set this parameter to M_NULL. See the Parameter associations section for possible values that can be returned. Parameter associations The tables below list possible values for the InquireType parameter and possible values returned to the UserVarPtr parameter. For all types of displays For all windowed displays For MIL windowed displays For user windowed displays For displays allocated on a DMIL remote system but displayed on the master computer Unless otherwise specified, the following InquireType parameter settings are available for all types of displays. For all types of displays InquireType Description UserVarPtr - Possible values returned M_ASSOCIATED_GRAPHIC_LIST_ID Inquires the identifier of the 2D graphics list. UserVarPtr extra info Data type info: Data type: address of a MIL_ID Data type: address of a MIL_ID M_NULL Specifies that no 2D graphics list is associated with the display. MIL 2D graphics list identifier Specifies the identifier of the 2D graphics list that is associated with the display. M_BACKGROUND_COLOR Inquires the background color of the display. UserVarPtr extra info Data type info: Data type: address of a MIL_INT Data type: address of a MIL_INT M_COLOR_BLACK Specifies the color black. M_COLOR_BLUE Specifies the color blue. M_COLOR_BRIGHT_GRAY Specifies the color bright gray. M_COLOR_CYAN Specifies the color cyan. M_COLOR_DARK_BLUE Specifies the color dark blue. M_COLOR_DARK_CYAN Specifies the color dark cyan. M_COLOR_DARK_GREEN Specifies the color dark green. M_COLOR_DARK_MAGENTA Specifies the color dark magenta. M_COLOR_DARK_RED Specifies the color dark red. M_COLOR_DARK_YELLOW Specifies the color dark yellow. M_COLOR_GRAY Specifies the color gray. M_COLOR_GREEN Specifies the color green. M_COLOR_LIGHT_BLUE Specifies the color light blue. M_COLOR_LIGHT_GRAY Specifies the color light gray. M_COLOR_LIGHT_GREEN Specifies the color light green. M_COLOR_LIGHT_WHITE Specifies the color light white. M_COLOR_MAGENTA Specifies the color magenta. M_COLOR_RED Specifies the color red. M_COLOR_WHITE Specifies the color white. M_COLOR_YELLOW Specifies the color yellow. Byte-encoded RGB value Specifies an encoded RGB value. To verify if the value is a byte-encoded RGB value, use the M_IS_RGB888 macro. To retrieve the R, G, and B components, use the M_RGB888_R, M_RGB888_G, and M_RGB888_B macros. M_CENTER_DISPLAY Inquires whether a selected image buffer should be centered in the display. UserVarPtr extra info Data type info: Data type: address of a MIL_INT Data type: address of a MIL_INT M_DISABLE Specifies that the image buffer will not be centered in the display. M_ENABLE Specifies that the image buffer will always be centered in the display, both in X and Y. M_DISPLAY_TYPE Inquires the display type. UserVarPtr extra info Data type info: Data type: address of a MIL_INT Data type: address of a MIL_INT M_EXCLUSIVE Specifies that the display is an exclusive display. This display type requires MdispSelect() to display images. M_WEB Specifies that the display is a MILweb display. This display type requires MdispSelect() to display images. M_WINDOWED Specifies that the display is a windowed display. This display type can be used with MdispSelect() and MdispSelectWindow(). A remote display requires MdispSelect() to display images. To inquire if a display is remote, use M_EXTENDED_INIT_FLAG. M_WPF Specifies that the display is a WPF display. This display type requires MdispSelect() to display images. M_EXTENDED_INIT_FLAG Inquires the initialization flag specified upon allocating the display. UserVarPtr extra info Data type info: Data type: address of a MIL_INT64 Data type: address of a MIL_INT64 M_EXCLUSIVE Specifies to present the image buffer selected for display full-screen, without a windowed border, in one of Windows desktop screens. M_WEB Specifies to present the image buffer selected for display in one or more instances of a MILweb client application (for example, running in a compatible web browser). M_WINDOWED Specifies to present the image buffer selected for display in its own window on the Windows desktop screen(s). M_WPF Specifies to present the image buffer selected for display using a MILWPFDisplay control. M_FORMAT Inquires the display's data format. UserVarPtr extra info Data type info: Data type: array of type MIL_TEXT_CHAR [optionally, in C++: MIL_STRING ] MORE Data type: array of type MIL_TEXT_CHAR [optionally, in C++: MIL_STRING ] Required array size: MdispInquire ( M_FORMAT + M_STRING_SIZE ) Note: When using C++, you can pass a reference to a MIL_STRING instead. In this case, the function will automatically determine the correct string size. M_CURRENT_RESOLUTION //For exclusive displays. Specifies to use the current resolution of the screen. MIL_TEXT(\"M_DEFAULT\") 1 //For specifying the default display format. Specifies the default display format. MIL_TEXT(\"vcf-file-name.vcf\") 1 //For exclusive displays. Specifies the name of the video configuration format (VCF) that defines the resolution and refresh rate to use. M_GRAPHIC_LIST_INTERACTIVE Inquires whether a user can interactively modify the graphics in the 2D graphics list associated with the display. UserVarPtr extra info Data type info: Data type: address of a MIL_INT Data type: address of a MIL_INT M_DEFAULT Same as M_DISABLE. M_DISABLE Specifies that the 2D graphics list associated with the display cannot be affected by user interaction. M_ENABLE Specifies that the 2D graphics list associated with the display can be affected by user interaction. M_GRAPHIC_LIST_OPACITY Inquires the opacity of annotations generated from the 2D graphics list associated with the display. UserVarPtr extra info Data type info: Data type: address of a MIL_INT Data type: address of a MIL_INT M_DISABLE Specifies not to use partial opacity. 0 &lt;= Value &lt;= 100 Specifies the opacity (as a percentage), where 0 is completely transparent and 100 is completely opaque. M_INTERPOLATION_MODE Inquires the type of interpolation used to display a zoomed image. UserVarPtr extra info Data type info: Data type: address of a MIL_INT Data type: address of a MIL_INT M_AVERAGE Specifies averaging interpolation. M_INTERPOLATE Specifies interpolated resizing. M_MAX Specifies an interpolation based on the maximum pixel value in the specified source image. M_MIN Specifies an interpolation based on the minimum pixel value in the specified source image. M_NEAREST_NEIGHBOR Specifies nearest neighbor interpolation. M_KEYBOARD_USE Inquires whether the user can interactively pan and zoom the display using the keyboard. UserVarPtr extra info Data type info: Data type: address of a MIL_INT Data type: address of a MIL_INT M_DISABLE Specifies that using the keyboard to perform panning and zooming is disabled. M_ENABLE Specifies that using the keyboard to perform panning and zooming is enabled. M_LUT_ID Inquires the identifier of the LUT buffer associated with the display. UserVarPtr extra info Data type info: Data type: address of a MIL_ID Data type: address of a MIL_ID M_DEFAULT Specifies that any association to a LUT buffer is removed from the specified display. M_COLORMAP_DISTINCT_256 Specifies the LUT buffer with a distinct colormap as the LUT buffer that is associated with the display. M_COLORMAP_GRAYSCALE Specifies the LUT buffer with a grayscale colormap as the LUT buffer that is associated with the display. M_COLORMAP_HOT Specifies the LUT buffer with a hot colormap as the LUT buffer that is associated with the display. M_COLORMAP_HUE Specifies the LUT buffer with a hue colormap as the LUT buffer that is associated with the display. M_COLORMAP_JET Specifies the LUT buffer with a jet colormap as the LUT buffer that is associated with the display. M_COLORMAP_SPECTRUM Specifies the LUT buffer with a spectrum colormap as the LUT buffer that is associated with the display. M_COLORMAP_TURBO Specifies the LUT buffer with a turbo colormap as the LUT buffer that is associated with the display. M_COLORMAP_WHEEL Specifies the LUT buffer with a colorwheel colormap as the LUT buffer that is associated with the display. M_PSEUDO Specifies the default pseudo-color LUT buffer as the LUT buffer that is associated with the display. MIL LUT buffer identifier Specifies the identifier of the custom LUT buffer (allocated with MbufAlloc1d() or MbufAllocColor() with M_LUT) that is associated with the display. M_LUT_SUPPORTED Inquires whether LUTs are supported by the display. UserVarPtr extra info Data type info: Data type: address of a MIL_INT Data type: address of a MIL_INT M_NO Specifies that LUTs are not supported. M_YES Specifies that LUTs are supported. M_MOUSE_CURSOR_CHANGE Inquires whether the mouse cursor changes shape in a display with mouse-interaction enabled. UserVarPtr extra info Data type info: Data type: address of a MIL_INT Data type: address of a MIL_INT M_DEFAULT For user-defined windowed displays, this value is the same as M_DISABLE; for MIL windowed and exclusive displays, this value is the same as M_ENABLE. M_DISABLE Specifies that mouse cursor change is disabled. M_ENABLE Specifies that mouse cursor change is enabled. M_MOUSE_USE Inquires whether the user can interactively pan and zoom the display using the mouse. UserVarPtr extra info Data type info: Data type: address of a MIL_INT Data type: address of a MIL_INT M_DEFAULT For user-defined windowed displays, this value is the same as M_DISABLE; for MIL windowed and exclusive displays, this value is the same as M_ENABLE. M_DISABLE Specifies that mouse-interaction will not work inside a display. M_ENABLE Specifies that mouse-interaction will work inside a display. M_NUMBER Inquires the display device's rank in the system. Note that the returned value can also be a combination of M_TOP, M_BOTTOM, or M_CENTER + M_LEFT or M_RIGHT, specifying the position of the display device in screen arrangements of up to 3x3 screens. UserVarPtr extra info Data type info: Data type: address of a MIL_INT Data type: address of a MIL_INT M_DEFAULT Specifies that MIL will use the most appropriate device for display purposes. M_BOTTOM Specifies to use the bottom-most device for an exclusive display. M_BOTTOM + M_LEFT Specifies to use the bottom left device for an exclusive display. M_BOTTOM + M_RIGHT Specifies to use the bottom right device for an exclusive display. M_CENTER Specifies to use the center device for an exclusive display. M_CENTER + M_LEFT Specifies to use the center left device for an exclusive display. M_CENTER + M_RIGHT Specifies to use the center right device for an exclusive display. M_LEFT Specifies to use the left-most device for an exclusive display. M_RIGHT Specifies to use the right-most device for an exclusive display. M_TOP Specifies to use the top-most device for an exclusive display. M_TOP + M_LEFT Specifies to use the top left device for an exclusive display. M_TOP + M_RIGHT Specifies to use the top right device for an exclusive display. M_OVERLAY Inquires whether or not the overlay mechanism is enabled for the display. UserVarPtr extra info Data type info: Data type: address of a MIL_INT Data type: address of a MIL_INT M_DISABLE Specifies to disable MIL's overlay mechanism. M_ENABLE Specifies to enable MIL's overlay mechanism. M_OVERLAY_ID Inquires the identifier of the overlay buffer associated with the display. Note that the overlay buffer is a normal buffer and, knowing its MIL identifier, you can perform operations on it as you would on a normal buffer (except for grabbing). UserVarPtr extra info Data type info: Data type: address of a MIL_ID Data type: address of a MIL_ID M_NULL Specifies that there is no overlay buffer associated with the display. MIL buffer identifier Specifies the MIL identifier of the overlay buffer. M_OVERLAY_OPACITY Inquires the opacity of the display's overlay buffer. Any pixels in the overlay image which have the keying color (M_TRANSPARENT_COLOR) are always transparent, regardless of this setting. UserVarPtr extra info Data type info: Data type: address of a MIL_INT Data type: address of a MIL_INT M_DISABLE Specifies not to use partial opacity. 0 &lt;= Value &lt;= 100 Specifies the opacity (as a percentage), where 0 is completely transparent and 100 is completely opaque. M_OVERLAY_SHOW Inquires the visible state of the overlay. UserVarPtr extra info Data type info: Data type: address of a MIL_INT Data type: address of a MIL_INT M_DISABLE Specifies that the overlay buffer is not visible. M_ENABLE Specifies that the overlay buffer is visible. M_OPAQUE Specifies that only the overlay buffer is visible. M_OWNER_SYSTEM Inquires the identifier of the system on which the display has been allocated. UserVarPtr extra info Data type info: Data type: address of a MIL_ID Data type: address of a MIL_ID M_DEFAULT_HOST Specifies the default Host system of the current MIL application. MIL system identifier Specifies a valid system identifier, previously allocated using MsysAlloc(). M_PAN_OFFSET_X Inquires the number of pixels in X by which the image buffer is panned. Note that when you interactively pan the image with the mouse or keyboard, M_PAN_OFFSET_X will reflect the offset of the image. UserVarPtr extra info Data type info: Data type: address of a MIL_DOUBLE Data type: address of a MIL_DOUBLE Value Specifies the number of pixels by which the image is panned horizontally. M_PAN_OFFSET_Y Inquires the number of pixels in Y by which to the image buffer is panned. Note that when you interactively pan the image with the mouse or keyboard, M_PAN_OFFSET_Y will reflect the offset of the image. UserVarPtr extra info Data type info: Data type: address of a MIL_DOUBLE Data type: address of a MIL_DOUBLE Value Specifies the number of pixels by which the image is panned vertically. M_PIXEL_FORMAT Inquires the pixel format of the current display resolution set by your graphics controller. Allocating a displayable image buffer with the same format will ensure maximum performance with regards to display updates. UserVarPtr extra info Data type info: Data type: address of a MIL_INT Data type: address of a MIL_INT M_BGR24 Specifies 24-bit BGR format. M_BGR32 Specifies 32-bit BGR format. M_MONO8 Specifies 8-bit monochrome format. M_RGB15 Specifies 15-bit RGB format. M_RGB16 Specifies 16-bit RGB format. M_YUV16_UYVY Specifies YUV16 format, stored in the UYVY order. M_YUV16_YUYV Specifies YUV16 format, stored in the YUYV order. M_REGION_INSIDE_COLOR Inquires the color that will be used to clear the pixels that are part of a region of interest associated with the selected buffer. UserVarPtr extra info Data type info: Data type: address of a MIL_INT Data type: address of a MIL_INT M_COLOR_BLACK Specifies the color black. M_COLOR_BLUE Specifies the color blue. M_COLOR_BRIGHT_GRAY Specifies the color bright gray. M_COLOR_CYAN Specifies the color cyan. M_COLOR_DARK_BLUE Specifies the color dark blue. M_COLOR_DARK_CYAN Specifies the color dark cyan. M_COLOR_DARK_GREEN Specifies the color dark green. M_COLOR_DARK_MAGENTA Specifies the color dark magenta. M_COLOR_DARK_RED Specifies the color dark red. M_COLOR_DARK_YELLOW Specifies the color dark yellow. M_COLOR_GRAY Specifies the color gray. M_COLOR_GREEN Specifies the color green. M_COLOR_LIGHT_BLUE Specifies the color light blue. M_COLOR_LIGHT_GRAY Specifies the color light gray. M_COLOR_LIGHT_GREEN Specifies the color light green. M_COLOR_LIGHT_WHITE Specifies the color light white. M_COLOR_MAGENTA Specifies the color magenta. M_COLOR_RED Specifies the color red. M_COLOR_WHITE Specifies the color white. M_COLOR_YELLOW Specifies the color yellow. Byte-encoded RGB value Specifies an encoded RGB value. To verify if the value is a byte-encoded RGB value, use the M_IS_RGB888 macro. To retrieve the R, G, and B components, use the M_RGB888_R, M_RGB888_G, and M_RGB888_B macros. M_REGION_INSIDE_SHOW Inquires how to display the pixels that are part of a region of interest associated with the selected buffer, if such a region exist. UserVarPtr extra info Data type info: Data type: address of a MIL_INT Data type: address of a MIL_INT M_GRAPHIC_LIST_OPACITY Specifies that pixels in the region are displayed with a color overlay using the opacity specified with M_GRAPHIC_LIST_OPACITY. M_OPAQUE Specifies that pixels in the region are cleared to the color specified using M_REGION_INSIDE_COLOR. M_TRANSPARENT Specifies that pixels in the region are displayed as is. M_REGION_OUTSIDE_COLOR Inquires the color that will be used to clear the pixels that are not part of a region of interest associated with the selected buffer. UserVarPtr extra info Data type info: Data type: address of a MIL_INT Data type: address of a MIL_INT M_COLOR_BLACK Specifies the color black. M_COLOR_BLUE Specifies the color blue. M_COLOR_BRIGHT_GRAY Specifies the color bright gray. M_COLOR_CYAN Specifies the color cyan. M_COLOR_DARK_BLUE Specifies the color dark blue. M_COLOR_DARK_CYAN Specifies the color dark cyan. M_COLOR_DARK_GREEN Specifies the color dark green. M_COLOR_DARK_MAGENTA Specifies the color dark magenta. M_COLOR_DARK_RED Specifies the color dark red. M_COLOR_DARK_YELLOW Specifies the color dark yellow. M_COLOR_GRAY Specifies the color gray. M_COLOR_GREEN Specifies the color green. M_COLOR_LIGHT_BLUE Specifies the color light blue. M_COLOR_LIGHT_GRAY Specifies the color light gray. M_COLOR_LIGHT_GREEN Specifies the color light green. M_COLOR_LIGHT_WHITE Specifies the color light white. M_COLOR_MAGENTA Specifies the color magenta. M_COLOR_RED Specifies the color red. M_COLOR_WHITE Specifies the color white. M_COLOR_YELLOW Specifies the color yellow. Byte-encoded RGB value Specifies an encoded RGB value. To verify if the value is a byte-encoded RGB value, use the M_IS_RGB888 macro. To retrieve the R, G, and B components, use the M_RGB888_R, M_RGB888_G, and M_RGB888_B macros. M_REGION_OUTSIDE_SHOW Inquires how to display the pixels that are not part of a region of interest associated with the selected buffer, if such a region exist. UserVarPtr extra info Data type info: Data type: address of a MIL_INT Data type: address of a MIL_INT M_GRAPHIC_LIST_OPACITY Specifies that pixels outside of the region are displayed with a color overlay using the opacity specified with M_GRAPHIC_LIST_OPACITY. M_OPAQUE Specifies that pixels outside of the region are cleared to the color specified using M_REGION_OUTSIDE_COLOR. M_TRANSPARENT Specifies that pixels outside of the region are displayed as is. M_RESTRICT_CURSOR Inquires whether the mouse cursor is restricted so that it cannot move over the exclusive display. This inquire type is only applicable to exclusive displays. UserVarPtr extra info Data type info: Data type: address of a MIL_INT Data type: address of a MIL_INT M_DISABLE Specifies to permit the mouse cursor to move over the display. M_ENABLE Specifies to restrict the mouse cursor so that it cannot move over the display. M_SCALE_DISPLAY Inquires whether a selected buffer will fill the display, maintaining its aspect ratio. UserVarPtr extra info Data type info: Data type: address of a MIL_INT Data type: address of a MIL_INT M_DISABLE Specifies that the image will not be scaled to fit the display. M_ENABLE Specifies to always scale the selected image buffer to fit the display, while keeping the same aspect ratio. M_SELECTED Inquires the identifier of the image buffer currently displayed. UserVarPtr extra info Data type info: Data type: address of a MIL_ID Data type: address of a MIL_ID M_NULL Specifies that no buffer is currently being displayed. MIL buffer identifier Specifies the MIL identifier of the image buffer selected to the display. M_SIZE_BAND Inquires the number of color bands that the display is capable of displaying. UserVarPtr extra info Data type info: Data type: address of a MIL_INT Data type: address of a MIL_INT Value Specifies the number of color bands. M_SIZE_BAND_LUT Inquires the number of color bands of the LUT (if any) associated with the display. UserVarPtr extra info Data type info: Data type: address of a MIL_INT Data type: address of a MIL_INT Value Specifies the number of color bands. M_SIZE_BIT Inquires the number of bits (depth) of the display per band. UserVarPtr extra info Data type info: Data type: address of a MIL_INT Data type: address of a MIL_INT Value Specifies the depth per band, in bits. M_SIZE_X Inquires the display's width. For windowed displays, the returned value is equal to the width of the client area of the window. For exclusive displays, the returned width is the width specified in the VCF file. For MILweb displays, the returned value is equal to the width (M_SIZE_X) of the image buffer currently selected to the display. UserVarPtr extra info Data type info: Data type: address of a MIL_INT Data type: address of a MIL_INT Value Specifies the display's width, in pixels. M_SIZE_Y Inquires the display's height. For windowed displays, the returned value is equal to the height of the client area of the window. For exclusive displays, the returned height is the height specified in the VCF file. For MILweb displays, the returned value is equal to the height (M_SIZE_Y) of the image buffer currently selected to the display. UserVarPtr extra info Data type info: Data type: address of a MIL_INT Data type: address of a MIL_INT Value Specifies the display's height, in pixels. M_TITLE Inquires the display's title. UserVarPtr extra info Data type info: Data type: array of type MIL_TEXT_CHAR [optionally, in C++: MIL_STRING ] MORE Data type: array of type MIL_TEXT_CHAR [optionally, in C++: MIL_STRING ] Required array size: MdispInquire ( M_TITLE + M_STRING_SIZE ) Note: When using C++, you can pass a reference to a MIL_STRING instead. In this case, the function will automatically determine the correct string size. MIL_TEXT(\"Title\") 1 Specifies the title of the display. M_TRANSPARENT_COLOR Inquires the transparency (keying) color. UserVarPtr extra info Data type info: Data type: address of a MIL_INT Data type: address of a MIL_INT M_COLOR_BLACK Specifies the color black. M_COLOR_BLUE Specifies the color blue. M_COLOR_BRIGHT_GRAY Specifies the color bright gray. M_COLOR_CYAN Specifies the color cyan. M_COLOR_DARK_BLUE Specifies the color dark blue. M_COLOR_DARK_CYAN Specifies the color dark cyan. M_COLOR_DARK_GREEN Specifies the color dark green. M_COLOR_DARK_MAGENTA Specifies the color dark magenta. M_COLOR_DARK_RED Specifies the color dark red. M_COLOR_DARK_YELLOW Specifies the color dark yellow. M_COLOR_GRAY Specifies the color gray. M_COLOR_GREEN Specifies the color green. M_COLOR_LIGHT_BLUE Specifies the color light blue. M_COLOR_LIGHT_GRAY Specifies the color light gray. M_COLOR_LIGHT_GREEN Specifies the color light green. M_COLOR_LIGHT_WHITE Specifies the color light white. M_COLOR_MAGENTA Specifies the color magenta. M_COLOR_RED Specifies the color red. M_COLOR_WHITE Specifies the color white. M_COLOR_YELLOW Specifies the color yellow. Byte-encoded RGB value Specifies an encoded RGB value. To verify if the value is a byte-encoded RGB value, use the M_IS_RGB888 macro. To retrieve the R, G, and B components, use the M_RGB888_R, M_RGB888_G, and M_RGB888_B macros. M_UPDATE Inquires whether MIL should update the display. UserVarPtr extra info Data type info: Data type: address of a MIL_INT Data type: address of a MIL_INT M_DISABLE Specifies not to update the display. M_ENABLE Specifies to update the display. M_UPDATE_GRAPHIC_LIST Inquires whether MIL should update the display when modifications are made to the display's associated 2D graphics list. UserVarPtr extra info Data type info: Data type: address of a MIL_INT Data type: address of a MIL_INT M_DISABLE Specifies that the display is not updated when the associated 2D graphics list is modified. M_ENABLE Specifies that the display is immediately updated when the associated 2D graphics list is modified (refresh not required). M_UPDATE_RATE Inquires the display update rate. This is the number of display updates that occurred during the last second. UserVarPtr extra info Data type info: Data type: address of a MIL_DOUBLE Data type: address of a MIL_DOUBLE 0 Specifies that the buffer selected to the display was not modified. Value &gt; 0 Specifies the display update rate. M_UPDATE_RATE_DIVIDER Inquires how often the display should be updated with buffer modifications. UserVarPtr extra info Data type info: Data type: address of a MIL_INT Data type: address of a MIL_INT Value Specifies the frequency of the update. M_UPDATE_RATE_MAX Inquires the maximum rate at which to perform updates. UserVarPtr extra info Data type info: Data type: address of a MIL_INT Data type: address of a MIL_INT M_INFINITE Specifies to perform updates as fast as possible (limited by the available bandwidth and transmission delay). Value &gt; 0 Specifies the maximum number of updates per second. M_UPDATE_SYNCHRONIZATION [This is only applicable to Windows] Inquires the update mode currently used by the display for Windows paint messages. UserVarPtr extra info Data type info: Data type: address of a MIL_INT Data type: address of a MIL_INT M_DEFAULT [This is only applicable to Windows] Specifies the default update mode. M_ASYNCHRONOUS [This is only applicable to Windows] Specifies that the display is updated when possible. M_SYNCHRONOUS [This is only applicable to Windows] Specifies that the display is updated immediately. M_VIEW_BIT_SHIFT Inquires the number of bits by which the buffer data gets shifted when M_VIEW_MODE is set to M_BIT_SHIFT. UserVarPtr extra info Data type info: Data type: address of a MIL_INT Data type: address of a MIL_INT Value Specifies the number of bits. M_VIEW_MODE Inquires how a buffer gets remapped to the display (view mode). UserVarPtr extra info Data type info: Data type: address of a MIL_INT Data type: address of a MIL_INT M_DEFAULT Specifies the default value. M_AUTO_SCALE Specifies to remap the pixel values to the display so that the minimum and maximum values in the image (not the full range of the image buffer) are set to 0 and 255, respectively. M_BIT_SHIFT Specifies to bit-shift the pixel values of the image buffer by the specified number of bits upon updating the display. M_MULTI_BYTES Specifies to display each byte of the image buffer in separate display pixels. M_TRANSPARENT Specifies that no pixel remapping will be performed. M_ZOOM_FACTOR_X Inquires the zoom factor in the X-direction. Note that when you interactively zoom the image with the mouse or keyboard, M_ZOOM_FACTOR_X will reflect the zoom of the image. UserVarPtr extra info Data type info: Data type: address of a MIL_DOUBLE Data type: address of a MIL_DOUBLE Value &gt; 0.0 Specifies the zoom factor for the X-direction of the display. M_ZOOM_FACTOR_Y Inquires the zoom factor in the Y-direction. Note that when you interactively zoom the image with the mouse or keyboard, M_ZOOM_FACTOR_Y will reflect the zoom of the image. UserVarPtr extra info Data type info: Data type: address of a MIL_DOUBLE Data type: address of a MIL_DOUBLE Value &gt; 0.0 Specifies the zoom factor for the Y-direction of the display. 1 If the value was passed in a variable, it won't be returned enclosed in MIL_TEXT(). Combination value for [when InquireType=M_EXTENDED_INIT_FLAG and UserVarPtr=M_EXCLUSIVE: M_EXCLUSIVE ], [when InquireType=M_EXTENDED_INIT_FLAG and UserVarPtr=M_WINDOWED: M_WINDOWED]. The following value might be combined with the above-mentioned values to determine whether the display was allocated on a remote computer. Returns whether the display was allocated on a remote computer Combination value Description M_REMOTE_DISPLAY Specifies that the display is displayed on the remote computer in a DMIL application. Combination value for M_FORMAT , M_TITLE. You can add the following value to the above-mentioned values to get the string's length. For getting the string size InquireType Description MIL system-specifictooltip () UserVarPtr - Possible values returned M_STRING_SIZE Retrieves the length of the string, including the terminating null character (\"\\0\").  UserVarPtr extra info Data type info: Data type: address of a MIL_INT Data type: address of a MIL_INT  Combination values for [when InquireType=M_DISPLAY_TYPE and UserVarPtr=M_EXCLUSIVE: M_EXCLUSIVE ], [when InquireType=M_DISPLAY_TYPE and UserVarPtr=M_WINDOWED: M_WINDOWED]. One of the following values might be combined with the above-mentioned values to specify whether the display is a MIL window or a user-defined window. Returns whether the display is a MIL window or a user-defined window Combination value Description M_MIL_WINDOW Specifies that the display is a MIL display, selected using MdispSelect(). M_USER_WINDOW Specifies that the display is a user-defined display, selected using MdispSelectWindow(). The following InquireType parameter settings are available for all windowed displays. For all windowed displays InquireType Description UserVarPtr - Possible values returned M_WINDOW_ANNOTATIONS Inquires whether annotations will be drawn directly to the window's device context (DC) using GDI functions. UserVarPtr extra info Data type info: Data type: address of a MIL_INT Data type: address of a MIL_INT M_NULL [This is only applicable to Linux] Specifies to advise MIL that the X display connection has not been set. M_DISABLE [This is only applicable to Windows] Specifies not to draw directly to the window's device context using GDI functions. M_ENABLE [This is only applicable to Windows] Specifies to draw directly to the window's device context using GDI functions. Value [This is only applicable to Linux] Specifies the pointer to the X display connection. M_WINDOW_UPDATE_ON_PAINT [This is only applicable to Windows] Inquires when the display will be updated. UserVarPtr extra info Data type info: Data type: address of a MIL_INT Data type: address of a MIL_INT M_DISABLE [This is only applicable to Windows] Updates the display on reception of a WM_ERASEBKGND message in Windows. M_ENABLE [This is only applicable to Windows] Updates the display on reception of a WM_PAINT message in Windows. The following are only available for MIL windowed displays (selected using MdispSelect()) and are not available for user windowed displays (selected using MdispSelectWindow()): For MIL windowed displays InquireType Description UserVarPtr - Possible values returned M_FULL_SCREEN Inquires whether the window should be maximized and shown without the title bar or menu (full screen mode). UserVarPtr extra info Data type info: Data type: address of a MIL_INT Data type: address of a MIL_INT M_DISABLE Specifies that the window will not be maximized and shown with the title bar and menu. M_ENABLE Specifies that the window will be maximized and shown without the title bar or menu. M_WINDOW_HANDLE Inquires the Windows handle (HWND) of the display's window. UserVarPtr extra info Data type info: Data type: address of a MIL_WINDOW_HANDLE Data type: address of a MIL_WINDOW_HANDLE Value Specifies the Windows handle of the display's window. M_WINDOW_INITIAL_POSITION_X Inquires the initial, left-most, X-coordinate specified for the window. UserVarPtr extra info Data type info: Data type: address of a MIL_INT Data type: address of a MIL_INT Value Specifies the X-coordinate, in pixels. M_WINDOW_INITIAL_POSITION_Y Inquires the initial, left-most, Y-coordinate specified for the window. UserVarPtr extra info Data type info: Data type: address of a MIL_INT Data type: address of a MIL_INT Value Specifies the Y-coordinate, in pixels. M_WINDOW_INITIAL_SIZE_X Inquires the initial width of the window. UserVarPtr extra info Data type info: Data type: address of a MIL_INT Data type: address of a MIL_INT M_DEFAULT Specifies that MIL will calculate the optimal width. Value &gt; 0 Specifies the width, in pixels. M_WINDOW_INITIAL_SIZE_Y Inquires the initial height of the window. UserVarPtr extra info Data type info: Data type: address of a MIL_INT Data type: address of a MIL_INT M_DEFAULT Specifies that MIL will calculate the optimal height. Value &gt; 0 Specifies the height, in pixels. M_WINDOW_MAXBUTTON [This is only applicable to Windows] Inquires whether the window's maximize button should be visible. UserVarPtr extra info Data type info: Data type: address of a MIL_INT Data type: address of a MIL_INT M_DEFAULT [This is only applicable to Windows] Same as M_ENABLE. M_DISABLE [This is only applicable to Windows] Specifies that the button is not visible. M_ENABLE [This is only applicable to Windows] Specifies that the button is visible. M_WINDOW_MINBUTTON [This is only applicable to Windows] Inquires whether the window's minimize button should be visible. UserVarPtr extra info Data type info: Data type: address of a MIL_INT Data type: address of a MIL_INT M_DEFAULT [This is only applicable to Windows] Same as M_ENABLE. M_DISABLE [This is only applicable to Windows] Specifies that the button is not visible. M_ENABLE [This is only applicable to Windows] Specifies that the button is visible. M_WINDOW_MOVE [This is only applicable to Windows] Inquires whether window movement is allowed. UserVarPtr extra info Data type info: Data type: address of a MIL_INT Data type: address of a MIL_INT M_DISABLE [This is only applicable to Windows] Specifies not to allow window movement. M_ENABLE [This is only applicable to Windows] Specifies to allow window movement. M_WINDOW_OVERLAP [This is only applicable to Windows] Inquires whether the window can be overlapped by another. UserVarPtr extra info Data type info: Data type: address of a MIL_INT Data type: address of a MIL_INT M_DISABLE [This is only applicable to Windows] Specifies not to allow the window to be overlapped by another (keep window on top). M_ENABLE [This is only applicable to Windows] Specifies to allow the window to be overlapped by another. M_WINDOW_RESIZE [This is only applicable to Windows] Inquires whether window resizing is allowed. UserVarPtr extra info Data type info: Data type: address of a MIL_INT Data type: address of a MIL_INT M_DISABLE [This is only applicable to Windows] Specifies not to allow window resizing. M_ENABLE [This is only applicable to Windows] Specifies to allow window resizing. M_WINDOW_SHOW Inquires whether to show or hide the window. UserVarPtr extra info Data type info: Data type: address of a MIL_INT Data type: address of a MIL_INT M_DISABLE Specifies that the window should be hidden. M_ENABLE Specifies that the window should be shown. M_WINDOW_SIZE_AUTO_RESET Inquires whether the window should be resized when using MdispSelect(). By default, MdispSelect() automatically resizes the MIL display window to be the same size of the selected buffer. UserVarPtr extra info Data type info: Data type: address of a MIL_INT Data type: address of a MIL_INT M_DISABLE Specifies that MIL will not resize the window. M_ENABLE Specifies that MIL will resize the window to be the same size of the selected buffer. M_WINDOW_SYSBUTTON [This is only applicable to Windows] Inquires whether the window system buttons (minimize, maximize, and close buttons) should be visible. UserVarPtr extra info Data type info: Data type: address of a MIL_INT Data type: address of a MIL_INT M_DEFAULT [This is only applicable to Windows] Same as M_ENABLE. M_DISABLE [This is only applicable to Windows] Specifies that the button is not visible. M_ENABLE [This is only applicable to Windows] Specifies that the button is visible. M_WINDOW_TITLE_BAR Inquires whether the title bar should be visible. UserVarPtr extra info Data type info: Data type: address of a MIL_INT Data type: address of a MIL_INT M_DISABLE Specifies that the title bar is not visible. M_ENABLE Specifies that the title bar is visible. M_WINDOW_TITLE_BAR_CHANGE Inquires whether the presence of the window's title bar can be toggled with the M_WINDOW_TITLE_BAR control type. UserVarPtr extra info Data type info: Data type: address of a MIL_INT Data type: address of a MIL_INT M_DISABLE Specifies not to allow toggling. M_ENABLE Specifies to allow toggling. The following are only available for user windowed displays (selected using MdispSelectWindow()) and are not available for MIL windowed displays (selected using MdispSelect()): For user windowed displays InquireType Description UserVarPtr - Possible values returned M_GTK_MODE Inquires whether the display is configured for use in a window created using the third-party GTK framework. UserVarPtr extra info Data type info: Data type: address of a MIL_INT Data type: address of a MIL_INT M_DISABLE Specifies not to configure the display for use in a window created using the GTK framework. M_ENABLE Specifies not to configure the display for use in a window created using the GTK framework. M_QT_MODE Inquires whether the display is configured for use in a window created using the third-party Qt framework. UserVarPtr extra info Data type info: Data type: address of a MIL_INT Data type: address of a MIL_INT M_DISABLE Specifies not to configure the display for use in a window created using the Qt framework. M_ENABLE Specifies to configure the display for use in a window created using the Qt framework. M_TK_MODE Inquires whether the display is configured for use in a window created using the third-party Tk framework. UserVarPtr extra info Data type info: Data type: address of a MIL_INT Data type: address of a MIL_INT M_DISABLE Specifies not to configure the display for use in a window created using the Tk framework. M_ENABLE Specifies to configure the display for use in a window created using the Tk framework. The following inquire types are only available with windowed displays allocated on a remote system but displayed on the master computer. For displays allocated on a DMIL remote system but displayed on the master computer InquireType Description UserVarPtr - Possible values returned M_ASYNC_UPDATE Inquires whether the data from the remote computer is transmitted to the master computer asynchronously or synchronously for display. UserVarPtr extra info Data type info: Data type: address of a MIL_INT Data type: address of a MIL_INT M_DEFAULT Specifies to use the default mode, which can be selected using the MILConfig utility. M_DISABLE Specifies to send display updates in synchronous mode. M_ENABLE Specifies that data will be sent asynchronously. M_COMPRESSION_TYPE [For essential MIL-Lite information, see remarks ] Inquires the way in which data is compressed when transmitted from the remote computer to the master computer for display. UserVarPtr extra info Data type info: Data type: address of a MIL_INT Data type: address of a MIL_INT M_DEFAULT Specifies to use the default compression type, which can be selected using the MILConfig utility. M_NULL Specifies that compression is disabled. M_JPEG2000_LOSSLESS Specifies that JPEG2000 lossless compression will be used. M_JPEG2000_LOSSY Specifies JPEG2000 lossy compression will be used. M_JPEG_LOSSLESS Specifies JPEG lossless compression will be used. M_JPEG_LOSSLESS_INTERLACED Specifies that JPEG lossless compression will be used in separate fields. M_JPEG_LOSSY Specifies that JPEG lossy compression will be used. M_JPEG_LOSSY_INTERLACED Specifies that JPEG lossy compression will be used in separate fields. M_Q_FACTOR [For essential MIL-Lite information, see remarks ] Inquires the quantization factor used when compressing data transmitted from the remote computer to the master computer using a lossy compression. UserVarPtr extra info Data type info: Data type: address of a MIL_INT Data type: address of a MIL_INT M_DEFAULT Specifies the default value; the default value is 80. 1 &lt;= Value &lt;= 99 Specifies the quantization factor. Return value The returned value is the requested information, cast to a MIL_INT. If the requested information does not fit into a MIL_INT, this function will return M_NULL or truncate the information. Remark [MIL-Lite] Note that during development and at runtime, compression support requires the presence of a MIL license that grants access to the compression/decompression package. This access is only granted by default with the development license dongle for the full version of MIL. In other cases, you must purchase access to this package separately. Compilation information Header Include mil.h. Library Use mil.lib. DLL Requires mil.dll; mildisplay.dll. Syntax Description Parameters - DisplayId - InquireType - UserVarPtr Parameter Associations For all types of displays + Returns whether the display was allocated on a remote computer + For getting the string size + Returns whether the display is a MIL window or a user-defined window For all windowed displays For MIL windowed displays For user windowed displays For displays allocated on a DMIL remote system but displayed on the master computer Return value Remarks Compilation information ",
      "wordCount": 6244,
      "subEntries": []
    },
    {
      "id": "Reference_disp_MdispLut",
      "version": null,
      "title": "MdispLut",
      "subTitles": null,
      "location": "MIL Reference",
      "pageURL": "content\\Reference\\disp\\MdispLut.htm",
      "text": " MdispLut Synopsis Associate a LUT buffer with a display. Syntax void MdispLut( MIL_ID&nbsp;DisplayId, //in MIL_ID&nbsp;LutBufId //in ) Description This function associates a LUT buffer with the specified display. It can also be used to disassociate a LUT from the display. If and when the display is selected (MdispSelect()), the change required to produce the display (LUT) effect occurs. MIL checks the target display to determine whether or not a LUT is supported. If not, an error is generated. When displaying using a LUT, note the following: If the LUT buffer values are changed while the image is selected on the display, the changes will not take effect until the next call is made to MdispLut(). That is, the LUT is not automatically updated when the LUT buffer is modified. You cannot select a 3-band image buffer to a display that is associated with a LUT buffer. In addition, the image buffer must be an 8- or 16-bit buffer. If these conditions are not respected, an error is generated. The view mode of the display cannot be set to M_AUTO_SCALE or M_MULTI_BYTES. The number of LUT buffer entries must be the same as the maximum number of intensities that can be represented in the displayed buffer. In other words, if you want to map an 8-bit 1-band image (that is, an image that can have 256 intensities), your LUT must also have 256 entries. To disassociate a LUT buffer from a display, call MdispLut() with M_DEFAULT. For more information, see the Lookup tables in general section of Chapter 24: Lookup tables and the Mapping 1-band images through a LUT upon display section of Chapter 25: Displaying an image. Parameters Parameters DisplayId Specifies the identifier of the display with which to associate the LUT buffer. LutBufId Specifies a LUT buffer or predefined distinct colormap. This parameter should be set to one of the following values: For the identifier of the previously allocated LUT buffer Value Description M_DEFAULT Specifies that any association to a LUT buffer is removed from the specified display. M_COLORMAP_DISTINCT_256 Specifies the LUT buffer with a distinct colormap as the LUT buffer to associate with the display. This colormap is designed to maximize the visual difference between consecutive colors. This colormap can be useful for colorizing images containing discrete objects, such as labeled blobs. Note that this colormap is periodic, meaning that if the given LUT buffer has more than 256 entries, the remaining entries will be filled starting from the first color in the colormap. M_COLORMAP_GRAYSCALE Specifies the LUT buffer with a grayscale colormap as the LUT buffer to associate with the display. This colormap transitions from black to white as the indices increase. M_COLORMAP_HOT Specifies the LUT buffer with a hot colormap as the LUT buffer to associate with the display. This colormap transitions from black, to red, to yellow, and then, to white along the RGB cube as the indices increase. This colormap can be useful for displaying infrared images. M_COLORMAP_HUE Specifies the LUT buffer with a hue colormap as the LUT buffer to associate with the display. This colormap is cyclic and transitions from red, to yellow, to green, to cyan, to blue, to magenta, and then, to red along the edge of the hue circle as the indices increase. This colormap is suitable to be repeated. This colormap is useful for displaying the hue component of an HSL image. M_COLORMAP_JET Specifies the LUT buffer with a jet colormap as the LUT buffer to associate with the display. This colormap transitions from dark blue, to blue, to cyan, to yellow, to red, and then, to dark red along the RGB cube as the indices increase. This colormap can be useful for displaying 3D elevation maps and thermal imaging. M_COLORMAP_SPECTRUM Specifies the LUT buffer with a spectrum colormap as the LUT buffer to associate with the display. This colormap transitions from red, to yellow, to green, to blue, and then, to violet along the RGB cube as the indices increase. This colormap is a representation of the visual spectrum according to wavelengths. It can also be useful for displaying 3D elevation maps and thermal imaging. M_COLORMAP_TURBO Specifies the LUT buffer with a turbo colormap as the LUT buffer to associate with the display. This colormap is an improved version of the jet colormap, with smoother color transitions. It transitions from dark blue, to blue, to cyan, to yellow, to red, and then, to dark red along the RGB cube as the indices increase. This colormap can be useful for displaying 3D elevation maps and thermal imaging. M_COLORMAP_WHEEL Specifies the LUT buffer with a colorwheel colormap as the LUT buffer to associate with the display. This colormap is cyclic and transitions from blue, to magenta, to yellow, to green, and then, to blue again as the indices increase. This colormap is designed to be perceptually uniform (a given change in data is designed to be visually perceived as an equal change in color). This colormap is suitable to be repeated. This colormap can be useful for displaying 3D elevation maps. M_PSEUDO Specifies the default pseudo-color LUT buffer as the LUT buffer to associate with the display. When this LUT is used and displaying an 8-bit image buffer, each gray intensity is displayed in a different color. MIL LUT buffer identifier Specifies the identifier of the custom LUT buffer (allocated with MbufAlloc1d() or MbufAllocColor() with M_LUT) to associate with the display. If you associate a three-band LUT buffer (RGB) with the display, and then select an image buffer to the display, the same image data is mapped through each band of the LUT, typically resulting in a color display effect (depends on the LUT values). Compilation information Header Include mil.h. Library Use mil.lib. DLL Requires mil.dll; mildisplay.dll. Syntax Description Parameters - DisplayId - LutBufId For the identifier of the previously allocated LUT buffer Compilation information ",
      "wordCount": 978,
      "subEntries": []
    },
    {
      "id": "Reference_disp_MdispPan",
      "version": null,
      "title": "MdispPan",
      "subTitles": null,
      "location": "MIL Reference",
      "pageURL": "content\\Reference\\disp\\MdispPan.htm",
      "text": " MdispPan Synopsis Pan (scroll) a display. Syntax void MdispPan( MIL_ID&nbsp;DisplayId, //in MIL_DOUBLE&nbsp;XOffset, //in MIL_DOUBLE&nbsp;YOffset //in ) Description This function associates X- and Y-panning offsets with the specified display. When an image buffer is selected for display, the image is displaced on the display, from the top-left corner of the window (for windowed displays) or the screen (for exclusive displays), according to these offsets. Note, the offsets (XOffset and YOffset) are in image pixels. Since the current zoom factors affect the displayed size of an image pixel, the panning offsets are also affected by the zoom factors. For example, if the display has an associated X-zoom factor of 4, panning by an X-offset of one image pixel results in panning by 4 pixels in the horizontal direction on the display. To center the selected image buffer in the display, use MdispControl() with M_CENTER_DISPLAY, instead of using MdispPan(). For windowed and exclusive displays, you can also pan the display interactively using the Page-up/down and arrow keys, if the keys associated with the display have not been disabled using MdispControl() with M_KEYBOARD_USE. You can also pan the display by clicking on the image and dragging in the required direction with the mouse, if the mouse associated with the display has not been disabled using MdispControl() with M_MOUSE_USE. Note that these features are not enabled by default when using a user-defined window. Note that the window must have the focus for the keys to work. To give focus to an exclusive display, you must permit the mouse cursor to move over the display, using MdispControl() with M_RESTRICT_CURSOR. Parameters Parameters DisplayId Specifies the identifier of the display. XOffset Specifies the number of image pixels by which to pan an image buffer horizontally when it is displayed. Specify the offset relative to the top-left corner of the image buffer. Specify a positive offset value to displace the image to the left. YOffset Specifies the number of image pixels by which to pan an image buffer vertically when it is displayed. Specify the offset relative to the top-left corner of the image buffer. Specify a positive offset value to displace the image upwards. Compilation information Header Include mil.h. Library Use mil.lib. DLL Requires mil.dll; mildisplay.dll. Syntax Description Parameters - DisplayId - XOffset - YOffset Compilation information ",
      "wordCount": 381,
      "subEntries": []
    },
    {
      "id": "Reference_disp_MdispSelect",
      "version": null,
      "title": "MdispSelect",
      "subTitles": null,
      "location": "MIL Reference",
      "pageURL": "content\\Reference\\disp\\MdispSelect.htm",
      "text": " MdispSelect Synopsis Select an image buffer to display. Syntax void MdispSelect( MIL_ID&nbsp;DisplayId, //in MIL_ID&nbsp;ImageBufId //in ) Description This function outputs the content of the specified image buffer to the specified MIL display. You can only display one image buffer at a time on a specific display. For a windowed display, the image is presented in a window that has the same size as the image, unless such a window would not fit on the desktop or would be too small. If the image is too large to fit in the largest possible window given the selected display resolution, the top-left corner of the image will be aligned with the top-left corner of the largest possible window, and the right and bottom portion of the image, the part that exceeds the window area, will not be displayed; to view the missing portions of the image, you can pan the displayed image (see the Panning and zooming section of Chapter 25: Displaying an image for more information). If the image is smaller in size than the smallest possible window, the image will be centered in the smallest possible window, and the surrounding area will be filled with the background color (MdispControl() with M_BACKGROUND_COLOR). If the window is enlarged or maximized, the image will remain the same size and centered. For an exclusive display, the image is presented full-screen, without a windowed border or frame, on one of the Windows desktop screens. The image is presented at the center of the screen. If the image is too large to fit on screen given the selected display resolution, the top-left corner of the image will be aligned with the top-left corner of the screen, and the right and bottom portion of the image, the part that exceeds the screen area, will not be displayed; to view the missing portions of the image, you can pan the displayed image (see the Panning and zooming section of Chapter 25: Displaying an image for more information). If the image is smaller in size than the screen area, the image will be centered on screen, and the surrounding area will be filled with the background color (MdispControl() with M_BACKGROUND_COLOR). For a MILweb display, the image is presented in one or more connected instances of a MILweb client application (typically running on a remote computer). The size of the transmitted display is the same as the size of the image buffer. If the displayed image is panned or zoomed (see the Panning and zooming section of Chapter 25: Displaying an image for more information) so that it does not fill the display, the surrounding area will be filled with the background color (MdispControl() with M_BACKGROUND_COLOR). The MILweb client application might further crop or scale the displayed image after it is transmitted. For a MIL WPF display, the image will be displayed in the MILWPFControl with the bound display Id. If the control is larger than the selected image, the remainder of the control if filled with the display's background color (MdispControl() with M_BACKGROUND_COLOR). If the control is smaller than the selected image, the image will be aligned with the top-left corner of the control; to view the rest of the image, you can pan the displayed view (see the Panning and zooming section of Chapter 25: Displaying an image for more information). You can control the displayed area using MdispControl(), MdispPan(), or MdispZoom(). For example, you can center the selected image in the display using MdispControl() with M_CENTER_DISPLAY. You can remove an image buffer selected to the display using MdispSelect() with M_NULL. For windowed displays, this closes the associated window. For exclusive displays, this causes the display to disappear, allowing the desktop to reappear on the screen. For WPF, if the display was bound to a control, the content of the control is cleared with the display's background color (MdispControl() with M_BACKGROUND_COLOR). You can only remove the entire image buffer from the display. Therefore, when displaying a parent buffer, you cannot remove one of its child buffers from the display. Note that it is not necessary to stop displaying the image buffer before selecting another buffer for display. You can annotate the image selected to the display non-destructively using the display's overlay mechanism (MdispControl() with M_OVERLAY) or using a 2D graphics list (MdispControl() with M_ASSOCIATED_GRAPHIC_LIST_ID). The display's overlay mechanism allows you to annotate the selected image using an automatically allocated, temporary, image buffer referred to as the display's overlay buffer; you can modify the overlay buffer with any function that writes to an image buffer (except a grabbing function). Annotating with a 2D graphics list allows you to annotate the selected image with the vector-based graphics in the 2D graphics list; you can add vector-based graphics to the 2D graphics list using Mgra...() and M...Draw() functions. Annotating using the latter technique avoids pixelization when the display is zoomed since the graphics are in vector format. For more information on non-destructive annotation see the Annotating the displayed image non-destructively section of Chapter 25: Displaying an image. If the selected image is calibrated, the image is not physically corrected on display. If the display is associated with an overlay buffer (MdispControl() with M_OVERLAY), the camera calibration information of the selected buffer is copied to the overlay buffer; this allows you to draw in the overlay buffer in world units. If the camera calibration information of the overlay buffer is modified using McalAssociate(), MbufClear(), or some other function, the camera calibration information of the selected buffer will not be updated accordingly. However, changing the camera calibration information of the selected buffer will re-copy the camera calibration information of the selected buffer to the overlay buffer, even if the camera calibration information of the overlay buffer was manually changed. Parameters Parameters DisplayId Specifies the identifier of the display. ImageBufId Specifies the identifier of the image buffer to display. To be displayable, this buffer must be an image buffer that has an M_IMAGE + M_DISP attribute. Set this parameter to M_NULL to stop displaying the currently selected image buffer on the specified display. Note that the image buffer and the display should be allocated on the same system. Compilation information Header Include mil.h. Library Use mil.lib. DLL Requires mil.dll; mildisplay.dll. Syntax Description Parameters - DisplayId - ImageBufId Compilation information ",
      "wordCount": 1047,
      "subEntries": []
    },
    {
      "id": "Reference_disp_MdispSelectWindow",
      "version": null,
      "title": "MdispSelectWindow",
      "subTitles": null,
      "location": "MIL Reference",
      "pageURL": "content\\Reference\\disp\\MdispSelectWindow.htm",
      "text": " MdispSelectWindow Synopsis Select an image buffer to display in a user-defined window. Syntax void MdispSelectWindow( MIL_ID&nbsp;DisplayId, //in MIL_ID&nbsp;ImageBufId, //in MIL_WINDOW_HANDLE&nbsp;ClientWindowHandle //in ) Description This function outputs the content of the specified image buffer to the specified user-defined window, using the specified MIL display. If the specified image buffer is smaller in size than the target window size, the border outside the image is not modified. If the specified buffer is larger in size than the target window, the right and bottom portion of the buffer, the part that exceeds the window, is not displayed. You can control the displayed area using MdispControl(), MdispPan(), or MdispZoom(). For example, you can center the selected image in the display using MdispControl() with M_CENTER_DISPLAY. To remove an image buffer selected to the display using MdispSelectWindow(), you can use MdispSelectWindow() with M_NULL. This leaves the associated window open but leaves it blank. Note that, to use a display with a window created using the third-party GTK, Tkinter, or Qt frameworks, you should enable a special mode. You can enable the mode using MdispControl() with M_GTK_MODE, M_TK_MODE, or M_QT_MODE, respectively. These modes prevent the display from appearing incorrectly when the window is moved or resized, while introducing a small amount of latency. This function only supports local windowed displays (MdispAlloc() with M_WINDOWED and without M_REMOTE_DISPLAY). To select an image buffer to all other display types, use MdispSelect(). Parameters Parameters DisplayId Specifies the identifier of the display. The display must have been previously allocated using MdispAlloc with M_WINDOWED (and without M_REMOTE_DISPLAY). ImageBufId Specifies the image buffer to display. To be displayable, this buffer must be an image buffer that has an M_IMAGE + M_DISP attribute. Set this parameter to M_NULL to stop displaying the currently selected image buffer on the specified display. ClientWindowHandle Specifies the window handle of the user-defined window or child window. This window must have a window handle of type HWND or X11. For example, the Windows API functions can create a window with an HWND handle, and third-party functions (like Qt) can create an X11 window handle. If this parameter is set to zero, this function behaves like MdispSelect(). Set this parameter to M_NULL if the ImageBufId parameter is set to M_NULL. Compilation information Header Include windows.h; mil.h (windows.h must be included first). Library Use mil.lib. DLL Requires mil.dll; mildisplay.dll. Syntax Description Parameters - DisplayId - ImageBufId - ClientWindowHandle Compilation information ",
      "wordCount": 400,
      "subEntries": []
    },
    {
      "id": "Reference_disp_MdispZoom",
      "version": null,
      "title": "MdispZoom",
      "subTitles": null,
      "location": "MIL Reference",
      "pageURL": "content\\Reference\\disp\\MdispZoom.htm",
      "text": " MdispZoom Synopsis Zoom a display. Syntax void MdispZoom( MIL_ID&nbsp;DisplayId, //in MIL_DOUBLE&nbsp;XFactor, //in MIL_DOUBLE&nbsp;YFactor //in ) Description This function associates a zoom factor in X and/or in Y with the specified display. When an image buffer is selected for display, it will be zoomed according to these factors. The image buffer is displayed starting from its top-left corner, unless panning is also associated with the display (using MdispPan()). Instead of explicitly specifying a zoom factor, you can automatically scale the selected image buffer to fit the display, using MdispControl() with M_SCALE_DISPLAY. M_SCALE_DISPLAY ensures that the image aspect ratio is maintained. If you use M_SCALE_DISPLAY, the explicitly specified zoom factors (MdispZoom()) and pan settings (MdispPan()) will be overwritten. For windowed and exclusive displays, you can also zoom the display interactively using the + and - keys, if the keys associated with the display have not been disabled using MdispControl() with M_KEYBOARD_USE. Note that the window must have the focus for the keys to work. To give focus to an exclusive display, you must permit the mouse cursor to move over the display, using MdispControl() with M_RESTRICT_CURSOR. Once you have permitted the mouse cursor to move over the display, you can use the mouse wheel to zoom in or out of the image interactively; to do so, scroll the wheel up or down, respectively. Parameters Parameters DisplayId Specifies the identifier of the display. XFactor Specifies the zoom factor for the X-direction of the display. This parameter must be set to one of the following values: For specifying the zoom factor in the X-direction Value Description Value &gt; 0.0 Specifies the zoom factor for the X-direction of the display. A value greater than 1.0 will zoom in, while a factor less than 1.0 will zoom out. YFactor Specifies the zoom factor for the Y-direction of the display. This parameter must be set to one of the following values: For specifying the zoom factor in the Y-direction Value Description Value &gt; 0.0 Specifies the zoom factor for the Y-direction of the display. A value greater than 1.0 will zoom in, while a factor less than 1.0 will zoom out. Compilation information Header Include mil.h. Library Use mil.lib. DLL Requires mil.dll; mildisplay.dll. Syntax Description Parameters - DisplayId - XFactor For specifying the zoom factor in the X-direction - YFactor For specifying the zoom factor in the Y-direction Compilation information ",
      "wordCount": 395,
      "subEntries": []
    }
  ]
}]