[{
  "id": "Reference_seq",
  "version": "2024020714",
  "title": "seq",
  "subTitles": null,
  "location": "MIL Reference",
  "pageURL": "content\\Reference\\seq\\ModuleInformation.htm",
  "text": " Mseq functions Synopsis The functions prefixed with Mseq make up the Sequence module. The Sequence module allows you to allocate and control a sequence context. This module can perform compressing and decompressing operations on sequences of image buffers and save the result to a file. Functions MseqAlloc MseqControl MseqDefine MseqFeed MseqFree MseqGetHookInfo MseqHookFunction MseqInquire MseqProcess ",
  "wordCount": 57,
  "subEntries": [
    {
      "id": "Reference_seq_MseqAlloc",
      "version": null,
      "title": "MseqAlloc",
      "subTitles": null,
      "location": "MIL Reference",
      "pageURL": "content\\Reference\\seq\\MseqAlloc.htm",
      "text": " MseqAlloc Synopsis Allocate a sequence context. Syntax MIL_ID MseqAlloc( MIL_ID&nbsp;SystemId, //in MIL_INT64&nbsp;SequenceType, //in MIL_INT64&nbsp;Operation, //in MIL_UINT32&nbsp;OutputFormat, //in MIL_INT64&nbsp;InitFlag, //in MIL_ID&nbsp;*ContextSeqIdPtr //out ) Description This function allocates a sequence context on the specified system. A sequence context establishes the sequence operation that should be performed when a sequence processing operation is started using MseqProcess() and contains all the information necessary to perform it. Define the source of an input or the destination(s) of an output for a sequence operation using MseqDefine(). Specify the operation settings of the sequence operation and adjust the settings of the source(s) and destination(s) using MseqControl(). H.264 video encoding is optimized for Intel CPUs and can be subject to performance and stability issues when used with other CPUs. When the sequence context is no longer required, release it using MseqFree() unless M_UNIQUE_ID was specified during allocation; if M_UNIQUE_ID was specified, the smart identifier manages the sequence context's lifetime and you must not manually free it. Parameters Parameters SystemId Specifies the system on which to allocate the sequence context. This parameter should be set to one of the following values: For specifying the system Value Description M_DEFAULT_HOST Specifies the default Host system of the current MIL application. MIL system identifier Specifies a valid system identifier, previously allocated using MsysAlloc(). SequenceType Reserved for future expansion. This parameter must be set to M_DEFAULT. Operation Specifies the operation that the sequence processing session should perform. For specifying the operation performed by the sequence processing session Value Description M_SEQ_COMPRESS Specifies that the sequence processing operation will compress a sequence of images into an H.264 elementary video stream. M_SEQ_DECOMPRESS Specifies that the sequence processing operation will decompress an H.264 elementary video stream. OutputFormat Specifies the format to use to create the internal output buffer. For specifying the output format to use Value Description M_DEFAULT Specifies the default output format. For example, for a compression operation, the format is H.264. InitFlag Specifies the underlying hardware or software used for the operation. For specifying the underlying hardware or software used for the operation. Value Description M_DEFAULT [For essential MIL-Lite information, see remarks ] Same as M_QSV. M_QSV [For essential MIL-Lite information, see remarks ] Specifies to perform the operation using the Intel QSV engine. If your processor does not have a QSV engine, MIL will perform the operation in software. You can force the operation to be performed in hardware or software by combining M_QSV with M_HARDWARE or M_SOFTWARE, respectively. Combination values that can be used alone or as combination values for M_QSV. You can use one of the following values on its own, or add it to the above-mentioned value, to set whether the operation will be performed in hardware or software. For specifying whether the operation is performed in hardware or software Value Description M_HARDWARE Specifies to perform the operation in hardware; MIL will select the first hardware accelerated device it detects. If no hardware acceleration is present on your computer, an error is generated. M_SOFTWARE Specifies to perform the operation in software. ContextSeqIdPtr Specifies the address of the variable in which to write the sequence context identifier or specifies the data type that the function should use to return the sequence context identifier. For retrieving the identifier or specifying how to return it Value Description M_NULL Specifies that you will use this function's return value to obtain the identifier of the allocated sequence context ; in this case, a standard MIL identifier of type MIL_ID is returned. M_UNIQUE_ID Specifies that you will use this function's return value to obtain the identifier of the allocated sequence context ; in this case, a MIL smart identifier of type MIL_UNIQUE_SEQ_ID is returned instead of a standard MIL identifier. This setting is only available when using C++11 (or later). A MIL smart identifier manages the lifespan of the MIL object it owns (similar to a std::unique_ptr). Note, you can use a MIL smart identifier as though it were a standard MIL identifier, except that you cannot use it to manually free the sequence context (it is freed automatically). For more information, see the MIL smart identifiers subsection of the MIL custom data types, void pointers, extensions, and portability functions section of Chapter 2: Building an application. Address in which to write the identifier Specifies the address of a MIL_ID in which to write the identifier of the allocated sequence context. If allocation fails, M_NULL is written as the identifier. Return value The returned value is the sequence context identifier either as a standard identifier (MIL_ID) or a smart identifier (MIL_UNIQUE_SEQ_ID). If allocation fails, M_NULL is returned (or nullptr if M_UNIQUE_ID was specified). Remark [MIL-Lite] Note that during development and at runtime, compression support, particularly for an M_QSV buffer type, requires the presence of a MIL license that grants access to the compression/decompression package. This access is only granted by default with the development license dongle for the full version of MIL. In other cases, you must purchase access to this package separately. Compilation information Header Include mil.h. Library Use mil.lib. DLL Requires mil.dll. Syntax Description Parameters - SystemId For specifying the system - SequenceType - Operation For specifying the operation performed by the sequence processing session - OutputFormat For specifying the output format to use - InitFlag For specifying the underlying hardware or software used for the operation. + For specifying whether the operation is performed in hardware or software - ContextSeqIdPtr For retrieving the identifier or specifying how to return it Return value Remarks Compilation information ",
      "wordCount": 913,
      "subEntries": []
    },
    {
      "id": "Reference_seq_MseqControl",
      "version": null,
      "title": "MseqControl",
      "subTitles": null,
      "location": "MIL Reference",
      "pageURL": "content\\Reference\\seq\\MseqControl.htm",
      "text": " MseqControl Synopsis Control a sequence context or an individual source or destination setting. Syntax void MseqControl( MIL_ID&nbsp;ContextSeqId, //in MIL_INT&nbsp;SequenceIndex, //in MIL_INT64&nbsp;ControlType, //in MIL_DOUBLE&nbsp;ControlValue //in ) Description This function allows you to control a sequence context or an individual source or destination setting. You cannot modify a setting while the sequence processing session is in progress (MseqProcess()). Parameters Parameters ContextSeqId Specifies the identifier of the sequence context to control. The sequence context must have been previously allocated using MseqAlloc(). SequenceIndex Specifies that the sequence context, the source of an input, or a destination of an output is controlled. Set this parameter to one of the following values: For specifying a context, or an individual source or destination Value Description M_DEFAULT Same as M_CONTEXT. M_SEQ_INPUT( MIL_INT Index ) Specifies an input of the sequence operation, whose source must be controlled. Parameters Index Specifies the index of the input. The index must be 0. M_SEQ_OUTPUT( MIL_INT Index ) Specifies an output of the sequence operation, whose destination must be controlled. An output can have multiple destinations. You must specify a combination value from the following table: To specify the index of the destination of the output to control Parameters Index Specifies the index of the output. The index must be set to 0. M_ALL Controls all the sources and destinations in the sequence context. M_CONTEXT Controls a setting of the specified sequence context. Combination value for M_SEQ_OUTPUT. You must add the following value to the above-mentioned value to specify the index of the destination of the output to control. For specifying the index of the destination of the output to control Combination value Description M_SEQ_DEST( MIL_INT Index ) Specifies the destination of the output to control. Parameters Index Specifies the index of the destination. The index must be between 0 and 31. ControlType Specifies the setting to control. See the Parameter associations section for possible values that can be specified. ControlValue Specifies the value needed for the setting. See the Parameter associations section for possible values that can be specified. Parameter associations The table below lists possible values for the ControlType and ControlValue parameters. For specifying the H.264 compression settings The following ControlType and corresponding ControlValue parameter settings are used to control the H.264 compression operation settings for the sequence context (M_CONTEXT). For specifying the H.264 compression settings ControlType Description MIL system-specifictooltip (‡) ControlValue M_BUFFER_SAMPLE Sets the size of the images contained in the elementary video stream equal to the size of a sample image buffer. ‡ MIL buffer identifier Specifies the identifier of the sample image buffer. ‡ M_SETTING_AUTO_ADJUSTMENT Sets whether to automatically adjust incompatible operation settings. Note that even with automatically adjusted settings, the processor might not be able to attain the specified settings, if the resolution of the images is very large or you are feeding the images too quickly. ‡ M_DEFAULT Same as M_DISABLE. ‡ M_DISABLE Specifies to not automatically adjust incompatible settings. An error will be generated instead. ‡ M_ENABLE Specifies to automatically adjust incompatible settings. You can inquire the values used internally, using MseqInquire() with the M_EFFECTIVE_VALUE combination constant. ‡ M_STREAM_BIT_RATE Sets the elementary video stream bit rate. The bit rate is the amount of data used to represent one second of the elementary video stream. When used with a variable bit rate, this value sets the target average bit rate. ‡ M_DEFAULT Specifies the default value; the default value is 5000 kbits/sec. ‡ Value &gt; 0 Specifies the bit rate, in Kbits/sec. ‡ M_STREAM_BIT_RATE_MAX Sets the maximum bit rate that the elementary video stream can have. When used with a constant bit rate, this value is ignored. ‡ M_DEFAULT Specifies the default value; the default value is 5000 kbits/sec. ‡ Value &gt; 0 Specifies the maximum bit rate, in Kbits/sec. ‡ M_STREAM_BIT_RATE_MODE Sets the type of bit rate the elementary video stream will have. ‡ M_DEFAULT Same as M_VARIABLE. ‡ M_CONSTANT Specifies that the bit rate will remain constant throughout the duration of the elementary video stream. You can specify the stream's bit rate using M_STREAM_BIT_RATE. ‡ M_VARIABLE Specifies that the bit rate will fluctuate depending on how compressible sections of the elementary video stream are. You can specify a target average bit rate using M_STREAM_BIT_RATE. You can specify the maximum bit rate that the elementary video stream can have using M_STREAM_BIT_RATE_MAX. ‡ M_STREAM_FRAME_RATE Sets the elementary video stream's frame rate. Increasing the frame rate requires a higher bit rate to maintain the stream's quality since more information is being output per second. ‡ M_DEFAULT Specifies the default value; the default value is 30.0 frames/sec. ‡ Value &gt; 0.0 Specifies the elementary video stream's frame rate, in frames/sec. ‡ M_STREAM_FRAME_RATE_MODE Sets how the decoding frame rate, written in the header of M_FILE destination types, is established. ‡ M_DEFAULT Same as M_CONSTANT. ‡ M_CONSTANT Specifies that the decoding frame rate written in the header of M_FILE destination types is the same as the frame rate specified with M_STREAM_FRAME_RATE. ‡ M_VARIABLE Specifies that the decoding frame rate written in the header of M_FILE destination types is the average encoding frame rate, if the processor could not encode at the specified frame rate; otherwise, the frame rate specified with M_STREAM_FRAME_RATE will be written. Setting this value should be done if you are uncertain if the processor can encode at the specified frame rate during a live grab. If you are grabbing at a rate of 40 frames/sec, for example, but the processor is encoding at a rate of 20 frames/sec, 20 frames will be missed per second. If you playback the compressed sequence at a rate of 40 frames/sec, the 20 frames that were encoded will be played back unnaturally fast (that is, in the first half-second). By setting this value, the playback rate would be set to 20 frames/sec so that the 20 frames would be played back at a more natural speed (even if there are frames missing). ‡ M_STREAM_GROUP_OF_PICTURE_SIZE Sets the group-of-pictures size. A group of pictures is defined as the number of P- or B-frames that follow each I-frame. I-frames contain all the data necessary to regenerate the original image that it represents. In contrast, P- and B-frames contain only the changes between consecutive images. Therefore, I-frames are more accurate, but less compressible. Reducing the group-of-pictures size reduces the time it takes to recover from a decrease in quality caused by a dropped frame, but it will also increase the required bit rate. ‡ M_DEFAULT Specifies the default value; the default value is 5 frames per group. ‡ Value Specifies the group-of-pictures size, in number of frames/group. Note that specifying a value of 0 will cause the sequence to be composed solely of I-frames (nearly lossless compression). ‡ M_STREAM_LEVEL Sets the H.264 compression level used by the compression operation. The compression level limits the number of macroblocks per second, which restricts the possible frame rates and bit rates for your elementary video stream. The compression level also limits the image resolution that you can specify. Setting the compression level prevents devices from attempting to playback streams that would require too much processing power and memory to decode. Higher compression levels increase the maximum number of macroblocks per second. Choose the compression level by calculating the maximum number of macroblocks per second. For information regarding setting the correct compression level, see Guidelines for setting H.264 compression controls. ‡ M_DEFAULT Same as M_LEVEL_4_2. ‡ M_LEVEL_1 Specifies the 1 compression level. ‡ M_LEVEL_1_1 Specifies the 1.1 compression level. ‡ M_LEVEL_1_2 Specifies the 1.2 compression level. ‡ M_LEVEL_1_3 Specifies the 1.3 compression level. ‡ M_LEVEL_1B Specifies the 1B compression level. ‡ M_LEVEL_2 Specifies the 2 compression level. ‡ M_LEVEL_2_1 Specifies the 2.1 compression level. ‡ M_LEVEL_2_2 Specifies the 2.2 compression level. ‡ M_LEVEL_3 Specifies the 3 compression level. ‡ M_LEVEL_3_1 Specifies the 3.1 compression level. ‡ M_LEVEL_3_2 Specifies the 3.2 compression level. ‡ M_LEVEL_4 Specifies the 4 compression level. ‡ M_LEVEL_4_1 Specifies the 4.1 compression level. ‡ M_LEVEL_4_2 Specifies the 4.2 compression level. ‡ M_LEVEL_5 Specifies the 5 compression level. ‡ M_LEVEL_5_1 Specifies the 5.1 compression level. ‡ M_LEVEL_5_2 Specifies the 5.2 compression level. ‡ M_STREAM_PROFILE Sets the H.264 compression profile. The compression profile determines the allowed complexity of the compression operation. As the complexity is increased, the video quality for a given bit rate will be higher, but more processing power will be required to compress and decompress the elementary video stream. ‡ M_DEFAULT Same as M_PROFILE_HIGH. ‡ M_PROFILE_BASELINE Specifies to use the baseline profile. The compression operation will be performed using a low level of complexity. This profile is commonly used for video conferencing and for devices with limited processing power. ‡ M_PROFILE_HIGH Specifies to use the high profile. The compression operation will be performed using a high level of complexity. This profile is commonly used in high-definition applications (such as HDTV). ‡ M_PROFILE_MAIN Specifies to use the main profile. The compression operation will be performed using a mid-level of complexity. ‡ M_STREAM_QUALITY Sets the H.264 compression operation speed/quality priority. ‡ M_DEFAULT Specifies the default value; the default value is 100. ‡ 0 &lt;= Value &lt;= 100 Specifies the speed/quality priority. 0 sets the highest priority to encoding speed and 100 sets the highest priority to quality. ‡ Compilation information Header Include mil.h. Library Use mil.lib. DLL Requires mil.dll. Syntax Description Parameters - ContextSeqId - SequenceIndex For specifying a context, or an individual source or destination + For specifying the index of the destination of the output to control - ControlType - ControlValue Parameter Associations For specifying the H.264 compression settings Compilation information ",
      "wordCount": 1588,
      "subEntries": []
    },
    {
      "id": "Reference_seq_MseqDefine",
      "version": null,
      "title": "MseqDefine",
      "subTitles": null,
      "location": "MIL Reference",
      "pageURL": "content\\Reference\\seq\\MseqDefine.htm",
      "text": " MseqDefine Synopsis Define, or redefine, a source or destination of an input or output of the sequence operation, respectively. Syntax void MseqDefine( MIL_ID&nbsp;ContextSeqId, //in MIL_INT&nbsp;SequenceIndex, //in MIL_INT64&nbsp;SequenceType, //in const void&nbsp;*Param1Ptr, //in MIL_DOUBLE&nbsp;Param2 //in ) Description This function defines, or redefines, the source of an input or a destination of an output of the sequence operation of the specified sequence context. The source of an input specifies from where to obtain the data to be operated on by the sequence processing operation, while the destinations of an output specify where to store data resulting from the sequence processing operation. You can define multiple destinations for each output of the operation, but only one source for each input of the operation. The number of inputs and outputs are operation dependent. Both a sequence compression and a sequence decompression take only one input and have only one output. If you specify an index that has already been defined, that index will be associated with the new information. If you do not want to use a destination at a specified index, redefine the destination as M_USER_HOOK. If you do not want to use a source at a specified index, redefine the source as M_USER_FEED. Parameters Parameters ContextSeqId Specifies the identifier of the sequence context. The sequence context must have been previously allocated using MseqAlloc(). SequenceIndex Specifies whether to define, or redefine, the source of an input or one of the destinations of an output for the sequence operation of the specified sequence context. Specifies the index of the input or the output whose source or destinations must be defined or redefined; respectively. For specifying an input or output of the sequence operation at a given index Value Description M_SEQ_INPUT( MIL_INT Index ) Specifies an input of the sequence operation, whose source must be defined or redefined. Parameters Index Specifies the index of the input. The index must be 0. M_SEQ_OUTPUT( MIL_INT Index ) Specifies an output of the sequence operation, whose destination must be defined or redefined. An output can have multiple destinations. You must specify a combination value from the following table: To specify the index of the destination of the output, to define or redefine Parameters Index Specifies the index of the output. The index must be set to 0. Combination value for M_SEQ_OUTPUT. You must add the following value to the above-mentioned value to specify the index of the destination of the output, to define or redefine. For specifying the index of the destination of the output to define or redefine Combination value Description M_SEQ_DEST( MIL_INT Index ) Specifies the destination of the output, to define or redefine. Parameters Index Specifies the index of the destination. The index must be between 0 and 31. SequenceType Specifies the type of source or destination to define. See the Parameter associations section for possible values that can be specified. Param1Ptr Accepts the address of one of the following (see the Parameter associations section for specifics on which is expected): array of type MIL_ID [optionally, in C++: a reference to a constant std::vector&lt;MIL_ID&gt; ] MIL_CONST_TEXT_PTR [optionally, in C++: a reference to a MIL_STRING] Specifies an attribute of the source or destination to define. Its definition is dependent on the sequence type chosen. Set this parameter to M_NULL if not used. See the Parameter associations section for possible values that can be specified. Param2 Specifies an attribute of the source or destination to define. Its definition is dependent on the sequence type chosen. Set this parameter to M_NULL if not used. When using a standard vector (std::vector) overload function in C++, you can pass M_DEFAULT to this parameter and MIL will automatically determine the size based on the number of items in the vector passed to the Param1Ptr parameter. See the Parameter associations section for possible values that can be specified. Parameter associations The table below lists possible values for the SequenceType, Param1Ptr, and Param2 parameters. For specifying the source or destination settings To specify the settings of the source or destination, set the Param1Ptr and Param2 parameters to the following values. Note that any unused parameters should be set to M_NULL. For specifying the source or destination settings SequenceType Description Param1Ptr Param2 M_BUFFER_LIST Defines the source of the input, or destination of the output, of the sequence operation as a buffer list. A buffer list cannot be used as the source of the input for a decompression operation or as the destination of the output for a compression operation Param1Ptr Data type info: Data type: array of type MIL_ID [optionally, in C++: a reference to a constant std::vector&lt;MIL_ID&gt; ] MORE Data type: array of type MIL_ID [optionally, in C++: a reference to a constant std::vector&lt;MIL_ID&gt; ] Required array size:(Param2) Specifies the address of the array containing the identifiers of the buffers on which to perform the operation. To allocate each buffer, use MbufAllocColor(). When performing a sequence processing operation (using MseqProcess()) with a buffer list as the source of the input, a call to MseqFeed() is done internally. See MseqFeed() for information regarding buffer depth and type. Param2 Specifies the number of buffers in the buffer list. M_FILE Defines the source of the input, or destination of the output, of the sequence operation as a file. Param1Ptr Data type info: Data type: address of a MIL_CONST_TEXT_PTR [optionally, in C++: MIL_STRING ] Data type: address of a MIL_CONST_TEXT_PTR [optionally, in C++: MIL_STRING ] Note: When using C++, you can pass a reference to a MIL_STRING instead. Specifies the file to use. MIL_TEXT(\"FileName\") 1 Specifies the drive, directory, and name of the file (for example, \"C:\\mydirectory\\myfile\"). If the sequence context is allocated on a remote system (under Distributed MIL), you must specify a file on the same remote computer. To do so, prefix the specified file name string with \"remote:///\" (for example, \"remote:///C:\\mydirectory\\myfile\"); otherwise, an error will occur. Param2 Specifies the format of the file. M_FILE_FORMAT_AVI Specifies that the file is in AVI format. M_FILE_FORMAT_H264 Specifies that the file is in H.264 elementary video data format. An H.264 elementary video file cannot be used as a destination for a decompression operation. M_FILE_FORMAT_MP4 Specifies that the file is in MP4 format. M_USER_FEED Defines the source of the input of the sequence operation as a manual image feed, where the images are passed individually to the sequence operation. To perform the feed, call MseqFeed() after you start the sequence processing operation using MseqProcess(). By default, the source of each input of the operation is an image feed. M_USER_HOOK Defines the destination of the output as the internal output buffer of the operation; if this is the only destination, you should use a user-defined hook function to retrieve the data before it is overwritten by the next frame of resulting data (MseqHookFunction() with M_FRAME_END). In the hook function, use MseqGetHookInfo() with M_MODIFIED_BUFFER + M_BUFFER_ID to retrieve the identifier of the internal output buffer. By default, the destination of each output is set to M_USER_HOOK. You can use hook functions to retrieve data about the internal output buffer, regardless of whether M_USER_HOOK is specified. 1 If you are passing the value in a variable, don't enclose it in MIL_TEXT(). Compilation information Header Include mil.h. Library Use mil.lib. DLL Requires mil.dll. Syntax Description Parameters - ContextSeqId - SequenceIndex For specifying an input or output of the sequence operation at a given index + For specifying the index of the destination of the output to define or redefine - SequenceType - Param1Ptr - Param2 Parameter Associations For specifying the source or destination settings Compilation information ",
      "wordCount": 1254,
      "subEntries": []
    },
    {
      "id": "Reference_seq_MseqFeed",
      "version": null,
      "title": "MseqFeed",
      "subTitles": null,
      "location": "MIL Reference",
      "pageURL": "content\\Reference\\seq\\MseqFeed.htm",
      "text": " MseqFeed Synopsis Queue an image on which to operate. Syntax void MseqFeed( MIL_ID&nbsp;ContextSeqId, //in MIL_ID&nbsp;ImageBufId, //in MIL_INT64&nbsp;InitFlag //in ) Description This function queues an image which the sequence processing session must operate on. Once queued, the image is copied to an internal buffer and the original image buffer can be used for other purposes. If you call MseqFeed() before you start the sequence processing session, an error will be generated. The sequence processing session has a limited queue size; if the queue is full and you call MseqFeed() faster than processing occurs, MseqFeed() will wait for a place in the queue to become available before returning. The specified image is copied to the internal buffer using MbufCopy(). The internal image buffer is an unsigned 8-bit YUV12 buffer. MseqFeed() does not compensate for lost data if the depth or type of the specified image buffer does not match the internal buffer (see MbufCopy() for more information regarding what happens to data when the source and destination image buffers do not match). Parameters Parameters ContextSeqId Specifies the identifier of the sequence context. The sequence context must have been previously allocated using MseqAlloc(). ImageBufId Specifies the identifier of the buffer containing the image to be queued for the sequence processing operation. InitFlag Reserved for future use. Set this parameter to M_DEFAULT. Compilation information Header Include mil.h. Library Use mil.lib. DLL Requires mil.dll. Syntax Description Parameters - ContextSeqId - ImageBufId - InitFlag Compilation information ",
      "wordCount": 242,
      "subEntries": []
    },
    {
      "id": "Reference_seq_MseqFree",
      "version": null,
      "title": "MseqFree",
      "subTitles": null,
      "location": "MIL Reference",
      "pageURL": "content\\Reference\\seq\\MseqFree.htm",
      "text": " MseqFree Synopsis Free a sequence context. Syntax void MseqFree( MIL_ID&nbsp;ContextSeqId //in ) Description This function deallocates a previously allocated sequence context. The memory reserved for the specified sequence context is released. All sequence contexts allocated on a particular system must be freed before the system can be freed, unless M_UNIQUE_ID was specified during allocation. Parameters Parameter ContextSeqId Specifies the identifier of the sequence context to deallocate. The sequence context must have been previously allocated using MseqAlloc(). Compilation information Header Include mil.h. Library Use mil.lib. DLL Requires mil.dll. Syntax Description Parameters - ContextSeqId Compilation information ",
      "wordCount": 96,
      "subEntries": []
    },
    {
      "id": "Reference_seq_MseqGetHookInfo",
      "version": null,
      "title": "MseqGetHookInfo",
      "subTitles": null,
      "location": "MIL Reference",
      "pageURL": "content\\Reference\\seq\\MseqGetHookInfo.htm",
      "text": " MseqGetHookInfo Synopsis Get information about a sequence hook event. Syntax MIL_INT MseqGetHookInfo( MIL_ID&nbsp;EventId, //in MIL_INT64&nbsp;InfoType, //in void&nbsp;*UserVarPtr //out ) Description This function allows you to get information about the sequence event that caused the hook-handler function to be called. MseqGetHookInfo() should only be called within the scope of a sequence hook-handler function (see MseqHookFunction()). Parameters Parameters EventId Specifies the sequence event identifier received by the hook-handler function. See MseqHookFunction() for more information. InfoType Specifies a combination of two values: the event type and the type of information about the event to return. See the Parameter associations section for possible values that can be specified. UserVarPtr Accepts the address of one of the following (see the Parameter associations section for specifics on which is expected): MIL_ID Specifies the address in which to write the requested information. See the Parameter associations section for possible values that can be returned. Parameter associations The table below lists possible values for the InfoType parameter and possible values returned to the UserVarPtr parameter. For retrieving the information about a sequence hook event For retrieving the information about a sequence hook event InfoType Description UserVarPtr - Possible values returned M_MODIFIED_BUFFER Retrieves information about a modified-buffer type of event. This event only occurs if the hook-handler function was hooked using MseqHookFunction(). You must specify a combination value from the following table: To get information about the internal output buffer UserVarPtr extra info Data type info: Data type: address of a MIL_ID Data type: address of a MIL_ID Combination value for M_MODIFIED_BUFFER. You must add the following value to the above-mentioned value to get information about the internal output buffer. For retrieving information about the internal output buffer InfoType Description UserVarPtr - Possible values returned M_BUFFER_ID Retrieves the MIL identifier of the internal output buffer modified by MseqProcess(). UserVarPtr extra info Data type info: Data type: address of a MIL_ID Data type: address of a MIL_ID Return value The returned value is M_NULL if successful. If the operation fails, a non-null (!M_NULL) value is returned. Compilation information Header Include mil.h. Library Use mil.lib. DLL Requires mil.dll. Syntax Description Parameters - EventId - InfoType - UserVarPtr Parameter Associations For retrieving the information about a sequence hook event + For retrieving information about the internal output buffer Return value Compilation information ",
      "wordCount": 382,
      "subEntries": []
    },
    {
      "id": "Reference_seq_MseqHookFunction",
      "version": null,
      "title": "MseqHookFunction",
      "subTitles": null,
      "location": "MIL Reference",
      "pageURL": "content\\Reference\\seq\\MseqHookFunction.htm",
      "text": " MseqHookFunction Synopsis Hook a function to a sequence event. Syntax void MseqHookFunction( MIL_ID&nbsp;ContextSeqId, //in MIL_INT&nbsp;HookType, //in MIL_SEQ_HOOK_FUNCTION_PTR&nbsp;HookHandlerPtr, //in void&nbsp;*UserDataPtr //in-out ) Description This function allows you to attach or detach a user-defined function to a specified sequence event. Once a hook-handler function is defined and hooked to an event, it is automatically called when the event occurs. You can hook more than one function to an event by making separate calls to MseqHookFunction() for each function that you want to hook. MIL automatically chains and keeps an internal list of all these hooked functions. When a function is hooked, this new function is added to the end of the list. When the event happens, all user-defined functions in the list will be executed in the same order that they were hooked to the event. You can also remove any function from the list; in this case, MIL preserves the order of the remaining functions in the list. You can obtain more information about the event from within the hook-handler function using MseqGetHookInfo(). Parameters Parameters ContextSeqId Specifies the identifier of the sequence context. The sequence context must have been previously allocated using MseqAlloc(). HookType Specifies the sequence event to which to hook the function. This parameter can be set to one of the following values: For specifying the sequence event to which to hook the function Value Description M_FRAME_END Hooks the function to the event that occurs when a frame has finished being processed. Combination value for any of the possible values of the HookType parameter. You can add the following value to the above-mentioned value to specify to unhook a hooked function. For the HookType parameter Combination value Description M_UNHOOK Unhooks the specified function if hooked to the specified event. When you use M_UNHOOK, you must provide the same values for all the parameters as when you originally hooked the function. HookHandlerPtr Specifies the address of the function that should be called when the specified event occurs. The hook-handler function, pointed to by HookHandlerPtr, must be declared as follows: MIL_INT MFTYPE HookHandler( MIL_INT HookType, MIL_ID EventId, void *UserDataPtr ) Parameters HookType Type of event hooked. EventId Event identifier to pass to MseqGetHookInfo() when inquiring about the hooked event. UserDataPtr User data pointer. Upon successful completion, the hook-handler function should return M_NULL. Note, MFTYPE and MIL_SEQ_HOOK_FUNCTION_PTR are reserved MIL predefined types for functions and data pointers. UserDataPtr Specifies the address of the user data that you want to make available to the hook-handler function. This address is passed to the hook-handler function, through its UserDataPtr parameter, when the specified event occurs. Set this parameter to M_NULL if not used. Compilation information Header Include mil.h. Library Use mil.lib. DLL Requires mil.dll. Syntax Description Parameters - ContextSeqId - HookType For specifying the sequence event to which to hook the function + For the HookType parameter - HookHandlerPtr - UserDataPtr Compilation information ",
      "wordCount": 480,
      "subEntries": []
    },
    {
      "id": "Reference_seq_MseqInquire",
      "version": null,
      "title": "MseqInquire",
      "subTitles": null,
      "location": "MIL Reference",
      "pageURL": "content\\Reference\\seq\\MseqInquire.htm",
      "text": " MseqInquire Synopsis Inquire information about a sequence context or an individual source or destination setting. Syntax MIL_INT MseqInquire( MIL_ID&nbsp;ContextSeqId, //in MIL_INT&nbsp;SequenceIndex, //in MIL_INT64&nbsp;InquireType, //in void&nbsp;*UserVarPtr //out ) Description This function inquires information about a sequence context or an individual source or destination setting. Parameters Parameters ContextSeqId Specifies the sequence context about which to inquire information. The sequence context must have been previously allocated using MseqAlloc(). SequenceIndex Specifies that the sequence context, the source of an input, or a destination of an output is inquired. Set this parameter to one of the following values: For specifying a context, or an individual source or destination Value Description M_DEFAULT Same as M_CONTEXT. M_SEQ_INPUT( MIL_INT Index ) Specifies an input of the sequence operation, whose source must be inquired. Parameters Index Specifies the index of the input. The index must be 0. M_SEQ_OUTPUT( MIL_INT Index ) Specifies an output of the sequence operation, whose destination must be inquired. An output can have multiple destinations. You must specify a combination value from the following table: To specify the index of the destination of the output to inquire Parameters Index Specifies the index of the output. The index must be set to 0. M_CONTEXT Inquires information about the specified sequence context. Combination value for M_SEQ_OUTPUT. You must add the following value to the above-mentioned value to specify the index of the destination of the output to inquire. For specifying the index of the destination of the output to inquire Combination value Description M_SEQ_DEST( MIL_INT Index ) Specifies the destination of the output to inquire. Parameters Index Specifies the index of the destination. The index must be between 0 and 31. InquireType Specifies the type of setting about which to inquire. See the Parameter associations section for possible values that can be specified. UserVarPtr Accepts the address of one of the following (see the Parameter associations section for specifics on which is expected): array of type MIL_TEXT_CHAR [optionally, in C++: a reference to a MIL_STRING] MIL_DOUBLE MIL_INT Specifies the address in which to write the requested information. Since the MseqInquire() function also returns the requested information, you can set this parameter to M_NULL, except when the specified InquireType requires the UserVarPtr parameter to be set to the address of a MIL_INT, MIL_DOUBLE, or MIL_TEXT_CHAR. In this case, you must set this parameter to the address of a MIL_INT, MIL_DOUBLE, or MIL_TEXT_CHAR, respectively. See the Parameter associations section for possible values that can be returned. Parameter associations The tables below list possible values for the InquireType parameter and possible values returned to the UserVarPtr parameter. For retrieving information about the H.264 compression operation settings For retrieving information about general individual source or destination settings For retrieving information about individual file (M_FILE) source or destination settings The following inquire types allow you to inquire the H.264 compression settings for the sequence context (M_CONTEXT). For retrieving information about the H.264 compression operation settings InquireType Description MIL system-specifictooltip (‡) UserVarPtr - Possible values returned M_CODEC_TYPE Inquires the type of codec used for the compression or decompression operation. ‡ UserVarPtr extra info Data type info: Data type: address of a MIL_INT Data type: address of a MIL_INT ‡ M_QSV + M_HARDWARE Specifies to perform the operation using hardware acceleration. ‡ M_QSV + M_SOFTWARE Specifies to perform the operation in software. ‡ M_SETTING_AUTO_ADJUSTMENT Inquires whether incompatible operation settings are automatically adjusted. ‡ UserVarPtr extra info Data type info: Data type: address of a MIL_INT Data type: address of a MIL_INT ‡ M_DISABLE Specifies to not automatically adjust incompatible settings. ‡ M_ENABLE Specifies to automatically adjust incompatible settings. ‡ M_SIZE_X Inquires the width of the elementary video stream. ‡ UserVarPtr extra info Data type info: Data type: address of a MIL_INT Data type: address of a MIL_INT ‡ Value Specifies the width, in pixels. ‡ M_SIZE_Y Inquires the height of the elementary video stream. ‡ UserVarPtr extra info Data type info: Data type: address of a MIL_INT Data type: address of a MIL_INT ‡ Value Specifies the height, in pixels. ‡ M_STREAM_BIT_RATE Inquires the elementary video stream bit rate. ‡ UserVarPtr extra info Data type info: Data type: address of a MIL_INT Data type: address of a MIL_INT ‡ Value &gt; 0 Specifies the bit rate, in Kbits/sec. ‡ M_STREAM_BIT_RATE_MAX Inquires the maximum bit rate that the elementary video stream can have. ‡ UserVarPtr extra info Data type info: Data type: address of a MIL_INT Data type: address of a MIL_INT ‡ Value &gt; 0 Specifies the maximum bit rate, in Kbits/sec. ‡ M_STREAM_BIT_RATE_MODE Inquires the type of bit rate the elementary video stream will have. ‡ UserVarPtr extra info Data type info: Data type: address of a MIL_INT Data type: address of a MIL_INT ‡ M_CONSTANT Specifies that the bit rate will remain constant throughout the duration of the elementary video stream. ‡ M_VARIABLE Specifies that the bit rate will fluctuate depending on how compressible sections of the elementary video stream are. ‡ M_STREAM_FRAME_RATE Inquires the frame rate of the elementary video stream. ‡ UserVarPtr extra info Data type info: Data type: address of a MIL_DOUBLE Data type: address of a MIL_DOUBLE ‡ Value &gt; 0.0 Specifies the elementary video stream's frame rate, in frames/sec. ‡ M_STREAM_FRAME_RATE_MODE Inquires how the decoding frame rate, written in the header of M_FILE destination types, is established. ‡ UserVarPtr extra info Data type info: Data type: address of a MIL_INT Data type: address of a MIL_INT ‡ M_CONSTANT Specifies that the decoding frame rate written in the header of M_FILE destination types is the same as the frame rate specified with M_STREAM_FRAME_RATE. ‡ M_VARIABLE Specifies that the decoding frame rate written in the header of M_FILE destination types is the average encoding frame rate, if the processor could not encode at the specified frame rate; otherwise, the frame rate specified with M_STREAM_FRAME_RATE will be written. ‡ M_STREAM_GROUP_OF_PICTURE_SIZE Inquires the group-of-pictures size. ‡ UserVarPtr extra info Data type info: Data type: address of a MIL_INT Data type: address of a MIL_INT ‡ Value Specifies the group-of-pictures size, in number of frames/group. ‡ M_STREAM_LEVEL Inquires the H.264 compression level used by the compression operation. ‡ UserVarPtr extra info Data type info: Data type: address of a MIL_INT Data type: address of a MIL_INT ‡ M_LEVEL_1 Specifies the 1 compression level. ‡ M_LEVEL_1_1 Specifies the 1.1 compression level. ‡ M_LEVEL_1_2 Specifies the 1.2 compression level. ‡ M_LEVEL_1_3 Specifies the 1.3 compression level. ‡ M_LEVEL_1B Specifies the 1B compression level. ‡ M_LEVEL_2 Specifies the 2 compression level. ‡ M_LEVEL_2_1 Specifies the 2.1 compression level. ‡ M_LEVEL_2_2 Specifies the 2.2 compression level. ‡ M_LEVEL_3 Specifies the 3 compression level. ‡ M_LEVEL_3_1 Specifies the 3.1 compression level. ‡ M_LEVEL_3_2 Specifies the 3.2 compression level. ‡ M_LEVEL_4 Specifies the 4 compression level. ‡ M_LEVEL_4_1 Specifies the 4.1 compression level. ‡ M_LEVEL_4_2 Specifies the 4.2 compression level. ‡ M_LEVEL_5 Specifies the 5 compression level. ‡ M_LEVEL_5_1 Specifies the 5.1 compression level. ‡ M_LEVEL_5_2 Specifies the 5.2 compression level. ‡ M_STREAM_PROFILE Inquires the H.264 compression profile. ‡ UserVarPtr extra info Data type info: Data type: address of a MIL_INT Data type: address of a MIL_INT ‡ M_PROFILE_BASELINE Specifies to use the baseline profile. ‡ M_PROFILE_HIGH Specifies to use the high profile. ‡ M_PROFILE_MAIN Specifies to use the main profile. ‡ M_STREAM_QUALITY Inquires the H.264 compression operation priority. ‡ UserVarPtr extra info Data type info: Data type: address of a MIL_INT Data type: address of a MIL_INT ‡ 0 &lt;= Value &lt;= 100 Specifies the speed/quality priority. ‡ Combination value for M_STREAM_BIT_RATE , M_STREAM_BIT_RATE_MAX , M_STREAM_GROUP_OF_PICTURE_SIZE , M_STREAM_LEVEL , M_STREAM_PROFILE , M_STREAM_QUALITY. You can add the following value to the above-mentioned values to get the actual values used if MseqControl() with M_SETTING_AUTO_ADJUSTMENT was set to M_ENABLE. For inquiring the actual values used Combination value Description M_EFFECTIVE_VALUE Inquires the actual value used by the compression operation. You can inquire information about the following settings for any type of individual source (M_SEQ_INPUT()) or destination (M_SEQ_OUTPUT() + M_SEQ_DEST()). For retrieving information about general individual source or destination settings InquireType Description UserVarPtr - Possible values returned M_TYPE Inquires the type of source or destination at the specified index. UserVarPtr extra info Data type info: Data type: address of a MIL_INT Data type: address of a MIL_INT M_BUFFER_LIST Specifies the source of the input, or destination of the output, of the sequence operation is a buffer list. M_FILE Specifies the source of the input, or destination of the output, of the sequence operation is a file. M_USER_FEED Specifies the source of the input of the sequence operation is a manual image feed, where the images are passed individually to the sequence operation. M_USER_HOOK Specifies the destination of the output is the internal output buffer of the operation; if this is the only destination, you should use a user-defined hook function to retrieve the data before it is overwritten by the next frame of resulting data (MseqHookFunction() with M_FRAME_END). You can inquire information about the following settings for individual file sources or destinations (M_SEQ_INPUT() or M_SEQ_OUTPUT() + M_SEQ_DEST() defined as M_FILE). For retrieving information about individual file (M_FILE) source or destination settings InquireType Description UserVarPtr - Possible values returned M_FILE_FORMAT Inquires the format of the file at the specified index. UserVarPtr extra info Data type info: Data type: address of a MIL_INT Data type: address of a MIL_INT M_FILE_FORMAT_AVI Specifies that the file is in AVI format. M_FILE_FORMAT_H264 Specifies that the file is in H.264 elementary video data format. M_FILE_FORMAT_MP4 Specifies that the file is in MP4 format. M_STREAM_FILE_NAME Inquires the name of the file at the specified index. UserVarPtr extra info Data type info: Data type: array of type MIL_TEXT_CHAR [optionally, in C++: MIL_STRING ] MORE Data type: array of type MIL_TEXT_CHAR [optionally, in C++: MIL_STRING ] Required array size: MseqInquire ( M_STREAM_FILE_NAME + M_STRING_SIZE ) Note: When using C++, you can pass a reference to a MIL_STRING instead. In this case, the function will automatically determine the correct string size. Value Specifies the file name. Combination value for M_STREAM_FILE_NAME. You can add the following value to the above-mentioned value to get the string's length. For getting the string size InquireType Description UserVarPtr - Possible values returned M_STRING_SIZE Retrieves the length of the string, including the terminating null character (\"\\0\"). UserVarPtr extra info Data type info: Data type: address of a MIL_INT Data type: address of a MIL_INT Return value The returned value is the requested information, cast to a MIL_INT. If the requested information does not fit into a MIL_INT, this function will return M_NULL or truncate the information. Compilation information Header Include mil.h. Library Use mil.lib. DLL Requires mil.dll. Syntax Description Parameters - ContextSeqId - SequenceIndex For specifying a context, or an individual source or destination + For specifying the index of the destination of the output to inquire - InquireType - UserVarPtr Parameter Associations For retrieving information about the H.264 compression operation settings + For inquiring the actual values used For retrieving information about general individual source or destination settings For retrieving information about individual file (M_FILE) source or destination settings + For getting the string size Return value Compilation information ",
      "wordCount": 1844,
      "subEntries": []
    },
    {
      "id": "Reference_seq_MseqProcess",
      "version": null,
      "title": "MseqProcess",
      "subTitles": null,
      "location": "MIL Reference",
      "pageURL": "content\\Reference\\seq\\MseqProcess.htm",
      "text": " MseqProcess Synopsis Starts or stops a sequence processing session. Syntax void MseqProcess( MIL_ID&nbsp;ContextSeqId, //in MIL_INT64&nbsp;Command, //in MIL_INT64&nbsp;CommandFlag //in ) Description This function starts or stops a sequence processing session. The sequence processing session performs the operation specified in the sequence context. If you define a file (M_FILE) or buffer list (M_BUFFER_LIST) as the source of the input for the operation, the sequence processing session performs the operation as soon as the session is started (M_START). You can specify a synchronous (M_SYNCHRONOUS) or asynchronous (M_ASYNCHRONOUS) operation. For synchronous operations, the application will wait until the operation has finished before executing the next function; whereas, for asynchronous operations, other functions can execute while the operation is performed in a background thread. If you define an image feed as the source (M_USER_FEED) and call MseqProcess() with M_START, the sequence processing session will wait for an image to be queued using MseqFeed(). As soon as an image is queued, the sequence processing session operates on it. If no images are queued, the sequence processing session idles and waits for images from MseqFeed(). You can only call MseqFeed() if the session has been started and set to M_ASYNCHRONOUS. While you cannot start multiple sequence processing sessions simultaneously for a sequence context, you can allocate multiple sequence contexts and start a separate sequence processing session for each context. To stop the sequence processing session immediately, without finishing the operation, use M_STOP with M_NULL. To wait for the sequence processing session to complete the operation completely, use M_STOP with M_WAIT. H.264 video encoding is optimized for Intel CPUs and can be subject to performance and stability issues when used with other CPUs. Parameters Parameters ContextSeqId Specifies the identifier of the sequence context. The sequence context must have been previously allocated using MseqAlloc(). Command Specifies the command to give the sequence processing session. See the Parameter associations section for possible values that can be specified. CommandFlag Specifies the synchronization state of the sequence processing session. See the Parameter associations section for possible values that can be specified. Parameter associations The table below lists possible values for the Command and CommandFlag parameters. For starting or stopping the sequence processing session For starting or stopping the sequence processing session Command Description CommandFlag M_START Specifies to start the sequence processing session. M_ASYNCHRONOUS Specifies for the sequence processing session to run asynchronously. Other functions in your application can execute while the operation is performed in a background thread. M_SYNCHRONOUS Specifies for the sequence processing session to run synchronously. Your application will wait until the operation has finished before executing the next function. M_STOP Specifies to stop the sequence processing session. M_NULL Specifies to stop the sequence processing session immediately, cancelling any further sequence processing from occuring. M_WAIT Specifies to stop the sequence processing session only after it has finished performing the specified operation. Compilation information Header Include mil.h. Library Use mil.lib. DLL Requires mil.dll. Syntax Description Parameters - ContextSeqId - Command - CommandFlag Parameter Associations For starting or stopping the sequence processing session Compilation information ",
      "wordCount": 505,
      "subEntries": []
    }
  ]
}]