[{
  "id": "Reference_agm",
  "version": "2024020714",
  "title": "agm",
  "subTitles": null,
  "location": "MIL Reference",
  "pageURL": "content\\Reference\\agm\\ModuleInformation.htm",
  "text": " Magm functions Synopsis The functions prefixed with Magm make up the Advanced Geometric Matcher (AGM) module. The AGM module can train models from images and find occurrences of models in a target image using their extracted edges. The module can help solve machine vision problems, such as alignment, measurement, and inspection. Functions MagmAlloc MagmAllocResult MagmControl MagmCopyResult MagmDefine MagmDraw MagmFind MagmFree MagmGetResult MagmInquire MagmPreprocess MagmRestore MagmSave MagmStream MagmTrain ",
  "wordCount": 69,
  "subEntries": [
    {
      "id": "Reference_agm_MagmAlloc",
      "version": null,
      "title": "MagmAlloc",
      "subTitles": null,
      "location": "MIL Reference",
      "pageURL": "content\\Reference\\agm\\MagmAlloc.htm",
      "text": " MagmAlloc Synopsis Allocate a find or train AGM context. Syntax MIL_ID MagmAlloc( MIL_ID&nbsp;SysId, //in MIL_INT64&nbsp;ContextType, //in MIL_INT64&nbsp;ControlFlag, //in MIL_ID&nbsp;*ContextIdPtr //out ) Description This function allocates a find or train AGM context on the specified system. A find AGM context contains the information necessary to perform an MagmFind() operation, while a train AGM context contains the information necessary to perform an MagmTrain() operation. Define and add models to an AGM context using MagmDefine(). You add a single-definition model directly to a find AGM context using MagmDefine(). To add a composite-definition model to a find AGM context, you must first add the model to a train AGM context using MagmDefine(), train the model using MagmTrain(), and then copy the trained composite-definition model to the find AGM context using MagmCopyResult(). You can adjust individual model settings using MagmControl(). When the AGM context is no longer required, release it using MagmFree() unless M_UNIQUE_ID was specified during allocation; if M_UNIQUE_ID was specified, the smart identifier manages the AGM context's lifetime and you must not manually free it. Parameters Parameters SysId Specifies the system on which to allocate the context. Set this parameter to one of the following values: For specifying the system identifier Value Description M_DEFAULT_HOST Specifies the default Host system of the current MIL application. MIL system identifier Specifies a valid system identifier, previously allocated using MsysAlloc(). ContextType Specifies the type of AGM context. This parameter must be set to one of the following values: For the type of context Value Description M_GLOBAL_EDGE_BASED_FIND Specifies to allocate a find AGM context. This context contains settings and the model to find with MagmFind(). M_GLOBAL_EDGE_BASED_TRAIN Specifies to allocate a train AGM context. This context contains settings and the composite-definition model to train with MagmTrain(). ControlFlag Reserved for future expansion. This parameter must be set to M_DEFAULT. ContextIdPtr Specifies the address of the variable in which to write the AGM context identifier or specifies the data type that the function should use to return the AGM context identifier. For retrieving the identifier or specifying how to return it Value Description M_NULL Specifies that you will use this function's return value to obtain the identifier of the allocated AGM context ; in this case, a standard MIL identifier of type MIL_ID is returned. M_UNIQUE_ID Specifies that you will use this function's return value to obtain the identifier of the allocated AGM context ; in this case, a MIL smart identifier of type MIL_UNIQUE_AGM_ID is returned instead of a standard MIL identifier. This setting is only available when using C++11 (or later). A MIL smart identifier manages the lifespan of the MIL object it owns (similar to a std::unique_ptr). Note, you can use a MIL smart identifier as though it were a standard MIL identifier, except that you cannot use it to manually free the AGM context (it is freed automatically). For more information, see the MIL smart identifiers subsection of the MIL custom data types, void pointers, extensions, and portability functions section of Chapter 2: Building an application. Address in which to write the find AGM context identifier Specifies the address of a MIL_ID in which to write the identifier of the allocated find AGM context. If allocation fails, M_NULL is written as the identifier. Address in which to write the train AGM context identifier Specifies the address of a MIL_ID in which to write the identifier of the allocated train AGM context. If allocation fails, M_NULL is written as the identifier. Return value The returned value is the AGM context identifier either as a standard identifier (MIL_ID) or a smart identifier (MIL_UNIQUE_AGM_ID). If allocation fails, M_NULL is returned (or nullptr if M_UNIQUE_ID was specified). Compilation information Header Include mil.h. Library Use mil.lib; milagm.lib. DLL Requires mil.dll; milagm.dll. Syntax Description Parameters - SysId For specifying the system identifier - ContextType For the type of context - ControlFlag - ContextIdPtr For retrieving the identifier or specifying how to return it Return value Compilation information ",
      "wordCount": 656,
      "subEntries": []
    },
    {
      "id": "Reference_agm_MagmAllocResult",
      "version": null,
      "title": "MagmAllocResult",
      "subTitles": null,
      "location": "MIL Reference",
      "pageURL": "content\\Reference\\agm\\MagmAllocResult.htm",
      "text": " MagmAllocResult Synopsis Allocate a find or train AGM result buffer. Syntax MIL_ID MagmAllocResult( MIL_ID&nbsp;SysId, //in MIL_INT64&nbsp;ResultType, //in MIL_INT64&nbsp;ControlFlag, //in MIL_ID&nbsp;*ResultAgmIdPtr //out ) Description This function allocates a find or train AGM result buffer on the specified system. A find AGM result buffer stores results obtained from an MagmFind() operation, while a train AGM result buffer stores results obtained from an MagmTrain() operation. When the AGM result buffer is no longer required, release it using MagmFree() unless M_UNIQUE_ID was specified during allocation; if M_UNIQUE_ID was specified, the smart identifier manages the AGM result buffer's lifetime and you must not manually free it. Parameters Parameters SysId Specifies the system on which to allocate the result buffer. This parameter should be set to one of the following values: For specifying the system identifier Value Description M_DEFAULT_HOST Specifies the default Host system of the current MIL application. MIL system identifier Specifies a valid system identifier, previously allocated using MsysAlloc(). ResultType Specifies the type of AGM result buffer. This parameter must be set to one of the following values: For the type of results buffer Value Description M_GLOBAL_EDGE_BASED_FIND_RESULT Specifies to allocate a find AGM result buffer. This result buffer holds the results produced from calling MagmFind(). M_GLOBAL_EDGE_BASED_TRAIN_RESULT Specifies to allocate a find AGM result buffer. This result buffer holds the results produced from calling MagmTrain(). ControlFlag Reserved for future expansion. This parameter must be set to M_DEFAULT. ResultAgmIdPtr Specifies the address of the variable in which to write the AGM result buffer identifier. Since the MagmAllocResult() function also returns the AGM result buffer identifier, you can set this parameter to M_NULL. For retrieving the identifier or specifying how to return it Value Description M_NULL Specifies that you will use this function's return value to obtain the identifier of the allocated AGM result buffer ; in this case, a standard MIL identifier of type MIL_ID is returned. M_UNIQUE_ID Specifies that you will use this function's return value to obtain the identifier of the allocated AGM result buffer ; in this case, a MIL smart identifier of type MIL_UNIQUE_AGM_ID is returned instead of a standard MIL identifier. This setting is only available when using C++11 (or later). A MIL smart identifier manages the lifespan of the MIL object it owns (similar to a std::unique_ptr). Note, you can use a MIL smart identifier as though it were a standard MIL identifier, except that you cannot use it to manually free the AGM result buffer (it is freed automatically). For more information, see the MIL smart identifiers subsection of the MIL custom data types, void pointers, extensions, and portability functions section of Chapter 2: Building an application. Address in which to write the find AGM result buffer identifier Specifies the address of a MIL_ID in which to write the identifier of the allocated find AGM result buffer. If allocation fails, M_NULL is written as the identifier. Address in which to write the train AGM result buffer identifier Specifies the address of a MIL_ID in which to write the identifier of the allocated train AGM result buffer. If allocation fails, M_NULL is written as the identifier. Return value The returned value is the AGM result buffer identifier either as a standard identifier (MIL_ID) or a smart identifier (MIL_UNIQUE_AGM_ID). If allocation fails, M_NULL is returned (or nullptr if M_UNIQUE_ID was specified). Compilation information Header Include mil.h. Library Use mil.lib; milagm.lib. DLL Requires mil.dll; milagm.dll. Syntax Description Parameters - SysId For specifying the system identifier - ResultType For the type of results buffer - ControlFlag - ResultAgmIdPtr For retrieving the identifier or specifying how to return it Return value Compilation information ",
      "wordCount": 601,
      "subEntries": []
    },
    {
      "id": "Reference_agm_MagmControl",
      "version": null,
      "title": "MagmControl",
      "subTitles": null,
      "location": "MIL Reference",
      "pageURL": "content\\Reference\\agm\\MagmControl.htm",
      "text": " MagmControl Synopsis Control a model in an AGM context. Syntax void MagmControl( MIL_ID&nbsp;ContextId, //in MIL_INT64&nbsp;Index, //in MIL_INT64&nbsp;ControlType, //in MIL_DOUBLE&nbsp;ControlValue //in ) Description This function allows you to control a setting of a single-definition or composite-definition model in a find AGM context, or of a composite-definition model in a train AGM context. These settings control the execution of MagmFind() or MagmTrain() operations. Most of the control type settings can be inquired using MagmInquire(). Note that when using a C compiler (not a C++ or other compiler) in 64-bit mode, MagmControl() internally calls the MIL_DOUBLE version of this function (MagmControlDouble()). If you need to pass large integer values (including pointers), call the MIL_INT64 version of this function (MagmControlInt64()). Parameters Parameters ContextId Specifies the identifier of a find or train AGM context to control. See the Parameter associations section for possible values that can be specified. Index Specifies what to control. Set this parameter to one of the following values: For specifying a model Value Description M_AGM_MODEL_INDEX( MIL_INT ModelIndex ) Specifies to control an individual model. Parameters ModelIndex Set this parameter to the following: 0 Specifies the index of the model. ControlType Specifies the setting to change. See the Parameter associations section for possible values that can be specified. ControlValue Specifies the setting's new value. See the Parameter associations section for possible values that can be specified. Parameter associations The table below lists possible values for the ContextId, ControlType, and ControlValue parameters. For controlling a model in an AGM context The following ContextId, ControlType, and ControlValue parameter settings can be specified for models in AGM contexts. For controlling a model in an AGM context ContextId Description ControlType ControlValue Find AGM context ID with a composite-definition model Specifies a find AGM context, allocated using MagmAlloc() with M_GLOBAL_EDGE_BASED_FIND and used in MagmFind() operations. It must contain a trained composite-definition model. M_ACCEPTANCE_COVERAGE Sets the minimum coverage score required for an occurrence to be considered a match. The coverage score is the percentage of the total length of the model's edgels found in the occurrence. 100% indicates that for each of the model's edgels, a corresponding edgel was found in the occurrence. Note, a model's edgel corresponds to an edgel in the occurrence if the distance between them is less than or equal to M_MAX_ASSOCIATION_DISTANCE. M_DEFAULT Specifies the default value; the default value is 0.0%. 0.0 &lt;= Value &lt;= 100.0 Specifies the minimum acceptable coverage score, as a percentage. M_ACCEPTANCE_DETECTION Sets the minimum detection score required for an occurrence to be considered a match. The detection score represents how confident you should be that MIL found a true occurrence. Note, this value is only used if M_ACCEPTANCE_DETECTION_SOURCE is set to M_USER_DEFINED. M_DEFAULT Specifies the default value; the default value is 60.0%. 0.0 &lt;= Value &lt;= 100.0 Specifies the minimum acceptable detection score, as a percentage. M_ACCEPTANCE_DETECTION_SOURCE Sets whether to use the trained acceptance level or a custom acceptance level for the detection score. You can typically start with the acceptance level established during training and specify a higher acceptance level if the search speed is too slow, or if the search finds false occurrences. You should specify a lower acceptance level if the search does not find all model occurrences. M_DEFAULT Same as M_FROM_TRAIN. M_FROM_TRAIN Specifies to use the detection score's acceptance level established during the training of the model. M_USER_DEFINED Specifies to use the value set with M_ACCEPTANCE_DETECTION. M_ACCEPTANCE_FIT Sets the minimum fit score required for an occurrence to be considered a match. The fit score is a measure of the correlation of the edgels in the model to those of the occurrence. It is based on the distance between the model's edgels and the occurrence's edgels. Note, only those model edgels that are less than or equal to M_MAX_ASSOCIATION_DISTANCE from an occurrence edgel are used in the fit score calculation. M_DEFAULT Specifies the default value; the default value is 0.0%. 0.0 &lt;= Value &lt;= 100.0 Specifies the minimum acceptable fit score, as a percentage. M_FIT_MODE Sets the mode of the fit operation. The fit mode affects positional accuracy and search speed. The positional results are most accurate when the fit operation uses subpixel precision, but this can reduce the speed of the search. Note that the fit can only be calculated with subpixel precision when you have explicitly specified an image of the model to use for the fit calculations (M_MODEL_IMAGE) and the edges of the target images are extracted (M_USE_MAGNITUDE_TARGET is disabled). You can disable the fit operation to speed up the search, in which case MIL uses the features of the model and target to find occurrences, but it doesn't do any fitting. This results in a lower accuracy because the positional results are simply the positions of detection. M_DEFAULT Same as M_PIXEL_PRECISION. M_DISABLE Specifies to disable the fit operation; the positional results are determined by detection only. M_PIXEL_PRECISION Specifies to calculate the fit with pixel precision. M_SUBPIXEL_PRECISION Specifies to calculate the fit with subpixel precision. This value is only available when M_USE_MAGNITUDE_TARGET is set to M_DISABLE and M_MODEL_SOURCE is set to M_USER_IMAGE. M_MAX_ACCEPTED_OVERLAP Sets the maximum allowable overlap between found occurrences, as a percentage. Note that M_MAX_ACCEPTED_OVERLAP is applied after possible occurrences are sorted. M_DEFAULT Specifies the default value; the default value is 20.0%. 0.0 &lt;= Value &lt;= 100.0 Specifies the acceptable overlap, as a percentage. If set to 100%, found occurrences can overlap completely. If set to 0%, no found occurrence can overlap another by any amount. M_MAX_ASSOCIATION_DISTANCE Sets the maximum distance between a model edgel and the nearest occurrence edgel. Model edgels falling outside the specified maximum distance are not used to perform the occurrence's fit operation and will decrease the coverage score. M_DEFAULT Specifies the default value; the default value is 2.0. 1.0 &lt;= Value &lt;= 4.0 Specifies the maximum association distance, in pixels. M_MODEL_IMAGE Sets the image buffer that contains the image of the model to use for the fit and coverage calculations. The model image should have a prototypical appearance with well-defined edges. You can prepare the image manually or define a child buffer within a training image. You must specify a model image when M_MODEL_SOURCE is set to M_USER_IMAGE. Specifying a prototypical image of the model allows for higher fit and coverage scores when model appearances are varied and the trained composite-definition model contains more edgels than a typical appearance. ModelImageId Specifies the identifier of the image buffer containing the model image. Note that this buffer must be a 1-band, 8-bit unsigned image buffer. This image buffer must be the same size as the trained composite-definition model. You can inquire the size of the trained composite-definition model, using MagmInquire() with M_SIZE_X and M_SIZE_Y. M_MODEL_SOURCE Sets whether to use the trained composite-definition model or a prototypical image of the model for the fit and coverage calculations. You should use the trained composite-definition model if the labeled model appearances in your training images are uniform. When model appearances are varied, the trained composite-definition model contains additional edges. You can view the edges of the trained composite-definition model using MagmDraw() with M_DRAW_TRAINED_MODEL. If the trained composite-definition model contains a lot of edges, you should choose a model image for the fit and coverage. M_DEFAULT Same as M_FROM_TRAIN. M_FROM_TRAIN Specifies to use the trained composite-definition model. M_USER_IMAGE Specifies to use the image set with M_MODEL_IMAGE. M_PERSEVERANCE_DETECTION Sets the algorithm's perseverance when searching for occurrences. This affects the number of candidates the algorithm attempts to validate. Increasing the perseverance will increase robustness, but will increase search time. You should try increasing the perseverance if the search is not finding all model occurrences, or if the target is complex and decreasing M_STEP_X and M_STEP_Y is insufficient. M_DEFAULT Specifies the default value; the default value is 90.0%. 0.0 &lt;= Value &lt;= 100.0 Specifies the perseverance, as a percentage. M_REFERENCE_X Sets the X-coordinate of the origin of the model's reference axis, relative to the model origin. Position results return the X-coordinate of the model's reference axis origin transformed at the model occurrence. Position results are relative to the target origin. Note that the reference axis origin need not be in the model. M_DEFAULT Specifies that the default X-coordinate will be used. For a composite-definition model, the default value is the center of the model. Value Specifies the X-coordinate, in pixels. This value can be specified with subpixel accuracy. M_REFERENCE_Y Sets the Y-coordinate of the origin of the model's reference axis, relative to the model origin. Position results return the Y-coordinate of the model's reference axis origin transformed at the model occurrence. Position results are relative to the target origin. Note that the reference axis origin need not be in the model. M_DEFAULT Specifies that the default Y-coordinate will be used. For a composite-definition model, the default value is the center of the model. Value Specifies the Y-coordinate, in pixels. This value can be specified with subpixel accuracy. M_SMOOTHNESS Sets the degree of smoothness (noise reduction) applied to the model image and target image(s) during the edge extraction. M_DEFAULT Specifies the default value; the default value is 50.0. 0.0 &lt;= Value &lt;= 100.0 Specifies the smoothness value applied to the images, as a percentage. A setting of 0.0 indicates almost no noise reduction effect, while a setting of 100.0 indicates a very strong noise reduction effect. M_SMOOTHNESS_SOURCE Sets whether to use the smoothness value set during training or a custom smoothness value for the degree of noise reduction applied to the model image and target image(s) during the edge extraction. You should customize the smoothness value if your training and target images have dissimilar noise levels. M_DEFAULT Same as M_FROM_TRAIN. M_FROM_TRAIN Specifies to use the smoothness value set during the training of the model. This value was set with M_SMOOTHNESS in a train AGM context. M_USER_DEFINED Specifies to use the smoothness value set with M_SMOOTHNESS. M_SORT_CANDIDATES_SCORE Sets the score used to sort candidates. Candidates are sorted in decreasing score order. The specified score affects which possible occurrences are filtered out. When two possible occurrences overlap above the value specified with M_MAX_ACCEPTED_OVERLAP, the possible occurrence with the lower score is removed. M_DEFAULT Same as M_SCORE_DETECTION. M_SCORE_COVERAGE Specifies to use the coverage score to sort candidates. M_SCORE_DETECTION Specifies to use the detection score to sort candidates. M_SCORE_FIT Specifies to use the fit score to sort candidates. M_STABLE_EDGELS_MODE Sets whether to use only stable edgels when searching for occurrences. A stable edgel is an edgel that remains persistent when extracting edges with slightly different smoothness values. This control type is only used and should only be enabled when M_MODEL_SOURCE is set to M_USER_IMAGE. Otherwise, an error is generated. M_DEFAULT Same as M_DISABLE. M_DISABLE Specifies not to use only stable edgels. All edgels are considered when searching for occurrences. M_SMOOTHNESS_STABLE Specifies to use only stable edgels. Unstable (noisy) edgels are ignored when searching for occurrences. M_STEP_X Sets the X step size of explored positions to search for occurrences. Increasing M_STEP_X and M_STEP_Y can accelerate search speed, but can also increase the risk of missing favorable occurrences. You can typically start with a value of 1 and increase M_STEP_X and M_STEP_Y if the speed is too slow. Increasing these values when you have a large model can decrease the search time while minimally affecting the occurrences' detection, fit, and coverage scores. M_DEFAULT Specifies the default value; the default value is 1. Value &gt;= 1 Specifies the X step size. M_STEP_Y Sets the Y step size of explored positions to search for occurrences. Increasing M_STEP_X and M_STEP_Y can accelerate search speed, but can also increase the risk of missing favorable occurrences. You can typically start with a value of 1 and increase M_STEP_X and M_STEP_Y if the speed is too slow. Increasing these values when you have a large model can decrease the search time while minimally affecting the occurrences' detection, fit, and coverage scores. M_DEFAULT Specifies the default value; the default value is 1. Value &gt;= 1 Specifies the Y step size. M_THRESHOLD_MODE Sets the threshold mode of the edge extraction. M_DEFAULT Same as M_HIGH. M_DISABLE Specifies no threshold. All edges are extracted. M_HIGH Specifies a high threshold. M_HIGH should be used for images with some contrast variations, noise, and non-uniform illumination. M_HIGH always results in a lower (or equal) number of edgels than M_MEDIUM. M_LOW Specifies a low threshold. All edges over a minimum noise-based estimated threshold are extracted. M_LOW always results in a lower (or equal) number of edgels than M_DISABLE. M_MEDIUM Specifies a medium threshold. M_MEDIUM should be used for multi-contrast images, or for images with a lot of noise or non-uniform illumination. M_MEDIUM always results in a lower (or equal) number of edgels than M_LOW. M_VERY_HIGH Specifies a very high threshold. Only the strongest edges in the image are extracted. M_VERY_HIGH always results in a lower (or equal) number of edgels than M_HIGH. M_THRESHOLD_MODE_SOURCE Sets whether to use the threshold mode set during training or a custom threshold mode for the edge extraction. You can use the threshold mode set during training if your training and target images have similar illumination and contrast. If your training and target images were captured in different conditions, the illumination and contrast might vary and you should customize the threshold mode accordingly. M_DEFAULT Same as M_FROM_TRAIN. M_FROM_TRAIN Specifies to use the threshold mode set during the training of the model. This value was set with M_THRESHOLD_MODE in a train AGM context. M_USER_DEFINED Specifies to use the threshold mode set with M_THRESHOLD_MODE. Find AGM context ID with a single-definition model Specifies a find AGM context, allocated using MagmAlloc() with M_GLOBAL_EDGE_BASED_FIND and used in MagmFind() operations. It must contain a single-definition model. M_ACCEPTANCE_COVERAGE Sets the minimum coverage score required for an occurrence to be considered a match. The coverage score is the percentage of the total length of the model's edgels found in the occurrence. 100% indicates that for each of the model's edgels, a corresponding edgel was found in the occurrence. Note, a model's edgel corresponds to an edgel in the occurrence if the distance between them is less than or equal to M_MAX_ASSOCIATION_DISTANCE. M_DEFAULT Specifies the default value; the default value is 60.0%. 0.0 &lt;= Value &lt;= 100.0 Specifies the minimum acceptable coverage score, as a percentage. M_ACCEPTANCE_DETECTION Sets the minimum detection score required for an occurrence to be considered a match. The detection score represents how confident you should be that MIL found a true occurrence. M_DEFAULT Specifies the default value; the default value is 60.0 %. 0.0 &lt;= Value &lt;= 100.0 Specifies the minimum acceptable detection score, as a percentage. M_ACCEPTANCE_FIT Sets the minimum fit score required for an occurrence to be considered a match. The fit score is a measure of the correlation of the edgels in the model to those in the occurrence. It is based on the distance between the model's edgels and the occurrence's edgels. Note, only those model edgels that are less than or equal to M_MAX_ASSOCIATION_DISTANCE from an occurrence edgel are used in the fit score calculation. M_DEFAULT Specifies the default value; the default value is 0.0 %. 0.0 &lt;= Value &lt;= 100.0 Specifies the minimum acceptable fit score, as a percentage. M_BOX_MARGIN_BOTTOM Sets a margin at the bottom of the bounding box of the model's active edges, if the model was defined from a CAD DXF file. The margins add a black space around the model, which affect whether two occurrences are considered overlapping. For example, even if none of an occurrence's edges touch another occurrence, if the margin around the bounding box of its edges overlaps with the margin and/or bounding box of another occurrence by any amount, the occurrences will be considered overlapping, and might be filtered out according to M_MAX_ACCEPTED_OVERLAP. Note that the margins will be included when drawing the model using MagmDraw(). The bounding box of the model's active edges plus the specified margins define the size of the model box. This control type is only available for models of type M_DXF_FILE. M_DEFAULT Specifies the default value; the default value is 10.0% of the height of the bounding box of the model's active edges. 0.0 &lt;= Value &lt;= 163840000.0 Specifies the margin, in model units. M_BOX_MARGIN_LEFT Sets a margin at the left side of the bounding box of the model's active edges, if the model was defined from a CAD DXF file. The margins add a black space around the model, which affect whether two occurrences are considered overlapping. For example, even if none of an occurrence's edges touch another occurrence, if the margin around the bounding box of its edges overlaps with the margin and/or bounding box of another occurrence by any amount, the occurrences will be considered overlapping, and might be filtered out according to M_MAX_ACCEPTED_OVERLAP. Note that the margins will be included when drawing the model using MagmDraw(). The bounding box of the model's active edges plus the specified margins define the size of the model box. This control type is only available for models of type M_DXF_FILE. M_DEFAULT Specifies the default value; the default value is 10.0% of the width of the bounding box of the model's active edges. 0.0 &lt;= Value &lt;= 163840000.0 Specifies the margin, in model units. M_BOX_MARGIN_RIGHT Sets a margin at the right side of the bounding box of the model's active edges, if the model was defined from a CAD DXF file. The margins add a black space around the model, which affect whether two occurrences are considered overlapping. For example, even if none of an occurrence's edges touch another occurrence, if the margin around the bounding box of its edges overlaps with the margin and/or bounding box of another occurrence by any amount, the occurrences will be considered overlapping, and might be filtered out according to M_MAX_ACCEPTED_OVERLAP. Note that the margins will be included when drawing the model using MagmDraw(). The bounding box of the model's active edges plus the specified margins define the size of the model box. This control type is only available for models of type M_DXF_FILE. M_DEFAULT Specifies the default value; the default value is 10.0% of the width of the bounding box of the model's active edges. 0.0 &lt;= Value &lt;= 163840000.0 Specifies the margin, in model units. M_BOX_MARGIN_TOP Sets a margin at the top of the bounding box of the model's active edges, if the model was defined from a CAD DXF file. The margins add a black space around the model, which affect whether two occurrences are considered overlapping. For example, even if none of an occurrence's edges touch another occurrence, if the margin around the bounding box of its edges overlaps with the margin and/or bounding box of another occurrence by any amount, the occurrences will be considered overlapping, and might be filtered out according to M_MAX_ACCEPTED_OVERLAP. Note that the margins will be included when drawing the model using MagmDraw(). The bounding box of the model's active edges plus the specified margins define the size of the model box. This control type is only available for models of type M_DXF_FILE. M_DEFAULT Specifies the default value; the default value is 10.0% of the height of the bounding box of the model's active edges. 0.0 &lt;= Value &lt;= 163840000.0 Specifies the margin, in model units. M_CAD_Y_AXIS Sets the direction of the Y-axis for a model of type M_DXF_FILE. When the model is added to the AGM context from a CAD DXF file, the model will retain its coordinate system (the origin and the axes). Most CAD DXF files are oriented so that the Y-axis is positive going up, whereas the coordinate system MIL uses is oriented with the Y-axis positive going down. So if you take the edge coordinates of an object from a CAD DXF file and put them in an image, the imaged object will look flipped when compared to the original object. This is also the case for a model defined from a CAD DXF file. This means that, unless the object is symmetrical, the match will not be made. This control type is only available for models of type M_DXF_FILE. M_DEFAULT Same as M_FLIP. M_FLIP Specifies to flip the Y-axis for the model so that the Y-axis is positive going down. M_NO_FLIP Specifies not to flip the Y-axis for the model. M_DETECTION_DELTA_NEG_ANGLE Sets the lower limit of the detection angle range, relative to the nominal search angle (M_DETECTION_REF_ANGLE). That is, LowerLimit = M_DETECTION_REF_ANGLE - M_DETECTION_DELTA_NEG_ANGLE. The detection angle range should be used to cover the expected variance in the angle of detection. Note that the detection angle range only limits the angle of detection. The angle at which an occurrence is detected might not be exact; its true angle can typically be within 10° of the angle of detection, even if that falls outside of the detection angle range. If M_FIT_MODE is disabled, the returned angle of an occurrence will always be the angle at which it was detected and will therefore always be within the detection angle range. If M_FIT_MODE is enabled, a fit operation is performed starting from the angle of detection. In refining the angle so that it is more accurate, the angle of the occurrence's reference axis returned by MagmGetResult() with M_ANGLE can end up being outside of the detection angle range. Note that the greater the range of angles to be searched, the slower the search. To set the upper limit for the detection angle range, use M_DETECTION_DELTA_POS_ANGLE. M_DEFAULT Specifies the default value; the default value is 0.0. 0.0 &lt;= Value &lt;= 360.0 Specifies the lower limit of the detection angle range, in degrees. Note that M_DETECTION_DELTA_NEG_ANGLE + M_DETECTION_DELTA_POS_ANGLE cannot be greater than 360.0°. M_DETECTION_DELTA_POS_ANGLE Sets the upper limit of the detection angle range, relative to the nominal search angle (M_DETECTION_REF_ANGLE). That is, UpperLimit = M_DETECTION_REF_ANGLE + M_DETECTION_DELTA_POS_ANGLE. The detection angle range should be used to cover the expected variance in the angle of detection. Note that the detection angle range only limits the angle of detection. The angle at which an occurrence is detected might not be exact; its true angle can typically be within 10° of the angle of detection, even if that falls outside of the detection angle range. If M_FIT_MODE is disabled, the returned angle of an occurrence will always be the angle at which it was detected and will therefore always be within the detection angle range. If M_FIT_MODE is enabled, a fit operation is performed starting from the angle of detection. In refining the angle so that it is more accurate, the angle of the occurrence's reference axis returned by MagmGetResult() with M_ANGLE can end up being outside of the detection angle range. Note that the greater the range of angles to be searched, the slower the search. To set the lower limit for the detection angle range, use M_DETECTION_DELTA_NEG_ANGLE. M_DEFAULT Specifies the default value; the default value is 0.0. 0.0 &lt;= Value &lt;= 360.0 Specifies the upper limit of the detection angle range, in degrees. Note that M_DETECTION_DELTA_NEG_ANGLE + M_DETECTION_DELTA_POS_ANGLE cannot be greater than 360.0°. M_DETECTION_MULTI_ANGLE_MODE Sets the mode with which to detect occurrences when searching at multiple angles. The M_GLOBAL mode can accelerate search speed, but can also increase the risk of missing overlapping occurrences that have close centers. You should specify M_INDIVIDUAL if the search is not finding all model occurrences, but note that this will slow down the search. M_DEFAULT Same as M_GLOBAL. M_GLOBAL Specifies to detect occurrences across all search angles globally. M_INDIVIDUAL Specifies to detect occurrences at each search angle individually. M_DETECTION_REF_ANGLE Sets the nominal search angle; this is the angle at which you expect to find the model's reference axis in the target. Note that occurrences can be slightly rotated from the search angle and still be detected. The exact degree varies depending on your model, but the MagmFind() operation will typically detect occurrences within 10° of the search angle. If you expect greater degrees in variation, you should specify a detection angle range, using M_DETECTION_DELTA_NEG_ANGLE and M_DETECTION_DELTA_POS_ANGLE. Note that specifying a nominal search angle does not decrease the search speed. M_DEFAULT Specifies the default value; the default value is 0.0. 0.0 &lt;= Value &lt; 360.0 Specifies the nominal search angle, in degrees. M_DETECTION_STEP_ANGLE Sets the step angle at which to search for occurrences of the model within the specified detection angle range. Note that the smaller the step angle, the slower the search. The search is performed at the nominal search angle and at every +/- M_DETECTION_STEP_ANGLE degrees within the detection angle range. Note that occurrences can be slightly rotated from the search angle and still be detected. You should typically set the step angle to this rotation * 2. For example, if your model can tolerate the occurrence being offset from its search angle by ±5°, you should set the step angle to 10°. M_DEFAULT Specifies the default value; the default value is 10.0. 5.0 &lt;= Value &lt;= 180.0 Specifies the step angle, in degrees. M_EDGEL_ANGLE_MODE Sets whether to consider edgel orientation, defined by a gradient angle, when searching for occurrences. A smaller difference in orientation between model and occurrence edgels produces a closer match. The gradient angle is the direction of maximum change in brightness at the edgel's position. Note that edgel orientation is indifferent to whether the brightness changes from dark to light or the reverse. This means that the maximum difference in orientation between two edgels is 90 degrees. Disabling M_EDGEL_ANGLE_MODE will increase the search speed. You can typically disable this control when your target images are uncluttered with minimal noise. M_DEFAULT Same as M_ORIENTATION. M_DISABLE Specifies not to consider edgel orientation. M_ORIENTATION Specifies to consider edgel orientation. The difference in orientation between model and occurrence edgels is negatively correlated with the occurrence's detection, fit, and coverage scores. Smaller comparative differences result in higher scores (and vice versa). M_EMPTY_REGIONS_MODE Sets whether to consider the regions of the model that do not contain edges when searching for model occurrences. If the model has a consistent region without edges, you can enable this control type to improve the detection score of favorable occurrences. If edges are present in this region of the occurrence, the detection score will decrease. M_DEFAULT Same as M_DISABLE. M_AUTO Specifies to automatically determine the empty regions. If no empty regions are found, the outcome is the same as disabling empty regions. M_DISABLE Specifies not to consider empty regions. M_FIT_MODE Sets the mode of the fit operation. The fit mode affects positional accuracy and search speed. The positional results are most accurate when the fit operation uses subpixel precision, but this can reduce the speed of the search. Note that the fit can only be calculated with subpixel precision when the edges of the target images are extracted (M_USE_MAGNITUDE_TARGET is disabled). You can disable the fit operation to speed up the search, in which case MIL uses the features of the model and target to find occurrences, but it doesn't do any fitting. This results in a lower accuracy because the positional results are simply the positions of detection. M_DEFAULT Same as M_PIXEL_PRECISION. M_DISABLE Specifies to disable the fit operation; the positional results are determined by detection only. M_PIXEL_PRECISION Specifies to calculate the fit with pixel precision. M_SUBPIXEL_PRECISION Specifies to calculate the fit with subpixel precision. This value is only available when M_USE_MAGNITUDE_TARGET is set to M_DISABLE. M_MAX_ACCEPTED_OVERLAP Sets the maximum allowable overlap between found occurrences, as a percentage. Note that M_MAX_ACCEPTED_OVERLAP is applied after possible occurrences are sorted. M_DEFAULT Specifies the default value; the default value is 20.0 %. 0.0 &lt;= Value &lt;= 100.0 Specifies the acceptable overlap, as a percentage. If set to 100%, found occurrences can overlap completely. If set to 0%, no found occurrence can overlap another by any amount. M_MAX_ASSOCIATION_DISTANCE Sets the maximum distance between a model edgel and the nearest occurrence edgel. Model edgels falling outside the specified maximum distance are not used to perform the occurrence's fit operation and will decrease the coverage score. M_DEFAULT Specifies the default value; the default value is 2.0. 1.0 &lt;= Value &lt;= 4.0 Specifies the maximum association distance, in pixels. M_MODEL_PRECISION Sets the percentage of model edgels to use when searching for occurrences. Specifying a high value can increase the detection, fit, and coverage scores, which increases the likelihood of finding all occurrences, but can also decrease the search speed. Specifying a low value can decrease the detection, fit, and coverage scores, which increases the likelihood of missing favorable occurrences or finding false occurrences, but can also increase the search speed. M_DEFAULT Specifies the default value; the default value is 80.0%. 0.0 &lt;= Value &lt;= 100.0 Specifies the amount of model edgels, as a percentage. A value of 100% indicates that all model edgels are used. M_PERSEVERANCE_DETECTION Sets the algorithm's perseverance when searching for occurrences. This affects the number of candidates the algorithm attempts to validate. Increasing the perseverance will increase robustness, but will increase search time. You should try increasing the perseverance if the search is not finding all model occurrences, or if the target is complex and decreasing M_STEP_X and M_STEP_Y is insufficient. M_DEFAULT Specifies the default value; the default value is 90.0 %. 0.0 &lt;= Value &lt;= 100.0 Specifies the perseverance, as a percentage. M_PIXEL_SCALE Sets the pixel scale of the model, if the model was defined from a CAD DXF file. This value is the scale to apply to the model to go from DXF units to pixel units. For example, if M_BOX_SIZE_X is 50.0 DXF units and M_PIXEL_SCALE is set to 100.0, the model box will be 5000.0 pixels wide. This control type is only available for models of type M_DXF_FILE. M_DEFAULT Specifies the default value; the default value is 1.0. 0.0 &lt; Value &lt; 10000.0 Specifies the pixel scale. M_BOX_SIZE_... * M_PIXEL_SCALE must be less than or equal to 32768 pixels and M_EDGES_BOX_SIZE_... * M_PIXEL_SCALE must be between 6 and 32768 pixels to avoid a MIL error when calling MagmPreprocess() or MagmDraw(). M_REFERENCE_X Sets the X-coordinate of the origin of the model's reference axis, relative to the model origin. Position results return the X-coordinate of the model's reference axis origin transformed at the model occurrence. Position results are relative to the target origin. Note that the reference axis origin need not be in the model. M_DEFAULT Specifies that the default X-coordinate will be used. For a model of type M_DXF_FILE, the default value is the origin of the CAD DXF file. For other types of models, the default value is the center of the model. Value Specifies the X-coordinate, in pixels. This value can be specified with subpixel accuracy. M_REFERENCE_Y Sets the Y-coordinate of the origin of the model's reference axis, relative to the model origin. Position results return the Y-coordinate of the model's reference axis origin transformed at the model occurrence. Position results are relative to the target origin. Note that the reference axis origin need not be in the model. M_DEFAULT Specifies that the default Y-coordinate will be used. For a model of type M_DXF_FILE, the default value is the origin of the CAD DXF file. For other types of models, the default value is the center of the model. Value Specifies the Y-coordinate, in pixels. This value can be specified with subpixel accuracy. M_SMOOTHNESS Sets the degree of smoothness (noise reduction) applied to the model image and target image(s) during the edge extraction. M_DEFAULT Specifies the default value; the default value is 50.0. 0.0 &lt;= Value &lt;= 100.0 Specifies the smoothness value applied to the images, as a percentage. A setting of 0.0 indicates almost no noise reduction effect, while a setting of 100.0 indicates a very strong noise reduction effect. M_SORT_CANDIDATES_SCORE Sets the score used to sort candidates. Candidates are sorted in decreasing score order. The specified score affects which possible occurrences are filtered out. When two possible occurrences overlap above the value specified with M_MAX_ACCEPTED_OVERLAP, the possible occurrence with the lower score is removed. M_DEFAULT Same as M_SCORE_COVERAGE. M_SCORE_COVERAGE Specifies to use the coverage score to sort candidates. M_SCORE_DETECTION Specifies to use the detection score to sort candidates. M_SCORE_FIT Specifies to use the fit score to sort candidates. M_STABLE_EDGELS_MODE Sets whether to use only stable edgels when searching for occurrences. A stable edgel is an edgel that remains persistent when extracting edges with slightly different smoothness values. This control type is only available for models of type M_IMAGE and M_IMAGE_REGION. M_DEFAULT Same as M_SMOOTHNESS_STABLE. M_DISABLE Specifies not to use only stable edgels. All edgels are considered when searching for occurrences. M_SMOOTHNESS_STABLE Specifies to use only stable edgels. Unstable (noisy) edgels are ignored when searching for occurrences. M_STEP_X Sets the X step size of explored positions to search for occurrences. Increasing M_STEP_X and M_STEP_Y can accelerate search speed, but can also increase the risk of missing favorable occurrences. You can typically start with a value of 1 and increase M_STEP_X and M_STEP_Y if the speed is too slow. Increasing these values when you have a large model can decrease the search time while minimally affecting the occurrences' detection, fit, and coverage scores. M_DEFAULT Specifies the default value; the default value is 1. Value &gt;= 1 Specifies the X step size. M_STEP_Y Sets the Y step size of explored positions to search for occurrences. Increasing M_STEP_X and M_STEP_Y can accelerate search speed, but can also increase the risk of missing favorable occurrences. You can typically start with a value of 1 and increase M_STEP_X and M_STEP_Y if the speed is too slow. Increasing these values when you have a large model can decrease the search time while minimally affecting the occurrences' detection, fit, and coverage scores. M_DEFAULT Specifies the default value; the default value is 1. Value &gt;= 1 Specifies the Y step size. M_THRESHOLD_MODE Sets the threshold mode of the edge extraction. M_DEFAULT Same as M_HIGH. M_DISABLE Specifies no threshold. All edges are extracted. M_HIGH Specifies a high threshold. M_HIGH should be used for images with some contrast variations, noise, and non-uniform illumination. M_HIGH always results in a lower (or equal) number of edgels than M_MEDIUM. M_LOW Specifies a low threshold. All edges over a minimum noise-based estimated threshold are extracted. M_LOW always results in a lower (or equal) number of edgels than M_DISABLE. M_MEDIUM Specifies a medium threshold. M_MEDIUM should be used for multi-contrast images, or for images with a lot of noise or non-uniform illumination. M_MEDIUM always results in a lower (or equal) number of edgels than M_LOW. M_VERY_HIGH Specifies a very high threshold. Only the strongest edges in the image are extracted. M_VERY_HIGH always results in a lower (or equal) number of edgels than M_HIGH. M_USE_MAGNITUDE_TARGET Sets whether to use the gradient magnitude or to use extracted edges when searching for occurrences. When this control type is set to M_ENABLE, thresholding is not applied to the target images, and the magnitude of the gradient is used instead. This is useful when there are contrast variations within or between images, such that there is no single threshold capable of detecting all pertinent edgels without introducing noisy background edges, leading to false positives. When set to M_DISABLE, edges are extracted from the target images based on a thresholding of the magnitude values. When the occurrences have strong contrasted edges that can be detected without introducing noisy background edges, using edges can lead to more robust results. Note that even if this control type is enabled, M_THRESHOLD_MODE is used to extract the edges of the model. This control type is not available when M_FIT_MODE is set to M_SUBPIXEL_PRECISION or when using an Edge Finder result buffer as the target. M_DEFAULT Same as M_DISABLE. M_DISABLE Specifies to extract and use edges. M_ENABLE Specifies to use the magnitude of the gradient. Train AGM context ID with a composite-definition model Specifies a train AGM context, allocated using MagmAlloc() with M_GLOBAL_EDGE_BASED_TRAIN and used in MagmTrain() operations. It must contain a composite-definition model. M_EMPTY_REGIONS_MODE Sets whether to consider the regions of the model appearances that do not contain edges when training the composite-definition model. This will slow down training, but if the model has a consistent region without edges, using empty regions can improve the detection score of favorable occurrences. If edges are present in this region of the occurrence, the detection score will decrease. The setting of this control type is also used for the MagmFind() operation when searching for the trained composite-definition model. M_DEFAULT Same as M_DISABLE. M_AUTO Specifies to automatically determine the empty regions. If no empty regions are found, the outcome is the same as disabling empty regions. M_DISABLE Specifies not to consider empty regions. M_MODEL_PRECISION Sets the percentage of the trained composite-definition model's edgels to use when searching for occurrences. Specifying a high value can increase the detection, fit, and coverage scores, which increases the likelihood of finding all occurrences, but can also decrease the search speed. Specifying a low value can decrease the detection, fit, and coverage scores, which increases the likelihood of missing favorable occurrences or finding false occurrences, but can also increase the search speed. M_DEFAULT Specifies the default value; the default value is 80.0 %. 0.0 &lt;= Value &lt;= 100.0 Specifies the amount of model edgels, as a percentage. A value of 100% indicates that all model edgels are used. M_NEGATIVE_LABELS_MAX_OVERLAP Sets the maximum allowable overlap between two automatically generated negative (red) rectangles. This control type is only used when M_NEGATIVE_LABELS_MODE is set to M_AUTO. M_DEFAULT Specifies the default value; the default value is 20.0%. 0.0 &lt;= Value &lt; 90.0 Specifies the maximum allowable overlap, as a percentage. M_NEGATIVE_LABELS_MODE Sets whether to automatically label negative model locations in the training images or to use manually defined labels. If set to M_AUTO, MagmTrain() will automatically identify and label background areas with red rectangles. Note that the number of automatically generated red rectangles depends on the complexity of the training images. You can use MagmGetResult() with M_NUMBER_NEG_RECTANGLES to retrieve the number of red rectangles across all training images. You can use MagmDraw() to view the rectangles. M_DEFAULT Same as M_USER_DEFINED. M_AUTO Specifies to automatically label the negative model locations. At least one training image must have a minimum of one blue rectangle, and no training images can have any red rectangles. Note, there can be training images with no rectangles. M_USER_DEFINED Specifies to use manually defined negative (red) rectangles. At least one training image must have a minimum of one red rectangle, and at least one training image must have a minimum of one blue rectangle. Note, there can be training images with only red rectangles or only blue rectangles. You can also include training images with no rectangles, but they will not be used during training. M_NEGATIVE_LABELS_POSITIVE_MAX_OVERLAP Sets the maximum allowable overlap between an automatically generated negative (red) rectangle and a positive (blue) rectangle. This control type is only used when M_NEGATIVE_LABELS_MODE is set to M_AUTO. M_DEFAULT Specifies the default value; the default value is 50.0%. 0.0 &lt;= Value &lt; 80.0 Specifies the maximum allowable overlap, as a percentage. M_REALIGN_STRENGTH Sets the strength with which to displace the blue rectangles, which define the positive model locations in the training images, to better align them. The more aligned the blue rectangles are, the more accurate the search with the resulting trained composite-definition model will be. You should attempt to label your training images such that all model occurrences appear in the exact same position within each blue rectangle. If the blue rectangles are not precise, you can use this control to allow the MagmTrain() operation to displace the blue rectangles. The higher the realignment strength, the further MagmTrain() can displace the blue rectangles so that the model occurrences appear in the same position within each blue rectangle. When the realignment strength is set to 0.0, no realignment occurs. M_DEFAULT Specifies the default value; the default value is 0.0. 0.0 &lt;= Value &lt;= 100.0 Specifies the strength of the realignment. M_SMOOTHNESS Sets the degree of smoothness (noise reduction) applied to the training images during the edge extraction. M_DEFAULT Specifies the default value; the default value is 50.0. 0.0 &lt;= Value &lt;= 100.0 Specifies the smoothness value applied to the images, as a percentage. A setting of 0.0 indicates almost no noise reduction effect, while a setting of 100.0 indicates a very strong noise reduction effect. M_THRESHOLD_MODE Sets the threshold mode of the edge extraction. M_DEFAULT Same as M_HIGH. M_DISABLE Specifies no threshold. All edges are extracted. M_HIGH Specifies a high threshold. M_HIGH should be used for images with some contrast variations, noise, and non-uniform illumination. M_HIGH always results in a lower (or equal) number of edgels than M_MEDIUM. M_LOW Specifies a low threshold. All edges over a minimum noise-based estimated threshold are extracted. M_LOW always results in a lower (or equal) number of edgels than M_DISABLE. M_MEDIUM Specifies a medium threshold. M_MEDIUM should be used for multi-contrast images, or for images with a lot of noise or non-uniform illumination. M_MEDIUM always results in a lower (or equal) number of edgels than M_LOW. M_VERY_HIGH Specifies a very high threshold. Only the strongest edges in the image are extracted. M_VERY_HIGH always results in a lower (or equal) number of edgels than M_HIGH. M_TRAIN_LABELS_NOISE_MODE Sets the mode with which to handle substandard labeled image regions when training the composite-definition model. If this control type is set to M_LABELS_CONFIDENCE, the MagmTrain() operation will be robust to substandard labeled image regions that might cause distortion due to the presence of a lot of noise, blue rectangles (positive model locations) that have missing or extra features in comparison to other blue rectangles, red rectangles (negative model locations) that contain similar features to the model, or incorrect labeling (model appearances labeled with negative (red) rectangles or background samples labeled with positive (blue) rectangles). Disabling M_TRAIN_LABELS_NOISE_MODE can increase the training speed, but can result in a more distorted trained composite-definition model if the training images contain any substandard labeled image regions, as listed above. M_DEFAULT Same as M_DISABLE. M_DISABLE Specifies not to handle substandard labeled image regions differently. MagmTrain() will strongly attempt to correctly classify all labeled regions, including outlier labeled regions, incorrect labeled regions, or labeled regions with a lot of noise, which can cause the model to overfit on the training data. M_LABELS_CONFIDENCE Specifies to be robust to substandard labels. To prevent overfitting on the training data, labels that are hard to correctly classify, such as outlier labels, incorrect labels, or labels with a lot of noise, will have less of an affect on the resulting trained composite-definition model. M_USE_MAGNITUDE_TARGET Sets whether to use the gradient magnitude or to use extracted edges when training the composite-definition model and searching for occurrences. When this control type is set to M_ENABLE, thresholding is not applied to the training images or target images, and the magnitude of the gradient is used instead. This is useful when there are contrast variations within or between images, such that there is no single threshold capable of detecting all pertinent edgels without introducing noisy background edges, leading to false positives. When set to M_DISABLE, edges are extracted from the training and target images based on a thresholding of the magnitude values. When the occurrences have strong contrasted edges that can be detected without introducing noisy background edges, using edges can lead to more robust results. Note that even if this control type is enabled, M_THRESHOLD_MODE will be copied to the find AGM context, and used to extract the edges of the model when M_MODEL_SOURCE is set to M_USER_IMAGE. This control type is not available when M_FIT_MODE is set to M_SUBPIXEL_PRECISION or when using an Edge Finder result buffer as the target. M_DEFAULT Same as M_DISABLE. M_DISABLE Specifies to extract and use edges. M_ENABLE Specifies to use the magnitude of the gradient. Type-specific versions of the function when using a C compiler under 64-bit void MagmControlInt64 (MIL_ID ContextId, MIL_INT64 Index, MIL_INT64 ControlType, MIL_INT64 ControlValue) Details Parameters ContextId See ContextId of the main function for a description. Index See Index of the main function for a description. ControlType See ControlType of the main function for a description. ControlValue See ControlValue of the main function for a description. void MagmControlDouble (MIL_ID ContextId, MIL_INT64 Index, MIL_INT64 ControlType, MIL_DOUBLE ControlValue) Details Parameters ContextId See ContextId of the main function for a description. Index See Index of the main function for a description. ControlType See ControlType of the main function for a description. ControlValue See ControlValue of the main function for a description. Compilation information Header Include mil.h. Library Use mil.lib; milagm.lib. DLL Requires mil.dll; milagm.dll. Syntax Description Parameters - ContextId - Index For specifying a model - ControlType - ControlValue Parameter Associations For controlling a model in an AGM context [Find AGM context ID with a composite-definition model] [Find AGM context ID with a single-definition model] [Train AGM context ID with a composite-definition model] Type-specific versions of the function when using a C compiler under 64-bit Compilation information ",
      "wordCount": 7433,
      "subEntries": []
    },
    {
      "id": "Reference_agm_MagmCopyResult",
      "version": null,
      "title": "MagmCopyResult",
      "subTitles": null,
      "location": "MIL Reference",
      "pageURL": "content\\Reference\\agm\\MagmCopyResult.htm",
      "text": " MagmCopyResult Synopsis Copy a trained composite-definition model from a train AGM result buffer to a find AGM context. Syntax void MagmCopyResult( MIL_ID&nbsp;SrcTrainResultId, //in MIL_INT64&nbsp;SrcIndex, //in MIL_ID&nbsp;DstContextId, //in MIL_INT64&nbsp;DstIndex, //in MIL_INT64&nbsp;CopyType, //in MIL_INT64&nbsp;ControlFlag //in ) Description This function copies a model from a train AGM result buffer to a find AGM context. You can only copy trained results after calling MagmTrain(). You must use MagmCopyResult() to add a composite-definition model to a find AGM context. Once added, you must preprocess the context before calling MagmFind(). Parameters Parameters SrcTrainResultId Specifies the identifier of the source result buffer from which to copy. The result buffer must have been allocated using MagmAllocResult() with M_GLOBAL_EDGE_BASED_TRAIN_RESULT, and must contain the results of a call to MagmTrain(). SrcIndex Reserved for future expansion and must be set to M_DEFAULT. DstContextId Specifies the identifier of the destination context in which to store the copied results. The context must have been allocated using MagmAlloc() with M_GLOBAL_EDGE_BASED_FIND. DstIndex Reserved for future expansion and must be set to M_DEFAULT. CopyType Specifies the type of copy operation to perform. Specifies the type of copy operation Value Description M_TRAINED_MODEL Specifies to copy the trained composite-definition model from the train AGM result buffer to the find AGM context. ControlFlag Reserved for future expansion and must be set to M_DEFAULT. Compilation information Header Include mil.h. Library Use mil.lib; milagm.lib. DLL Requires mil.dll; milagm.dll. Syntax Description Parameters - SrcTrainResultId - SrcIndex - DstContextId - DstIndex - CopyType Specifies the type of copy operation - ControlFlag Compilation information ",
      "wordCount": 252,
      "subEntries": []
    },
    {
      "id": "Reference_agm_MagmDefine",
      "version": null,
      "title": "MagmDefine",
      "subTitles": null,
      "location": "MIL Reference",
      "pageURL": "content\\Reference\\agm\\MagmDefine.htm",
      "text": " MagmDefine Synopsis Add a model to, or delete a model from, an AGM context. Syntax MIL_INT64 MagmDefine( MIL_ID&nbsp;ContextId, //in MIL_INT64&nbsp;Operation, //in MIL_INT64&nbsp;SourceType, //in MIL_INT64&nbsp;ModelType, //in MIL_INT64&nbsp;Param1, //in MIL_INT64&nbsp;ControlFlag //in ) Description This function allows you to add a model to, or delete a model from, a find AGM context or a train AGM context. Note, when a model is added or deleted, the AGM context must be preprocessed again, using MagmPreprocess(). You can only define one model per AGM context. When adding a model to the context, it is assigned an index of 0. Note that a composite-definition model must be trained before performing an MagmFind() operation. This means you cannot add a composite-definition model to a find AGM context using MagmDefine(). You must add it to a train AGM context using MagmDefine(), train the model using MagmTrain(), and then copy the trained model to a find AGM context using MagmCopyResult(). The MagmFind() and MagmTrain() operations are performed according to the individual model settings specified using MagmControl(). Parameters Parameters ContextId Specifies the identifier of the AGM context in which to add or delete a model. The AGM context must have been previously allocated on the required system using MagmAlloc() with M_GLOBAL_EDGE_BASED_FIND or M_GLOBAL_EDGE_BASED_TRAIN. Operation Specifies whether to add or remove a model. Specifies the operation Value Description M_ADD Specifies to add a model to the specified AGM context. M_DELETE Specifies to delete a model from the specified AGM context. SourceType Specifies the type of source from which to define the model. See the Parameter associations section for possible values that can be specified. ModelType Specifies the type of model to define when adding models to the AGM context. See the Parameter associations section for possible values that can be specified. Param1 Specifies an attribute of the model. See the Parameter associations section for possible values that can be specified. ControlFlag Reserved for future expansion and must be set to M_DEFAULT. Parameter associations The tables below list possible values for the SourceType, ModelType, and Param1 parameters. For adding a model to the AGM context For removing a model from the AGM context To add a model to an AGM context, the ModelType, SourceType, and Param1 parameters can be set to the following values. The Operation parameter must be set to M_ADD. For adding a model to the AGM context ModelType Description SourceType Param1 M_COMPOSITE Specifies to add a composite-definition model. A composite-definition model uses training images, labeled with model appearances and background areas that can be incorrectly misconstrued as occurrences, to construct the best possible model. A composite-definition model can be used to improve results if a previous MagmFind() operation with a single-definition model found false occurrences. Training a composite-definition model, using MagmTrain(), identifies possible backgrounds, which can result in a model that can better discriminate true occurrences from false occurrences, especially in cluttered target images. Since a composite-definition model requires training before it can be used to search for occurrences, this type of model can only be added to a train AGM context. M_DEFAULT Specifies the default behavior. M_NULL Specifies that this parameter is unused. You do not specify a model image because the model is built from training images, using MagmTrain(). M_SINGLE Specifies to add a single-definition model. A single-definition model can be defined from a CAD DXF file, Edge Finder result buffer, or a single source image. In the latter case, the entire image is used as the model or the model is extracted from a non-rotated region. Since a single-definition model does not require training, this type of model can only be added to a find AGM context. M_DXF_FILE Specifies to define the model from the entities in the specified CAD DXF file. This function does not support all entities that are possible in a CAD DXF file. If there are unsupported entities in the file, they are ignored, and the rest of the entities are read. The supported entities are as follows: LINE, ARC, CIRCLE, ELLIPSE, INSERT, POLYLINE, and LWPOLYLINE (including bulge information). For INSERT entities, only single insertions are supported; multiple insertions using the MINSERT command are not supported. Extrusion is also not supported. A model defined from a CAD DXF file has no polarity. MIL_TEXT(\"DxfFilePath\") 1 Specifies the drive, directory, and name of the file (for example, \"C:\\mydirectory\\myfile\"). To specify a file on a remote computer (under Distributed MIL), prefix the specified file name string with \"remote:///\", for example: \"remote:///C:\\mydirectory\\myfile\". Note, if using a C compiler, you must pass the value as M_PTR_TO_MIL_INT(MIL_TEXT(\"DxfFilePath\")). M_EDGE_RESULT Specifies to define the model from the results of an edge extraction performed using Edge Finder. To define a model from an Edge Finder result buffer, the buffer must have been previously allocated using MedgeAllocResult(). MedgeCalculate() must have been already called. In addition, the Edge Finder result buffer must be compatible with the AGM context. Enable compatibility using MedgeControl() with M_AGM_COMPATIBLE prior to calling MedgeCalculate(). The model is defined to have all currently included edges in the result buffer. In the case of an Edge Finder-type model, the model image is the image from which the Edge Finder results were obtained. MIL Edge Finder result buffer identifier Specifies the identifier of the Edge Finder result buffer. The Edge Finder result buffer must be allocated on the same system as the AGM context. If it is not, an error will occur. Note that because AGM does not support calibration, the Edge Finder result buffer must be uncalibrated or M_RESULT_OUTPUT_UNITS must be set to M_PIXEL. M_IMAGE Specifies to define the model from the specified model source image. The entire image is used as the model. To define the model from a region of the model source image, use M_IMAGE_REGION instead. MIL image buffer identifier Specifies the identifier of the image buffer containing the model image. The image buffer must be a 1-band 8-bit unsigned buffer. The minimum and maximum model image sizes are 6x6 and 32768x32768 pixels, respectively. This image buffer must not have a region of interest (ROI) associated with it. Using an image buffer with an ROI will cause an error. Note that because AGM does not support calibration, the image buffer must be uncalibrated. M_IMAGE_REGION Specifies to define the model from a region of the specified model source image. Only edgels inside the region will be part of the model. The region must fully include the model's border pixels. Note that the entire model source image contributes to determining the numerical threshold value used to extract edges from the region. MIL image buffer identifier Specifies the identifier of the image buffer from which to extract the model. The image buffer must be a 1-band 8-bit unsigned buffer and must have a non-rotated rectangular region of interest (ROI) associated with it, defined using MbufSetRegion() with a 2D graphics list and either M_RASTERIZE or M_NO_RASTERIZE. An error will be generated if the ROI is only in raster format (M_RASTER), has rotation, or has a non-rectangular shape. The minimum and maximum sizes are 6x6 and 32768x32768 pixels, respectively, for both the model source image and the ROI. Note that the model's size is determined by the size of the specified region. Note that because AGM does not support calibration, the image buffer must be uncalibrated. 1 If you are passing the value in a variable, don't enclose it in MIL_TEXT(). To delete a model from an AGM context, the ModelType, SourceType, and Param1 parameters must be set to the following values. The Operation parameter must be set to M_DELETE. For removing a model from the AGM context ModelType Description SourceType Param1 M_DEFAULT Specifies the default behavior. M_DEFAULT Specifies the default behavior. M_AGM_MODEL_INDEX( MIL_INT Index ) Specifies the model in the AGM context. Parameters Index Set this parameter to the following: 0 Specifies the index of the model to delete. Return value Reserved for future expansion and returns M_NULL. Compilation information Header Include mil.h. Library Use mil.lib; milagm.lib. DLL Requires mil.dll; milagm.dll. Syntax Description Parameters - ContextId - Operation Specifies the operation - SourceType - ModelType - Param1 - ControlFlag Parameter Associations For adding a model to the AGM context [M_COMPOSITE] [M_SINGLE] For removing a model from the AGM context [M_DEFAULT] Return value Compilation information ",
      "wordCount": 1364,
      "subEntries": []
    },
    {
      "id": "Reference_agm_MagmDraw",
      "version": null,
      "title": "MagmDraw",
      "subTitles": null,
      "location": "MIL Reference",
      "pageURL": "content\\Reference\\agm\\MagmDraw.htm",
      "text": " MagmDraw Synopsis Draw specific features of the model, result occurrence, or training image in an image buffer or 2D graphics list. Syntax void MagmDraw( MIL_ID&nbsp;ContextGraId, //in MIL_ID&nbsp;ContextOrResultAgmId, //in MIL_ID&nbsp;DstImageBufOrListGraId, //in MIL_INT64&nbsp;Operation, //in MIL_INT64&nbsp;Index, //in MIL_INT64&nbsp;ControlFlag //in ) Description This function draws specific model, result occurrence, or training image features in the destination image buffer or 2D graphics list. Drawing the trained composite-definition model will help you determine the success of the MagmTrain() operation. If the trained composite-definition model does not look like the positively labeled objects in your training images, you should modify the images and repeat the training process. Parameters Parameters ContextGraId Specifies the identifier of the 2D graphics context to use when drawing. This parameter must be set to one of the following values: For specifying the 2D graphics context Value Description M_DEFAULT Specifies that the default 2D graphics context of the current MIL application is used. Note that there is a different default 2D graphics context for each thread. MIL 2D graphics context identifier Specifies a valid 2D graphics context identifier, which you have allocated using MgraAlloc(). ContextOrResultAgmId Specifies the find AGM context or AGM result buffer from which to extract the features to draw. The find AGM context must have been previously allocated using MagmAlloc() with M_GLOBAL_EDGE_BASED_FIND. The find or train AGM result buffer must have been previously allocated using MagmAllocResult() with M_GLOBAL_EDGE_BASED_FIND_RESULT or M_GLOBAL_EDGE_BASED_TRAIN_RESULT and must contain the results of a call to MagmFind() or MagmTrain(), respectively. DstImageBufOrListGraId Specifies the identifier of the destination image buffer or 2D graphics list in which to draw. The buffer can be any valid MIL image buffer allocated using MbufAlloc...(). The 2D graphics list must be previously allocated using MgraAllocList(). By drawing into a display's overlay buffer or associating the 2D graphics list with the display, you can also annotate an image non-destructively. If specifying an image buffer, it must not have a region of interest (ROI) associated with it. Using an image buffer with an ROI will cause an error. When drawing a model, the destination image must be at least the size of the model. Use MagmInquire() with M_SIZE_X and M_SIZE_Y to get the correct size. Operation Specifies the type of operation to perform. Operations can be added together to draw multiple features at a time. For example, to draw both the result occurrence's position and edges, you would set the Operation parameter to M_DRAW_POSITION + M_DRAW_EDGES. The Operation parameter can be set to a combination of the following values: The following operations can extract the features to draw only from a find AGM context and cannot draw in a 2D graphics list. For a find AGM context only Value Description M_DRAW_IMAGE Draws the model image of a single-definition or a composite-definition model. For a composite-definition model, if the image does not exist, a MIL error is thrown. To inquire if the model exists, you can use MagmInquire() with M_HAS_USER_MODEL. You can use MagmInquire() with M_SIZE_X and M_SIZE_Y to inquire the size of the model. M_DRAW_TRAINED_MODEL Draws the trained composite-definition model. You can use MagmInquire() with M_SIZE_X and M_SIZE_Y to inquire the size of the model. Combination values that can be used alone or as combination values for M_DRAW_IMAGE. You can use one or more of the following values in combination with each other or with the above-mentioned value, to specify an operation that can extract features to draw from either a find AGM context or a find AGM result buffer. For specifying an operation that can extract features to draw from either a find AGM context or a find AGM result buffer Value Description M_DRAW_BOX Draws the model box, or a bounding box around the occurrence. Note that when drawing an occurrence, the bounding box is drawn according to the occurrence's angle and scale. Since a find AGM result buffer only contains occurrences that are similar in size to the model, the occurrence's scale is close to 1.0. You can get the exact angle and scale of the occurrence, using MagmGetResult() with M_ANGLE and M_SCALE. M_DRAW_EDGES Draws the edges related to the model or result. When working with result occurrences, the drawing depends on whether you are adding M_MODEL or M_TARGET to M_DRAW_EDGES. Note that the AGM context must be preprocessed. If it is not preprocessed, a MIL error is thrown. M_DRAW_POSITION Draws a cross-like symbol at the model's reference axis origin or occurrence position. The cross is drawn maintaining the angle of the model's reference axis or the occurrence. Combination values for M_DRAW_EDGES. You can add one of the following values to the above-mentioned value to specify whether to draw the active edges of the model transformed at the occurrence position or to draw the edges of the target in the region of the occurrence. For M_DRAW_EDGES when working with result occurrences Combination value Description M_MODEL Draws the used edges of the model transformed at the occurrence position. This is the default value. M_TARGET Draws the edges of the target in the region of the occurrence. The following operations can extract the features to draw from a train AGM result buffer. For a train AGM result buffer only Value Description M_DRAW_NEG_RECTANGLES Draws all the rectangles that were used to label the negative model locations in the training image. You can use MgraColor() with M_COLOR_RED to reuse these rectangle for another MagmTrain() operation. M_DRAW_POS_RECTANGLES Draws all the rectangles that were used to label the positive model locations in the training image. Note that if the rectangles were realigned, using MagmControl() with M_REALIGN_STRENGTH, the realigned rectangles are drawn. You can use MgraColor() with M_COLOR_BLUE to reuse these rectangle for another MagmTrain() operation. Index Specifies the index of the model in the specified find AGM context, the result occurrence in the specified find AGM result buffer, or the image in the specified train AGM result buffer. This parameter should be set to one of the following values: For specifying the index of the model, result occurrence, or image Value Description M_DEFAULT Same as M_ALL. Note that this value is only available if a find AGM result buffer is specified. M_AGM_IMAGE_INDEX( MIL_INT Index ) Specifies that the drawing operation is for a specific image in the train AGM result buffer, if one is specified. Parameters Index Set this parameter to the following: Value &gt;= 0 Specifies the index of the training image. This value must be less than the value passed to the NumImages parameter of MagmTrain(). M_AGM_MODEL_INDEX( MIL_INT Index ) Specifies that the drawing operation is for a specific model in the find AGM context, if one is specified. Parameters Index Set this parameter to the following: 0 Specifies the index of the model. M_ALL Draws the specified feature of all occurrences, if a find AGM result buffer is specified. Value &gt;= 0 Specifies the index of the occurrence in the find AGM result buffer, if one is specified. ControlFlag Reserved for future expansion. this parameter must be set to M_DEFAULT. Compilation information Header Include mil.h. Library Use mil.lib; milagm.lib. DLL Requires mil.dll; milagm.dll. Syntax Description Parameters - ContextGraId For specifying the 2D graphics context - ContextOrResultAgmId - DstImageBufOrListGraId - Operation For a find AGM context only + For specifying an operation that can extract features to draw from either a find AGM context or a find AGM result buffer + For M_DRAW_EDGES when working with result occurrences For a train AGM result buffer only - Index For specifying the index of the model, result occurrence, or image - ControlFlag Compilation information ",
      "wordCount": 1246,
      "subEntries": []
    },
    {
      "id": "Reference_agm_MagmFind",
      "version": null,
      "title": "MagmFind",
      "subTitles": null,
      "location": "MIL Reference",
      "pageURL": "content\\Reference\\agm\\MagmFind.htm",
      "text": " MagmFind Synopsis Find the specified model in the target image or Edge Finder result buffer. Syntax void MagmFind( MIL_ID&nbsp;ContextAgmId, //in MIL_ID&nbsp;TargetImageOrResultId, //in MIL_ID&nbsp;ResultAgmId, //in MIL_INT64&nbsp;ControlFlag //in ) Description This function searches for the model, defined in the specified find AGM context, in the specified target image or Edge Finder result buffer. Results are stored in the specified find AGM result buffer. You can retrieve results using MagmGetResult(). Note that calling MagmFind() successively with target images of different sizes will slow the execution time. This function only searches for single-definition models or trained composite-definition models. You can train a composite-definition model using MagmTrain(), and then copy the resulting model to a find AGM context using MagmCopyResult() with M_TRAINED_MODEL. Use MagmControl() to configure individual model settings before calling this function. An occurrence is selected as a candidate if its coverage, fit, and detection scores are greater than or equal to the respective acceptance levels (MagmControl() with M_ACCEPTANCE_COVERAGE, M_ACCEPTANCE_FIT, and M_ACCEPTANCE_DETECTION). This function returns results in decreasing coverage, fit, or detection score order, depending on MagmControl() with M_SORT_CANDIDATES_SCORE. This means that the most-likely occurrence is always returned first. If you are searching for the model in an Edge Finder result buffer, MagmFind() will search for the model only in the included edges of the Edge Finder result buffer. Note that AGM does not provide support for camera calibration. If you are searching for the model in a target image buffer, the target image buffer must be uncalibrated. If you are searching in an Edge Finder result buffer, the Edge Finder result buffer must be uncalibrated or M_RESULT_OUTPUT_UNITS must be set to M_PIXEL. The AGM context must be preprocessed with MagmPreprocess() before calling this function. Parameters Parameters ContextAgmId Specifies the find AGM context identifier to use for the search. The AGM context must have been previously allocated on the system using MagmAlloc() with M_GLOBAL_EDGE_BASED_FIND. TargetImageOrResultId Specifies the identifier of the target image or Edge Finder result buffer in which to find the model. For specifying the target in which to search Value Description MIL Edge Finder result buffer identifier Specifies the identifier of the MIL Edge Finder result buffer in which to find the model. The Edge Finder result buffer must have been previously allocated on the required system using MedgeAllocResult(); MedgeCalculate() must have already been called. In addition, the Edge Finder result buffer must be compatible with the AGM context. Enable compatibility using MedgeControl() with M_AGM_COMPATIBLE prior to calling MedgeCalculate(). Note that because AGM does not support calibration, the Edge Finder result buffer must be uncalibrated or M_RESULT_OUTPUT_UNITS must be set to M_PIXEL. This value is not available when M_USE_MAGNITUDE_TARGET is set to M_ENABLE. MIL image buffer identifier Specifies the identifier of the MIL image buffer in which to find the model. The image buffer must be a 1-band 8-bit unsigned buffer. The minimum and maximum target image sizes are 6x6 and 32768x32768 pixels, respectively. It is important to note that the minimum and maximum target image sizes are MIL limits. To make sure that you have enough memory, you can call MagmFind(); if you don't have enough memory, you will get a MIL error. This image buffer must not have a region of interest (ROI) associated with it. Using an image buffer with an ROI will cause an error. Note that because AGM does not support calibration, the image buffer must be uncalibrated. ResultAgmId Specifies the identifier of the find AGM result buffer in which to store results. The result buffer must have been allocated using MagmAllocResult() with M_GLOBAL_EDGE_BASED_FIND_RESULT. ControlFlag Reserved for future expansion. This parameter must be set to M_DEFAULT. Compilation information Header Include mil.h. Library Use mil.lib; milagm.lib. DLL Requires mil.dll; milagm.dll. Syntax Description Parameters - ContextAgmId - TargetImageOrResultId For specifying the target in which to search - ResultAgmId - ControlFlag Compilation information ",
      "wordCount": 635,
      "subEntries": []
    },
    {
      "id": "Reference_agm_MagmFree",
      "version": null,
      "title": "MagmFree",
      "subTitles": null,
      "location": "MIL Reference",
      "pageURL": "content\\Reference\\agm\\MagmFree.htm",
      "text": " MagmFree Synopsis Free an AGM context or result buffer. Syntax void MagmFree( MIL_ID&nbsp;ContextOrResultAgmId //in ) Description This function deletes the specified AGM context (and its model) or result buffer identifier, and releases any memory associated with it. Note that to only delete individual models in the context, use MagmDefine(). All AGM contexts and result buffers allocated on a particular system must be freed before the system can be freed, unless M_UNIQUE_ID was specified during allocation. Parameters Parameter ContextOrResultAgmId Specifies the identifier of the AGM context or result buffer to free. These must have been successfully allocated (with MagmAlloc() or MagmAllocResult()) prior to calling this function. Compilation information Header Include mil.h. Library Use mil.lib; milagm.lib. DLL Requires mil.dll; milagm.dll. Syntax Description Parameters - ContextOrResultAgmId Compilation information ",
      "wordCount": 127,
      "subEntries": []
    },
    {
      "id": "Reference_agm_MagmGetResult",
      "version": null,
      "title": "MagmGetResult",
      "subTitles": null,
      "location": "MIL Reference",
      "pageURL": "content\\Reference\\agm\\MagmGetResult.htm",
      "text": " MagmGetResult Synopsis Get results from a find or train AGM result buffer. Syntax MIL_DOUBLE MagmGetResult( MIL_ID&nbsp;ResultAgmId, //in MIL_INT64&nbsp;Index, //in MIL_INT64&nbsp;ResultType, //in void&nbsp;*ResultArrayPtr //out ) Description This function retrieves the results of the specified type for the specified occurrence(s) from a find AGM result buffer, or for the specified model or specified rectangle from a train AGM result buffer. For find AGM result buffers, results are available after calling MagmFind(). For train AGM result buffers, results are available after calling MagmTrain(). Parameters Parameters ResultAgmId Specifies the identifier of the AGM result buffer from which to retrieve results. The result buffer must have been previously allocated on the system using MagmAllocResult() with M_GLOBAL_EDGE_BASED_FIND_RESULT or M_GLOBAL_EDGE_BASED_TRAIN_RESULT. See the Parameter associations section for possible values that can be specified. Index Specifies where to get results. For specifying where to get results Value Description M_DEFAULT Same as M_GENERAL. M_AGM_MODEL_INDEX( MIL_INT ModelIndex ) Specifies to retrieve results for the model in the train AGM result buffer. Parameters ModelIndex Set this parameter to the following: 0 Specifies the index of the model in the train AGM result buffer. M_AGM_RECTANGLE_NEG_INDEX( MIL_INT Index ) Specifies to retrieve results for a specific negative (red) rectangle in the train AGM result buffer. Parameters Index Set this parameter to the following: 0 &lt;= Value &lt; M_NUMBER_NEG_RECTANGLES Specifies the index of the negative (red) rectangle in the train AGM result buffer. M_AGM_RECTANGLE_POS_INDEX( MIL_INT Index ) Specifies to retrieve results for a specific positive (blue) rectangle in the train AGM result buffer. Parameters Index Set this parameter to the following: 0 &lt;= Value &lt; M_NUMBER_POS_RECTANGLES Specifies the index of the positive (blue) rectangle in the train AGM result buffer. M_ALL Specifies to retrieve results for all model occurrences in the find AGM result buffer. M_GENERAL Specifies to retrieve results relating to the entire find or train AGM result buffer. 0 &lt;= OccIndex &lt; M_NUMBER Specifies the index of the occurrence in the find AGM result buffer for which to retrieve results. ResultType Specifies the type of result to retrieve. See the Parameter associations section for possible values that can be specified. ResultArrayPtr Accepts the address of one of the following (see the Parameter associations section for specifics on which is expected): array of type MIL_DOUBLE [optionally, in C++: a reference to a std::vector&lt;MIL_DOUBLE&gt; ] array of type MIL_INT [optionally, in C++: a reference to a std::vector&lt;MIL_INT&gt; ] array of type MIL_INT32 [optionally, in C++: a reference to a std::vector&lt;MIL_INT32&gt; ] array of type MIL_INT64 [optionally, in C++: a reference to a std::vector&lt;MIL_INT64&gt; ] MIL_DOUBLE MIL_INT MIL_INT32 MIL_INT64 Specifies the address of the array in which to write results. See the Parameter associations section for possible values that can be returned. Parameter associations The tables below list possible values for the ResultAgmId and ResultType parameters and possible values returned to the ResultArrayPtr parameter. For retrieving general results from a find or train AGM result buffer For retrieving a result of a single occurrence or all occurrences from a find AGM result buffer For retrieving a transformation coefficient from a find AGM result buffer For retrieving rectangle results from a train AGM result buffer For retrieving model results from a train AGM result buffer To retrieve general results from a find or train AGM result buffer, set ResultType to one of the following values. In this case, set the Index parameter to M_GENERAL. For retrieving general results from a find or train AGM result buffer ResultAgmId Description ResultType ResultArrayPtr - Possible values returned Find AGM result buffer ID for general results Specifies a find AGM result buffer, allocated using MagmAllocResult() with M_GLOBAL_EDGE_BASED_FIND_RESULT, and used to store MagmFind() results. M_NUMBER Retrieves the number of occurrences found. ResultArrayPtr extra info Data type info: Data type: address of a MIL_INT Data type: address of a MIL_INT M_STATUS Retrieves the status of the find operation. ResultArrayPtr extra info Data type info: Data type: address of a MIL_INT Data type: address of a MIL_INT M_CALCULATE_NOT_PERFORMED Specifies that a find operation has not been performed. This is the initial status of a find AGM result buffer. M_COMPLETE Specifies that the find operation completed. M_CURRENTLY_CALCULATING Specifies that the find operation is ongoing. You can only get this status if you are retrieving it from another thread. M_INTERNAL_ERROR Specifies that an unexpected error occurred. M_NOT_ENOUGH_MEMORY Specifies that the operation was not completed because of a lack of available memory. Train AGM result buffer ID for general results Specifies a train AGM result buffer, allocated using MagmAllocResult() with M_GLOBAL_EDGE_BASED_TRAIN_RESULT, and used to store MagmTrain() results. M_NUMBER Retrieves the number of trained composite-definition models. Note that training results in only 0 or 1 trained composite-definition models. ResultArrayPtr extra info Data type info: Data type: address of a MIL_INT Data type: address of a MIL_INT M_NUMBER_NEG_RECTANGLES Retrieves the number of negative (red) rectangles across all training images. ResultArrayPtr extra info Data type info: Data type: address of a MIL_INT Data type: address of a MIL_INT M_NUMBER_POS_RECTANGLES Retrieves the number of positive (blue) rectangles across all training images. ResultArrayPtr extra info Data type info: Data type: address of a MIL_INT Data type: address of a MIL_INT M_STATUS Retrieves the status of the train operation. ResultArrayPtr extra info Data type info: Data type: address of a MIL_INT Data type: address of a MIL_INT M_COMPLETE Specifies that the train operation completed. Note that an M_COMPLETE result from a train AGM result buffer does not mean that training attempts on the model were successful. To check the status of an individual model, set the Index parameter to the required model's index. M_CURRENTLY_TRAINING Specifies that the train operation is ongoing. You can only get this status if you are retrieving it from another thread. M_INTERNAL_ERROR Specifies that an unexpected error occurred. M_NOT_ENOUGH_MEMORY Specifies that the operation was not completed because of a lack of available memory. M_TRAINING_NOT_PERFORMED Specifies that a train operation has not been performed. This is the initial status of a train AGM result buffer. To retrieve results for a single occurrence or for all occurrences from a find AGM result buffer, set ResultType to one of the following values. In this case, set the Index parameter to M_ALL or the index of the occurrence. For retrieving a result of a single occurrence or all occurrences from a find AGM result buffer ResultAgmId Description ResultType ResultArrayPtr - Possible values returned Find AGM result buffer ID for occurrence-specific results Specifies a find AGM result buffer, allocated using MagmAllocResult() with M_GLOBAL_EDGE_BASED_FIND_RESULT, and used to store MagmFind() results. M_ANGLE Retrieves the angle of the occurrence's reference axis, relative to the pixel coordinate system. An angle interpreted with respect to the pixel coordinate system is always measured counter-clockwise. ResultArrayPtr extra info Data type info: Data type: address of a MIL_DOUBLE &nbsp;|&nbsp; array of type MIL_DOUBLE [optionally, in C++: a reference to a std::vector&lt;MIL_DOUBLE&gt; ] MORE Data type: address of a MIL_DOUBLE Note: when retrieving an individual occurrence Data type: array of type MIL_DOUBLE [optionally, in C++: a reference to a std::vector&lt;MIL_DOUBLE&gt; ] Required array size (either of the following): MagmGetResult ( M_NUMBER ) MagmGetResult ( M_ANGLE + M_NB_ELEMENTS ) Note: when retrieving all results M_POSITION_X Retrieves the X-coordinate of the occurrence. This is the X-position of the model's reference axis transformed at the occurrence. Note, the origin of the model's reference axis is the center of the model. ResultArrayPtr extra info Data type info: Data type: address of a MIL_DOUBLE &nbsp;|&nbsp; array of type MIL_DOUBLE [optionally, in C++: a reference to a std::vector&lt;MIL_DOUBLE&gt; ] MORE Data type: address of a MIL_DOUBLE Note: when retrieving an individual occurrence Data type: array of type MIL_DOUBLE [optionally, in C++: a reference to a std::vector&lt;MIL_DOUBLE&gt; ] Required array size (either of the following): MagmGetResult ( M_NUMBER ) MagmGetResult ( M_POSITION_X + M_NB_ELEMENTS ) Note: when retrieving all results M_POSITION_Y Retrieves the Y-coordinate of the occurrence. This is the Y-position of the model's reference axis transformed at the occurrence. Note, the origin of the model's reference axis is the center of the model. ResultArrayPtr extra info Data type info: Data type: address of a MIL_DOUBLE &nbsp;|&nbsp; array of type MIL_DOUBLE [optionally, in C++: a reference to a std::vector&lt;MIL_DOUBLE&gt; ] MORE Data type: address of a MIL_DOUBLE Note: when retrieving an individual occurrence Data type: array of type MIL_DOUBLE [optionally, in C++: a reference to a std::vector&lt;MIL_DOUBLE&gt; ] Required array size (either of the following): MagmGetResult ( M_NUMBER ) MagmGetResult ( M_POSITION_Y + M_NB_ELEMENTS ) Note: when retrieving all results M_SCALE Retrieves the scale of the occurrence. Since the returned scale is uniform, it can be defined as the occurrence's size divided by the model's size. Note that only occurrences with small scale differences can be found, which means the returned scale will always be close to 1.0. ResultArrayPtr extra info Data type info: Data type: address of a MIL_DOUBLE &nbsp;|&nbsp; array of type MIL_DOUBLE [optionally, in C++: a reference to a std::vector&lt;MIL_DOUBLE&gt; ] MORE Data type: address of a MIL_DOUBLE Note: when retrieving an individual occurrence Data type: array of type MIL_DOUBLE [optionally, in C++: a reference to a std::vector&lt;MIL_DOUBLE&gt; ] Required array size (either of the following): MagmGetResult ( M_NUMBER ) MagmGetResult ( M_SCALE + M_NB_ELEMENTS ) Note: when retrieving all results M_SCORE_COVERAGE Retrieves the coverage score of the occurrence, where the coverage score is the percentage of the total length of the model's edges found in the occurrence. 100% indicates that for each of the model's edges, a corresponding edge was found in the occurrence. Note, a model's edge corresponds to an edge in the occurrence if the distance between them is less than or equal to M_MAX_ASSOCIATION_DISTANCE. ResultArrayPtr extra info Data type info: Data type: address of a MIL_DOUBLE &nbsp;|&nbsp; array of type MIL_DOUBLE [optionally, in C++: a reference to a std::vector&lt;MIL_DOUBLE&gt; ] MORE Data type: address of a MIL_DOUBLE Note: when retrieving an individual occurrence Data type: array of type MIL_DOUBLE [optionally, in C++: a reference to a std::vector&lt;MIL_DOUBLE&gt; ] Required array size (either of the following): MagmGetResult ( M_NUMBER ) MagmGetResult ( M_SCORE_COVERAGE + M_NB_ELEMENTS ) Note: when retrieving all results M_SCORE_DETECTION Retrieves the detection score of the occurrence, where the detection score represents the likelihood that the found occurrence is a true occurrence. ResultArrayPtr extra info Data type info: Data type: address of a MIL_DOUBLE &nbsp;|&nbsp; array of type MIL_DOUBLE [optionally, in C++: a reference to a std::vector&lt;MIL_DOUBLE&gt; ] MORE Data type: address of a MIL_DOUBLE Note: when retrieving an individual occurrence Data type: array of type MIL_DOUBLE [optionally, in C++: a reference to a std::vector&lt;MIL_DOUBLE&gt; ] Required array size (either of the following): MagmGetResult ( M_NUMBER ) MagmGetResult ( M_SCORE_DETECTION + M_NB_ELEMENTS ) Note: when retrieving all results M_SCORE_FIT Retrieves the fit score of the occurrence, where the fit score is a measure of the correlation of the edges in the model to those of the occurrence. The score is calculated as follows: Fit Score = 1 - Normalized fit error The fit error is the average distance, in pixels, between the edges in the model and their corresponding edges in the occurrence. Note, only those model edges that have a corresponding edge in the occurrence are used in the fit score calculation. A model's edge has a corresponding edge in the occurrence if the distance between them is less than or equal to M_MAX_ASSOCIATION_DISTANCE. ResultArrayPtr extra info Data type info: Data type: address of a MIL_DOUBLE &nbsp;|&nbsp; array of type MIL_DOUBLE [optionally, in C++: a reference to a std::vector&lt;MIL_DOUBLE&gt; ] MORE Data type: address of a MIL_DOUBLE Note: when retrieving an individual occurrence Data type: array of type MIL_DOUBLE [optionally, in C++: a reference to a std::vector&lt;MIL_DOUBLE&gt; ] Required array size (either of the following): MagmGetResult ( M_NUMBER ) MagmGetResult ( M_SCORE_FIT + M_NB_ELEMENTS ) Note: when retrieving all results To retrieve a transformation coefficient for a single occurrence or for all occurrences from a find AGM result buffer, set ResultType to one of the following values. In this case, set the Index parameter to M_ALL or the index of the occurrence. These coefficients allow you to convert coordinates in the model coordinate system to the corresponding coordinates in the target coordinate system for that occurrence (or vice versa). These coefficients handle variations in translation and angle. Use the following equations: x d = A x s + B y s + C y d = E x s + F y s + D where A, B, C, D, E, and F are the transformation coefficients (forward or reverse); x s and y s specify the source coordinates (with respect to the origin of the model coordinate system for a forward transformation or target coordinate system for a reverse transformation); and, x d and y d are the destination coordinates (with respect to the origin of the target coordinate system for a forward transformation or model coordinate system for a reverse transformation). For retrieving a transformation coefficient from a find AGM result buffer ResultAgmId Description ResultType ResultArrayPtr - Possible values returned Find AGM result buffer ID for transformation coefficient results Specifies a find AGM result buffer, allocated using MagmAllocResult() with M_GLOBAL_EDGE_BASED_FIND_RESULT, and used to store MagmFind() results. M_A_FORWARD Retrieves the forward transformation coefficient A for the occurrence. ResultArrayPtr extra info Data type info: Data type: address of a MIL_DOUBLE &nbsp;|&nbsp; array of type MIL_DOUBLE [optionally, in C++: a reference to a std::vector&lt;MIL_DOUBLE&gt; ] MORE Data type: address of a MIL_DOUBLE Note: when retrieving an individual occurrence Data type: array of type MIL_DOUBLE [optionally, in C++: a reference to a std::vector&lt;MIL_DOUBLE&gt; ] Required array size (either of the following): MagmGetResult ( M_NUMBER ) MagmGetResult ( M_A_FORWARD + M_NB_ELEMENTS ) Note: when retrieving all results M_A_REVERSE Retrieves the reverse transformation coefficient A for the occurrence. ResultArrayPtr extra info Data type info: Data type: address of a MIL_DOUBLE &nbsp;|&nbsp; array of type MIL_DOUBLE [optionally, in C++: a reference to a std::vector&lt;MIL_DOUBLE&gt; ] MORE Data type: address of a MIL_DOUBLE Note: when retrieving an individual occurrence Data type: array of type MIL_DOUBLE [optionally, in C++: a reference to a std::vector&lt;MIL_DOUBLE&gt; ] Required array size (either of the following): MagmGetResult ( M_NUMBER ) MagmGetResult ( M_A_REVERSE + M_NB_ELEMENTS ) Note: when retrieving all results M_B_FORWARD Retrieves the forward transformation coefficient B for the occurrence. ResultArrayPtr extra info Data type info: Data type: address of a MIL_DOUBLE &nbsp;|&nbsp; array of type MIL_DOUBLE [optionally, in C++: a reference to a std::vector&lt;MIL_DOUBLE&gt; ] MORE Data type: address of a MIL_DOUBLE Note: when retrieving an individual occurrence Data type: array of type MIL_DOUBLE [optionally, in C++: a reference to a std::vector&lt;MIL_DOUBLE&gt; ] Required array size (either of the following): MagmGetResult ( M_NUMBER ) MagmGetResult ( M_B_FORWARD + M_NB_ELEMENTS ) Note: when retrieving all results M_B_REVERSE Retrieves the reverse transformation coefficient B for the occurrence. ResultArrayPtr extra info Data type info: Data type: address of a MIL_DOUBLE &nbsp;|&nbsp; array of type MIL_DOUBLE [optionally, in C++: a reference to a std::vector&lt;MIL_DOUBLE&gt; ] MORE Data type: address of a MIL_DOUBLE Note: when retrieving an individual occurrence Data type: array of type MIL_DOUBLE [optionally, in C++: a reference to a std::vector&lt;MIL_DOUBLE&gt; ] Required array size (either of the following): MagmGetResult ( M_NUMBER ) MagmGetResult ( M_B_REVERSE + M_NB_ELEMENTS ) Note: when retrieving all results M_C_FORWARD Retrieves the forward transformation coefficient C for the occurrence. ResultArrayPtr extra info Data type info: Data type: address of a MIL_DOUBLE &nbsp;|&nbsp; array of type MIL_DOUBLE [optionally, in C++: a reference to a std::vector&lt;MIL_DOUBLE&gt; ] MORE Data type: address of a MIL_DOUBLE Note: when retrieving an individual occurrence Data type: array of type MIL_DOUBLE [optionally, in C++: a reference to a std::vector&lt;MIL_DOUBLE&gt; ] Required array size (either of the following): MagmGetResult ( M_NUMBER ) MagmGetResult ( M_C_FORWARD + M_NB_ELEMENTS ) Note: when retrieving all results M_C_REVERSE Retrieves the reverse transformation coefficient C for the occurrence. ResultArrayPtr extra info Data type info: Data type: address of a MIL_DOUBLE &nbsp;|&nbsp; array of type MIL_DOUBLE [optionally, in C++: a reference to a std::vector&lt;MIL_DOUBLE&gt; ] MORE Data type: address of a MIL_DOUBLE Note: when retrieving an individual occurrence Data type: array of type MIL_DOUBLE [optionally, in C++: a reference to a std::vector&lt;MIL_DOUBLE&gt; ] Required array size (either of the following): MagmGetResult ( M_NUMBER ) MagmGetResult ( M_C_REVERSE + M_NB_ELEMENTS ) Note: when retrieving all results M_D_FORWARD Retrieves the forward transformation coefficient D for the occurrence. ResultArrayPtr extra info Data type info: Data type: address of a MIL_DOUBLE &nbsp;|&nbsp; array of type MIL_DOUBLE [optionally, in C++: a reference to a std::vector&lt;MIL_DOUBLE&gt; ] MORE Data type: address of a MIL_DOUBLE Note: when retrieving an individual occurrence Data type: array of type MIL_DOUBLE [optionally, in C++: a reference to a std::vector&lt;MIL_DOUBLE&gt; ] Required array size (either of the following): MagmGetResult ( M_NUMBER ) MagmGetResult ( M_D_FORWARD + M_NB_ELEMENTS ) Note: when retrieving all results M_D_REVERSE Retrieves the reverse transformation coefficient D for the occurrence. ResultArrayPtr extra info Data type info: Data type: address of a MIL_DOUBLE &nbsp;|&nbsp; array of type MIL_DOUBLE [optionally, in C++: a reference to a std::vector&lt;MIL_DOUBLE&gt; ] MORE Data type: address of a MIL_DOUBLE Note: when retrieving an individual occurrence Data type: array of type MIL_DOUBLE [optionally, in C++: a reference to a std::vector&lt;MIL_DOUBLE&gt; ] Required array size (either of the following): MagmGetResult ( M_NUMBER ) MagmGetResult ( M_D_REVERSE + M_NB_ELEMENTS ) Note: when retrieving all results M_E_FORWARD Retrieves the forward transformation coefficient E for the occurrence. ResultArrayPtr extra info Data type info: Data type: address of a MIL_DOUBLE &nbsp;|&nbsp; array of type MIL_DOUBLE [optionally, in C++: a reference to a std::vector&lt;MIL_DOUBLE&gt; ] MORE Data type: address of a MIL_DOUBLE Note: when retrieving an individual occurrence Data type: array of type MIL_DOUBLE [optionally, in C++: a reference to a std::vector&lt;MIL_DOUBLE&gt; ] Required array size (either of the following): MagmGetResult ( M_NUMBER ) MagmGetResult ( M_E_FORWARD + M_NB_ELEMENTS ) Note: when retrieving all results M_E_REVERSE Retrieves the reverse transformation coefficient E for the occurrence. ResultArrayPtr extra info Data type info: Data type: address of a MIL_DOUBLE &nbsp;|&nbsp; array of type MIL_DOUBLE [optionally, in C++: a reference to a std::vector&lt;MIL_DOUBLE&gt; ] MORE Data type: address of a MIL_DOUBLE Note: when retrieving an individual occurrence Data type: array of type MIL_DOUBLE [optionally, in C++: a reference to a std::vector&lt;MIL_DOUBLE&gt; ] Required array size (either of the following): MagmGetResult ( M_NUMBER ) MagmGetResult ( M_E_REVERSE + M_NB_ELEMENTS ) Note: when retrieving all results M_F_FORWARD Retrieves the forward transformation coefficient F for the occurrence. ResultArrayPtr extra info Data type info: Data type: address of a MIL_DOUBLE &nbsp;|&nbsp; array of type MIL_DOUBLE [optionally, in C++: a reference to a std::vector&lt;MIL_DOUBLE&gt; ] MORE Data type: address of a MIL_DOUBLE Note: when retrieving an individual occurrence Data type: array of type MIL_DOUBLE [optionally, in C++: a reference to a std::vector&lt;MIL_DOUBLE&gt; ] Required array size (either of the following): MagmGetResult ( M_NUMBER ) MagmGetResult ( M_F_FORWARD + M_NB_ELEMENTS ) Note: when retrieving all results M_F_REVERSE Retrieves the reverse transformation coefficient F for the occurrence. ResultArrayPtr extra info Data type info: Data type: address of a MIL_DOUBLE &nbsp;|&nbsp; array of type MIL_DOUBLE [optionally, in C++: a reference to a std::vector&lt;MIL_DOUBLE&gt; ] MORE Data type: address of a MIL_DOUBLE Note: when retrieving an individual occurrence Data type: array of type MIL_DOUBLE [optionally, in C++: a reference to a std::vector&lt;MIL_DOUBLE&gt; ] Required array size (either of the following): MagmGetResult ( M_NUMBER ) MagmGetResult ( M_F_REVERSE + M_NB_ELEMENTS ) Note: when retrieving all results To retrieve results for a positive (blue) or negative (red) rectangle from a train AGM result buffer, set ResultType to one of the following values. In this case, set the Index parameter to the index of the positive or negative rectangle. For retrieving rectangle results from a train AGM result buffer ResultAgmId Description ResultType ResultArrayPtr - Possible values returned Train AGM result buffer ID for rectangle-specific results Specifies a train AGM result buffer, allocated using MagmAllocResult() with M_GLOBAL_EDGE_BASED_TRAIN_RESULT, and used to store MagmTrain() results. M_CENTER_X Retrieves the X-coordinate of the center of the rectangle. ResultArrayPtr extra info Data type info: Data type: address of a MIL_DOUBLE Data type: address of a MIL_DOUBLE M_CENTER_Y Retrieves the Y-coordinate of the center of the rectangle. ResultArrayPtr extra info Data type info: Data type: address of a MIL_DOUBLE Data type: address of a MIL_DOUBLE M_CORNER_TOP_LEFT_X Retrieves the X-coordinate of the top-left corner of the rectangle. ResultArrayPtr extra info Data type info: Data type: address of a MIL_DOUBLE Data type: address of a MIL_DOUBLE M_CORNER_TOP_LEFT_Y Retrieves the Y-coordinate of the top-left corner of the rectangle. ResultArrayPtr extra info Data type info: Data type: address of a MIL_DOUBLE Data type: address of a MIL_DOUBLE M_IMAGE_INDEX Retrieves the index of the training image that contains the specified rectangle. ResultArrayPtr extra info Data type info: Data type: address of a MIL_INT Data type: address of a MIL_INT M_RECTANGLE_HEIGHT Retrieves the height of the rectangle. ResultArrayPtr extra info Data type info: Data type: address of a MIL_DOUBLE Data type: address of a MIL_DOUBLE M_RECTANGLE_WIDTH Retrieves the width of the rectangle. ResultArrayPtr extra info Data type info: Data type: address of a MIL_DOUBLE Data type: address of a MIL_DOUBLE To retrieve results for a model from a train AGM result buffer, set ResultType to one of the following values. In this case, set the Index parameter to the index of the model. For retrieving model results from a train AGM result buffer ResultAgmId Description ResultType ResultArrayPtr - Possible values returned Train AGM result buffer ID for model-specific results Specifies a train AGM result buffer, allocated using MagmAllocResult() with M_GLOBAL_EDGE_BASED_TRAIN_RESULT, and used to store MagmTrain() results. M_STATUS Retrieves the status of the model. ResultArrayPtr extra info Data type info: Data type: address of a MIL_INT Data type: address of a MIL_INT M_STATUS_TRAIN_AUTO_LABELING_FAILED Specifies that the automatic labeling of negative model locations was unsuccessful. In this case, the model could not be trained and is unusable. You cannot copy the failed model to a find AGM context using MagmCopyResult(). M_STATUS_TRAIN_FAILED Specifies that the model could not be trained and is unusable. You cannot copy the failed model to a find AGM context using MagmCopyResult(). M_STATUS_TRAIN_OK Specifies that the model was successfully trained and is usable in a find AGM context. M_TRAINING_CONFIDENCE Retrieves the training confidence of the trained composite-definition model. The training confidence represents an estimation of the difference between the detection scores at the positive positions and the detection scores at the negative positions in the training images. The detection score is the likelihood that there is a true occurrence at the position. Note that a good training confidence is 20.0% or higher. The higher the training confidence, the better the trained composite-definition model will be at discriminating true occurrences from false occurrences. Note that the training confidence should be used to evaluate the trained composite-definition model. If the training confidence is too low, you should adjust your training settings and re-train the composite-definition model. This result type is only available when M_STATUS is M_STATUS_TRAIN_OK and is only meaningful when M_TRAINING_ERROR is 0.0%. ResultArrayPtr extra info Data type info: Data type: address of a MIL_DOUBLE Data type: address of a MIL_DOUBLE 0.0 &lt;= Value &lt;= 100.0 Specifies the training confidence. M_TRAINING_ERROR Retrieves the percentage of training image labels that were misclassified by the MagmTrain() operation. For example, assume you train the composite-definition model using images that contain 5 positive (blue) rectangles and 5 negative (red) rectangles. If the detection score at 4/5 of the positive positions is greater than or equal to the trained acceptance level and the detection score at 4/5 of the negative positions is correctly below the trained acceptance level, 2/10 positions are misclassified and the training error will be 20.0%. A training error of 0.0% means that the trained composite-definition model is able to detect all positively labeled positions without incorrectly detecting any negatively labeled positions. This result type is only available when M_STATUS is M_STATUS_TRAIN_OK. ResultArrayPtr extra info Data type info: Data type: address of a MIL_DOUBLE Data type: address of a MIL_DOUBLE Combination value for Tables: For retrieving general results from a find or train AGM result buffer For retrieving a result of a single occurrence or all occurrences from a find AGM result buffer For retrieving a transformation coefficient from a find AGM result buffer For retrieving rectangle results from a train AGM result buffer For retrieving model results from a train AGM result buffer the values listed in all the parameter association tables. You can add the following value to the above-mentioned values to determine whether a result is available. For determining whether results are available ResultType Description ResultArrayPtr - Possible values returned M_AVAILABLE Retrieves whether the requested result type is available for retrieval. ResultArrayPtr extra info Data type info: Data type: array of type MIL_INT [optionally, in C++: a reference to a std::vector&lt;MIL_INT&gt; ] &nbsp;|&nbsp; address of a MIL_INT MORE Data type: array of type MIL_INT [optionally, in C++: a reference to a std::vector&lt;MIL_INT&gt; ] Required array size:(defined elsewhere) Note: When multiple results. Data type: address of a MIL_INT Note: When a single result. M_FALSE Specifies that the requested result type is not available. M_TRUE Specifies that the requested result type is available. Combination value for the values of the ResultType parameter listed in For retrieving a result of a single occurrence or all occurrences from a find AGM result buffer, For retrieving a transformation coefficient from a find AGM result buffer. You can add the following value to the above-mentioned values to determine the required array size (number of elements) to store the returned values. For determining the required array size (number of elements) to store the returned values ResultType combination value Description ResultArrayPtr - Possible values returned M_NB_ELEMENTS Retrieves the required array size (number of elements) to store the returned values. ResultArrayPtr extra info Data type info: Data type: address of a MIL_DOUBLE MORE Data type: address of a MIL_DOUBLE Recommended casting type: MIL_INT Combination values for Tables: For retrieving general results from a find or train AGM result buffer For retrieving a result of a single occurrence or all occurrences from a find AGM result buffer For retrieving a transformation coefficient from a find AGM result buffer For retrieving rectangle results from a train AGM result buffer For retrieving model results from a train AGM result buffer the values listed in all the parameter association tables. You can add one of the following values to the above-mentioned values to cast the requested results to the required data type. Note: In C++, when using a standard vector (std::vector) instead of an array, the values listed in this combination table must not be used. If you need to use a specific data type, instantiate the vector with the necessary data type. For specifying the data type ResultType Description ResultArrayPtr - Possible values returned M_TYPE_MIL_DOUBLE Casts the requested results to a MIL_DOUBLE. ResultArrayPtr extra info Data type info: Data type: array of type MIL_DOUBLE [optionally, in C++: a reference to a std::vector&lt;MIL_DOUBLE&gt; ] &nbsp;|&nbsp; address of a MIL_DOUBLE MORE Data type: array of type MIL_DOUBLE [optionally, in C++: a reference to a std::vector&lt;MIL_DOUBLE&gt; ] Required array size:(defined elsewhere) Note: When multiple results. Data type: address of a MIL_DOUBLE Note: When a single result. M_TYPE_MIL_INT Casts the requested results to a MIL_INT. ResultArrayPtr extra info Data type info: Data type: array of type MIL_INT [optionally, in C++: a reference to a std::vector&lt;MIL_INT&gt; ] &nbsp;|&nbsp; address of a MIL_INT MORE Data type: array of type MIL_INT [optionally, in C++: a reference to a std::vector&lt;MIL_INT&gt; ] Required array size:(defined elsewhere) Note: When multiple results. Data type: address of a MIL_INT Note: When a single result. M_TYPE_MIL_INT32 Casts the requested results to a MIL_INT32. ResultArrayPtr extra info Data type info: Data type: array of type MIL_INT32 [optionally, in C++: a reference to a std::vector&lt;MIL_INT32&gt; ] &nbsp;|&nbsp; address of a MIL_INT32 MORE Data type: array of type MIL_INT32 [optionally, in C++: a reference to a std::vector&lt;MIL_INT32&gt; ] Required array size:(defined elsewhere) Note: When multiple results. Data type: address of a MIL_INT32 Note: When a single result. M_TYPE_MIL_INT64 Casts the requested results to a MIL_INT64. ResultArrayPtr extra info Data type info: Data type: array of type MIL_INT64 [optionally, in C++: a reference to a std::vector&lt;MIL_INT64&gt; ] &nbsp;|&nbsp; address of a MIL_INT64 MORE Data type: array of type MIL_INT64 [optionally, in C++: a reference to a std::vector&lt;MIL_INT64&gt; ] Required array size:(defined elsewhere) Note: When multiple results. Data type: address of a MIL_INT64 Note: When a single result. Return value The returned value is the requested information, cast to a MIL_DOUBLE. If the requested information does not fit into a MIL_DOUBLE, this function will return M_NULL or truncate the information. Compilation information Header Include mil.h. Library Use mil.lib; milagm.lib. DLL Requires mil.dll; milagm.dll. Syntax Description Parameters - ResultAgmId - Index For specifying where to get results - ResultType - ResultArrayPtr Parameter Associations For retrieving general results from a find or train AGM result buffer [Find AGM result buffer ID for general results] [Train AGM result buffer ID for general results] For retrieving a result of a single occurrence or all occurrences from a find AGM result buffer [Find AGM result buffer ID for occurrence-specific results] For retrieving a transformation coefficient from a find AGM result buffer [Find AGM result buffer ID for transformation coefficient results] For retrieving rectangle results from a train AGM result buffer [Train AGM result buffer ID for rectangle-specific results] For retrieving model results from a train AGM result buffer [Train AGM result buffer ID for model-specific results] + For determining whether results are available + For determining the required array size (number of elements) to store the returned values + For specifying the data type Return value Compilation information ",
      "wordCount": 4914,
      "subEntries": []
    },
    {
      "id": "Reference_agm_MagmInquire",
      "version": null,
      "title": "MagmInquire",
      "subTitles": null,
      "location": "MIL Reference",
      "pageURL": "content\\Reference\\agm\\MagmInquire.htm",
      "text": " MagmInquire Synopsis Inquire information about a specified AGM context, model, or result buffer. Syntax MIL_INT64 MagmInquire( MIL_ID&nbsp;ContextOrResultId, //in MIL_INT64&nbsp;Index, //in MIL_INT64&nbsp;InquireType, //in void&nbsp;*UserVarPtr //out ) Description This function inquires about a setting of an AGM context, a model contained therein, or an AGM result buffer. Parameters Parameters ContextOrResultId Specifies the identifier of the find or train AGM context or result buffer about which to inquire information. See the Parameter associations section for possible values that can be specified. Index Specifies that information will be inquired about an AGM context, an individual model, or an AGM result buffer. Set this parameter to one of the following values: For specifying a context, model, or result buffer Value Description M_DEFAULT Specifies the default. If an AGM context is specified, same as M_CONTEXT. If an AGM result buffer is specified, same as M_GENERAL. M_AGM_MODEL_INDEX( MIL_INT ModelIndex ) Inquires information about an individual model. Parameters ModelIndex Set this parameter to the following: 0 Specifies the index of the model. M_CONTEXT Inquires information about an AGM context. M_GENERAL Inquires information about an AGM result buffer. InquireType Specifies the type of information about which to inquire. See the Parameter associations section for possible values that can be specified. UserVarPtr Accepts the address of one of the following (see the Parameter associations section for specifics on which is expected): MIL_DOUBLE MIL_FLOAT MIL_ID MIL_INT MIL_INT32 MIL_INT64 Specifies the address in which to write the requested information. Since the MagmInquire() function also returns the requested information, you can set this parameter to M_NULL. See the Parameter associations section for possible values that can be returned. Parameter associations The tables below list possible values for the ContextOrResultId and InquireType parameters and possible values returned to the UserVarPtr parameter. For inquiring about a find or train AGM context For inquiring about the type of model in a find or train AGM context For inquiring about a model in an AGM context For inquiring about a find or train AGM result buffer To inquire information about a find or train AGM context, the InquireType parameter can be set to one of the following values. In this case, you must set the Index parameter to M_CONTEXT or M_DEFAULT. For inquiring about a find or train AGM context ContextOrResultId Description InquireType UserVarPtr - Possible values returned AGM context ID Specifies the identifier of a find or train AGM context, allocated using MagmAlloc(). M_MODIFICATION_COUNT Inquires the current value of the modification counter. The modification counter is increased by one each time settings for the context are modified. Although you cannot identify the modification counter's contents, you can compare them throughout your application to know if the context has been altered. If the modification counter has changed you can, for example, prompt the user to save before closing the application. UserVarPtr extra info Data type info: Data type: address of a MIL_INT Data type: address of a MIL_INT Value Specifies the current value of the modification counter. M_NUMBER_OF_MODELS Inquires the number of models in the AGM context. UserVarPtr extra info Data type info: Data type: address of a MIL_INT Data type: address of a MIL_INT 0 &lt;= Value &lt;= 1 Specifies the number of models. M_OWNER_SYSTEM Inquires the identifier of the system on which the AGM context was allocated. UserVarPtr extra info Data type info: Data type: address of a MIL_ID Data type: address of a MIL_ID M_DEFAULT_HOST Specifies the default Host system of the current MIL application. MIL system identifier Specifies a valid system identifier, previously allocated using MsysAlloc(). M_PREPROCESSED Inquires whether the AGM context is preprocessed. The context must be preprocessed (using MagmPreprocess()) before calling MagmFind() or MagmTrain(). After certain settings of the AGM context are changed with MagmControl(), a model is added or removed with MagmDefine(), or a composite-definition model is copied with MagmCopyResult(), this inquire type will indicate that the context is no longer in its preprocessed state. UserVarPtr extra info Data type info: Data type: address of a MIL_INT Data type: address of a MIL_INT M_FALSE Specifies that the context is not preprocessed. M_TRUE Specifies that the context is preprocessed. To inquire information about the type of model in a find or train AGM context, the InquireType parameter can be set to the following value. In this case, you must set the Index parameter to the index of a specific model, using M_AGM_MODEL_INDEX(). For inquiring about the type of model in a find or train AGM context ContextOrResultId Description InquireType UserVarPtr - Possible values returned AGM context ID with a model Specifies a find or train AGM context, allocated using MagmAlloc(). It must contain a model. M_MODEL_TYPE Inquires the type of the specified model. UserVarPtr extra info Data type info: Data type: address of a MIL_INT Data type: address of a MIL_INT M_COMPOSITE Specifies a composite-definition model. M_SINGLE Specifies a single-definition model. To inquire information about a model in an AGM context, the InquireType parameter can be set to one of the following values. In this case, you must set the Index parameter to the index of a specific model, using M_AGM_MODEL_INDEX(). For inquiring about a model in an AGM context ContextOrResultId Description InquireType UserVarPtr - Possible values returned Find AGM context ID with a composite-definition model Specifies a find AGM context, allocated using MagmAlloc() with M_GLOBAL_EDGE_BASED_FIND and used in MagmFind() operations. It must contain a composite-definition model. M_ACCEPTANCE_COVERAGE Inquires the minimum coverage score required for an occurrence to be considered a match. UserVarPtr extra info Data type info: Data type: address of a MIL_DOUBLE Data type: address of a MIL_DOUBLE 0.0 &lt;= Value &lt;= 100.0 Specifies the minimum acceptable coverage score, as a percentage. M_ACCEPTANCE_DETECTION Inquires the minimum detection score required for an occurrence to be considered a match. UserVarPtr extra info Data type info: Data type: address of a MIL_DOUBLE Data type: address of a MIL_DOUBLE 0.0 &lt;= Value &lt;= 100.0 Specifies the minimum acceptable detection score, as a percentage. M_ACCEPTANCE_DETECTION_FROM_TRAIN Inquires the minimum detection score required for an occurrence to be considered a match; this score was automatically determined during the training of the composite-definition model. UserVarPtr extra info Data type info: Data type: address of a MIL_DOUBLE Data type: address of a MIL_DOUBLE 0.0 &lt;= Value &lt;= 100.0 Specifies the minimum acceptable detection score, as a percentage. M_ACCEPTANCE_DETECTION_SOURCE Inquires whether the trained acceptance level or a custom acceptance level is used for the detection score. UserVarPtr extra info Data type info: Data type: address of a MIL_INT Data type: address of a MIL_INT M_FROM_TRAIN Specifies to use the detection score's acceptance level established during the training of the model. M_USER_DEFINED Specifies to use the value specified with M_ACCEPTANCE_DETECTION. M_ACCEPTANCE_FIT Inquires the minimum fit score required for an occurrence to be considered a match. UserVarPtr extra info Data type info: Data type: address of a MIL_DOUBLE Data type: address of a MIL_DOUBLE 0.0 &lt;= Value &lt;= 100.0 Specifies the minimum acceptable fit score, as a percentage. M_EMPTY_REGIONS_MODE Inquires whether the regions of the trained composite-definition model that do not contain edges are considered when searching for model occurrences. Note that you can set this in the train AGM context using M_EMPTY_REGIONS_MODE before training; once the model is trained and copied to a find AGM context, you cannot change this setting. UserVarPtr extra info Data type info: Data type: address of a MIL_INT Data type: address of a MIL_INT M_AUTO Specifies to automatically determine the empty regions. M_DISABLE Specifies not to consider empty regions. M_FIT_MODE Inquires the mode of the fit operation. UserVarPtr extra info Data type info: Data type: address of a MIL_INT Data type: address of a MIL_INT M_DISABLE Specifies to disable the fit operation; the positional results are determined by detection only. M_PIXEL_PRECISION Specifies to calculate the fit with pixel precision. M_SUBPIXEL_PRECISION Specifies to calculate the fit with subpixel precision. M_HAS_USER_MODEL Inquires whether the model contains a separate image to use for the fit and coverage calculations when M_MODEL_SOURCE is set to M_USER_IMAGE. For a find AGM context containing a trained composite-definition model, you can specify a model image buffer using MagmControl() with M_MODEL_IMAGE. You can then set M_MODEL_SOURCE to use this model image for the fit and coverage calculations. If a model image buffer was not specified, this inquire type will return M_FALSE, and the trained composite-definition model will be used for these calculations. UserVarPtr extra info Data type info: Data type: address of a MIL_INT Data type: address of a MIL_INT M_FALSE Specifies that the model does not contain a separate image. M_TRUE Specifies that the model contains a separate image. M_MAX_ACCEPTED_OVERLAP Inquires the maximum allowable overlap between found occurrences, as a percentage. UserVarPtr extra info Data type info: Data type: address of a MIL_DOUBLE Data type: address of a MIL_DOUBLE 0.0 &lt;= Value &lt;= 100.0 Specifies the acceptable overlap, as a percentage. M_MAX_ASSOCIATION_DISTANCE Inquires the maximum distance that a model edgel can be from the nearest occurrence edgel for that edgel to count towards the fit operation and increase the coverage score. UserVarPtr extra info Data type info: Data type: address of a MIL_DOUBLE Data type: address of a MIL_DOUBLE 1.0 &lt;= Value &lt;= 4.0 Specifies the maximum association distance, in pixels. M_MODEL_PRECISION Inquires the percentage of the trained composite-definition model's edgels to use when searching for occurrences. Note that you can set this in the train AGM context using M_MODEL_PRECISION before training; once the model is trained and copied to a find AGM context, you cannot change this setting. UserVarPtr extra info Data type info: Data type: address of a MIL_DOUBLE Data type: address of a MIL_DOUBLE 0.0 &lt;= Value &lt;= 100.0 Specifies the amount of model edgels, as a percentage. M_MODEL_SOURCE Inquires whether the trained composite-definition model or a prototypical image of the model is used for the fit and coverage calculations. UserVarPtr extra info Data type info: Data type: address of a MIL_INT Data type: address of a MIL_INT M_FROM_TRAIN Specifies to use the trained composite-definition model. M_USER_IMAGE Specifies to use the image set with M_MODEL_IMAGE. M_PERSEVERANCE_DETECTION Inquires the algorithm's perseverance when searching for occurrences. UserVarPtr extra info Data type info: Data type: address of a MIL_DOUBLE Data type: address of a MIL_DOUBLE 0.0 &lt;= Value &lt;= 100.0 Specifies the perseverance, as a percentage. M_REFERENCE_X Inquires the X-coordinate of the origin of the model's reference axis, relative to the model origin. UserVarPtr extra info Data type info: Data type: address of a MIL_DOUBLE Data type: address of a MIL_DOUBLE Value Specifies the X-coordinate, in pixels. M_REFERENCE_Y Inquires the Y-coordinate of the origin of the model's reference axis, relative to the model origin. UserVarPtr extra info Data type info: Data type: address of a MIL_DOUBLE Data type: address of a MIL_DOUBLE Value Specifies the Y-coordinate, in pixels. M_SIZE_X Inquires the width of the model. The width of the trained composite-definition model is the same width as the training images' rectangles. UserVarPtr extra info Data type info: Data type: address of a MIL_INT Data type: address of a MIL_INT Value &gt;= 6 Specifies the width of the model, in pixels. M_SIZE_Y Inquires the height of the model. The height of the trained composite-definition model is the same height as the training images' rectangles. UserVarPtr extra info Data type info: Data type: address of a MIL_INT Data type: address of a MIL_INT Value &gt;= 6 Specifies the height of the model, in pixels. M_SMOOTHNESS Inquires the degree of smoothness (noise reduction) applied to the model image and target image(s) during the edge extraction. UserVarPtr extra info Data type info: Data type: address of a MIL_DOUBLE Data type: address of a MIL_DOUBLE 0.0 &lt;= Value &lt;= 100.0 Specifies the smoothness value applied to the images, as a percentage. M_SMOOTHNESS_FROM_TRAIN Inquires the degree of smoothness (noise reduction) applied to the training images during the edge extraction. Note that you can set this in the train AGM context using M_SMOOTHNESS before training; once the model is trained and copied to a find AGM context, you cannot change this setting. UserVarPtr extra info Data type info: Data type: address of a MIL_DOUBLE Data type: address of a MIL_DOUBLE 0.0 &lt;= Value &lt;= 100.0 Specifies the smoothness value applied to the images, as a percentage. M_SMOOTHNESS_SOURCE Inquires whether the smoothness value set during training or a custom smoothness value is used for the degree of noise reduction applied to the model image and target image(s) during the edge extraction. UserVarPtr extra info Data type info: Data type: address of a MIL_INT Data type: address of a MIL_INT M_FROM_TRAIN Specifies to use the smoothness value set during the training of the model. This value was set with M_SMOOTHNESS in a train AGM context. M_USER_DEFINED Specifies to use the smoothness value set with M_SMOOTHNESS. M_SORT_CANDIDATES_SCORE Inquires the type of score used to sort candidates. UserVarPtr extra info Data type info: Data type: address of a MIL_INT Data type: address of a MIL_INT M_SCORE_COVERAGE Specifies to use the coverage score to sort candidates. M_SCORE_DETECTION Specifies to use the detection score to sort candidates. M_SCORE_FIT Specifies to use the fit score to sort candidates. M_STABLE_EDGELS_MODE Inquires whether only stable edges are used when searching for occurrences. UserVarPtr extra info Data type info: Data type: address of a MIL_INT Data type: address of a MIL_INT M_DISABLE Specifies not to use only stable edgels. M_SMOOTHNESS_STABLE Specifies to use only stable edgels. M_STEP_X Inquires the X step size of explored positions to search for occurrences. UserVarPtr extra info Data type info: Data type: address of a MIL_INT Data type: address of a MIL_INT Value &gt;= 1 Specifies the X step size. M_STEP_Y Inquires the Y step size of explored positions to search for occurrences. UserVarPtr extra info Data type info: Data type: address of a MIL_INT Data type: address of a MIL_INT Value &gt;= 1 Specifies the Y step size. M_THRESHOLD_MODE Inquires the threshold mode of the edge extraction. UserVarPtr extra info Data type info: Data type: address of a MIL_INT Data type: address of a MIL_INT M_DISABLE Specifies no threshold. M_HIGH Specifies a high threshold. M_LOW Specifies a low threshold. M_MEDIUM Specifies a medium threshold. M_VERY_HIGH Specifies a very high threshold. M_THRESHOLD_MODE_FROM_TRAIN Inquires the threshold mode of the edge extraction used during training. UserVarPtr extra info Data type info: Data type: address of a MIL_INT Data type: address of a MIL_INT M_DISABLE Specifies no threshold. M_HIGH Specifies a high threshold. M_LOW Specifies a low threshold. M_MEDIUM Specifies a medium threshold. M_VERY_HIGH Specifies a very high threshold. M_THRESHOLD_MODE_SOURCE Inquires whether the threshold mode set during training or a custom threshold mode is used for the edge extraction. UserVarPtr extra info Data type info: Data type: address of a MIL_INT Data type: address of a MIL_INT M_FROM_TRAIN Specifies to use the threshold mode set during the training of the model. This value was set with M_THRESHOLD_MODE in a train AGM context. M_USER_DEFINED Specifies to use the threshold mode set with M_THRESHOLD_MODE. Find AGM context ID with a single-definition model Specifies a find AGM context, allocated using MagmAlloc() with M_GLOBAL_EDGE_BASED_FIND and used in MagmFind() operations. It must contain a single-definition model. M_ACCEPTANCE_COVERAGE Inquires the minimum coverage score required for an occurrence to be considered a match. UserVarPtr extra info Data type info: Data type: address of a MIL_DOUBLE Data type: address of a MIL_DOUBLE 0.0 &lt;= Value &lt;= 100.0 Specifies the minimum acceptable coverage score, as a percentage. M_ACCEPTANCE_DETECTION Inquires the minimum detection score required for an occurrence to be considered a match. UserVarPtr extra info Data type info: Data type: address of a MIL_DOUBLE Data type: address of a MIL_DOUBLE 0.0 &lt;= Value &lt;= 100.0 Specifies the minimum acceptable detection score, as a percentage. M_ACCEPTANCE_FIT Inquires the minimum fit score required for an occurrence to be considered a match. UserVarPtr extra info Data type info: Data type: address of a MIL_DOUBLE Data type: address of a MIL_DOUBLE 0.0 &lt;= Value &lt;= 100.0 Specifies the minimum acceptable fit score, as a percentage. M_BOX_MARGIN_BOTTOM Inquires the margin at the bottom of the bounding box of the model's active edges, if the model was defined from a CAD DXF file. This inquire type is only available for models of type M_DXF_FILE. UserVarPtr extra info Data type info: Data type: address of a MIL_DOUBLE Data type: address of a MIL_DOUBLE 0.0 &lt;= Value &lt;= 163840000.0 Specifies the margin, in model units. M_BOX_MARGIN_LEFT Inquires the margin at the left of the bounding box of the model's active edges, if the model was defined from a CAD DXF file. This inquire type is only available for models of type M_DXF_FILE. UserVarPtr extra info Data type info: Data type: address of a MIL_DOUBLE Data type: address of a MIL_DOUBLE 0.0 &lt;= Value &lt;= 163840000.0 Specifies the margin, in model units. M_BOX_MARGIN_RIGHT Inquires the margin at the right of the bounding box of the model's active edges, if the model was defined from a CAD DXF file. This inquire type is only available for models of type M_DXF_FILE. UserVarPtr extra info Data type info: Data type: address of a MIL_DOUBLE Data type: address of a MIL_DOUBLE 0.0 &lt;= Value &lt;= 163840000.0 Specifies the margin, in model units. M_BOX_MARGIN_TOP Inquires the margin at the top of the bounding box of the model's active edges, if the model was defined from a CAD DXF file. This inquire type is only available for models of type M_DXF_FILE. UserVarPtr extra info Data type info: Data type: address of a MIL_DOUBLE Data type: address of a MIL_DOUBLE 0.0 &lt;= Value &lt;= 163840000.0 Specifies the margin, in model units. M_BOX_OFFSET_X Inquires the X-offset of the top-left corner of the model box from the model origin, if the model was defined from a CAD DXF file. For M_DXF_FILE models, the origin is the same as the one defined in the CAD DXF file. The model box is defined by the bounding box of the model's active edges plus the specified margins. You can inquire the margins using M_BOX_MARGIN_.... M_BOX_OFFSET_X is updated when the margins that define the model box are changed. This inquire type is only available for models of type M_DXF_FILE. UserVarPtr extra info Data type info: Data type: address of a MIL_DOUBLE Data type: address of a MIL_DOUBLE Value Specifies the X-offset, in model units. M_BOX_OFFSET_Y Inquires the Y-offset of the top-left corner of the model box from the model origin, if the model was defined from a CAD DXF file. For M_DXF_FILE models, the origin is the same as the one defined in the CAD DXF file. The model box is defined by the bounding box of the model's active edges plus the specified margins. You can inquire the margins using M_BOX_MARGIN_.... M_BOX_OFFSET_Y is updated when the margins that define the model box are changed. This inquire type is only available for models of type M_DXF_FILE. UserVarPtr extra info Data type info: Data type: address of a MIL_DOUBLE Data type: address of a MIL_DOUBLE Value Specifies the Y-offset, in model units. M_BOX_SIZE_X Inquires the size along the X-axis of the model box, if the model was defined from a CAD DXF file. The model box is defined by the bounding box of the model's active edges plus the specified margins. You can inquire the margins using M_BOX_MARGIN_.... This inquire type is only available for models of type M_DXF_FILE. UserVarPtr extra info Data type info: Data type: address of a MIL_DOUBLE Data type: address of a MIL_DOUBLE Value Specifies the X-size, in model units. M_BOX_SIZE_Y Inquires the size along the Y-axis of the model box, if the model was defined from a CAD DXF file. The model box is defined by the bounding box of the model's active edges plus the specified margins. You can inquire the margins using M_BOX_MARGIN_.... This inquire type is only available for models of type M_DXF_FILE. UserVarPtr extra info Data type info: Data type: address of a MIL_DOUBLE Data type: address of a MIL_DOUBLE Value Specifies the Y-size, in model units. M_CAD_Y_AXIS Inquires the direction of the Y-axis for a model of type M_DXF_FILE. This inquire type is only available for models of type M_DXF_FILE. UserVarPtr extra info Data type info: Data type: address of a MIL_INT Data type: address of a MIL_INT M_FLIP Specifies to flip the Y-axis for the model so that the Y-axis is positive going down. M_NO_FLIP Specifies not to flip the Y-axis for the model. M_DETECTION_DELTA_NEG_ANGLE Inquires the lower limit of the detection angle range, relative to the nominal search angle (M_DETECTION_REF_ANGLE). That is, LowerLimit = M_DETECTION_REF_ANGLE - M_DETECTION_DELTA_NEG_ANGLE. UserVarPtr extra info Data type info: Data type: address of a MIL_DOUBLE Data type: address of a MIL_DOUBLE 0.0 &lt;= Value &lt;= 360.0 Specifies the lower limit of the detection angle range, in degrees. M_DETECTION_DELTA_POS_ANGLE Inquires the upper limit of the detection angle range, relative to the nominal search angle (M_DETECTION_REF_ANGLE). That is, UpperLimit = M_DETECTION_REF_ANGLE + M_DETECTION_DELTA_POS_ANGLE. UserVarPtr extra info Data type info: Data type: address of a MIL_DOUBLE Data type: address of a MIL_DOUBLE 0.0 &lt;= Value &lt;= 360.0 Specifies the upper limit of the detection angle range, in degrees. M_DETECTION_MULTI_ANGLE_MODE Inquires the mode with which to detect occurrences when searching at multiple angles. UserVarPtr extra info Data type info: Data type: address of a MIL_INT Data type: address of a MIL_INT M_GLOBAL Specifies to detect occurrences across all search angles globally. M_INDIVIDUAL Specifies to detect occurrences at each search angle individually. M_DETECTION_REF_ANGLE Inquires the nominal search angle; this is the angle at which you expect to find the model's reference axis in the target. UserVarPtr extra info Data type info: Data type: address of a MIL_DOUBLE Data type: address of a MIL_DOUBLE 0.0 &lt;= Value &lt; 360.0 Specifies the nominal search angle, in degrees. M_DETECTION_STEP_ANGLE Inquires the step angle at which to search for occurrences of the model. UserVarPtr extra info Data type info: Data type: address of a MIL_DOUBLE Data type: address of a MIL_DOUBLE 5.0 &lt;= Value &lt;= 180.0 Specifies the step angle, in degrees. M_EDGEL_ANGLE_MODE Inquires whether edgel orientation, defined by a gradient angle, is considered when searching for occurrences. UserVarPtr extra info Data type info: Data type: address of a MIL_INT Data type: address of a MIL_INT M_DISABLE Specifies not to consider edgel orientation. M_ORIENTATION Specifies to consider edgel orientation. M_EDGES_BOX_SIZE_X Inquires the size along the X-axis of the bounding box of the model's active edges, if the model was defined from a CAD DXF file. This inquire type is only available for models of type M_DXF_FILE. UserVarPtr extra info Data type info: Data type: address of a MIL_DOUBLE Data type: address of a MIL_DOUBLE Value Specifies the X-size, in model units. M_EDGES_BOX_SIZE_Y Inquires the size along the Y-axis of the bounding box of the model's active edges, if the model was defined from a CAD DXF file. This inquire type is only available for models of type M_DXF_FILE. UserVarPtr extra info Data type info: Data type: address of a MIL_DOUBLE Data type: address of a MIL_DOUBLE Value Specifies the Y-size, in model units. M_EMPTY_REGIONS_MODE Inquires whether the regions of the model that do not contain edges are considered when searching for model occurrences. UserVarPtr extra info Data type info: Data type: address of a MIL_INT Data type: address of a MIL_INT M_AUTO Specifies to automatically determine the empty regions. M_DISABLE Specifies not to consider empty regions. M_FIT_MODE Inquires the mode of the fit operation. UserVarPtr extra info Data type info: Data type: address of a MIL_INT Data type: address of a MIL_INT M_DISABLE Specifies to disable the fit operation; the positional results are determined by detection only. M_PIXEL_PRECISION Specifies to calculate the fit with pixel precision. M_SUBPIXEL_PRECISION Specifies to calculate the fit with subpixel precision. M_MAX_ACCEPTED_OVERLAP Inquires the maximum allowable overlap between found occurrences, as a percentage. UserVarPtr extra info Data type info: Data type: address of a MIL_DOUBLE Data type: address of a MIL_DOUBLE 0.0 &lt;= Value &lt;= 100.0 Specifies the acceptable overlap, as a percentage. M_MAX_ASSOCIATION_DISTANCE Inquires the maximum distance that a model edgel can be from the nearest occurrence edgel for that edgel to count towards the fit operation and increase the coverage score. UserVarPtr extra info Data type info: Data type: address of a MIL_DOUBLE Data type: address of a MIL_DOUBLE 1.0 &lt;= Value &lt;= 4.0 Specifies the maximum association distance, in pixels. M_MODEL_PRECISION Inquires the percentage of model edgels to use when searching for occurrences. UserVarPtr extra info Data type info: Data type: address of a MIL_DOUBLE Data type: address of a MIL_DOUBLE 0.0 &lt;= Value &lt;= 100.0 Specifies the amount of model edgels, as a percentage. M_PERSEVERANCE_DETECTION Inquires the algorithm's perseverance when searching for occurrences. UserVarPtr extra info Data type info: Data type: address of a MIL_DOUBLE Data type: address of a MIL_DOUBLE 0.0 &lt;= Value &lt;= 100.0 Specifies the perseverance, as a percentage. M_PIXEL_SCALE Inquires the pixel scale of the model, if the model was defined from a CAD DXF file. This inquire type is only available for models of type M_DXF_FILE. UserVarPtr extra info Data type info: Data type: address of a MIL_DOUBLE Data type: address of a MIL_DOUBLE 0.0 &lt; Value &lt; 10000.0 Specifies the pixel scale. M_REFERENCE_X Inquires the X-coordinate of the origin of the model's reference axis, relative to the model origin. UserVarPtr extra info Data type info: Data type: address of a MIL_DOUBLE Data type: address of a MIL_DOUBLE Value Specifies the X-coordinate, in pixels. M_REFERENCE_Y Inquires the Y-coordinate of the origin of the model's reference axis, relative to the model origin. UserVarPtr extra info Data type info: Data type: address of a MIL_DOUBLE Data type: address of a MIL_DOUBLE Value Specifies the Y-coordinate, in pixels. M_SMOOTHNESS Inquires the degree of smoothness (noise reduction) applied to the model image and target image(s) during the edge extraction. UserVarPtr extra info Data type info: Data type: address of a MIL_DOUBLE Data type: address of a MIL_DOUBLE 0.0 &lt;= Value &lt;= 100.0 Specifies the smoothness value applied to the images, as a percentage. M_SORT_CANDIDATES_SCORE Inquires the type of score used to sort candidates. UserVarPtr extra info Data type info: Data type: address of a MIL_INT Data type: address of a MIL_INT M_SCORE_COVERAGE Specifies to use the coverage score to sort candidates. M_SCORE_DETECTION Specifies to use the detection score to sort candidates. M_SCORE_FIT Specifies to use the fit score to sort candidates. M_STABLE_EDGELS_MODE Inquires whether only stable edges are used when searching for occurrences. This inquire type is only available for models of type M_IMAGE and M_IMAGE_REGION. UserVarPtr extra info Data type info: Data type: address of a MIL_INT Data type: address of a MIL_INT M_DISABLE Specifies not to use only stable edgels. M_SMOOTHNESS_STABLE Specifies to use only stable edgels. M_STEP_X Inquires the X step size of explored positions to search for occurrences. UserVarPtr extra info Data type info: Data type: address of a MIL_INT Data type: address of a MIL_INT Value &gt;= 1 Specifies the X step size. M_STEP_Y Inquires the Y step size of explored positions to search for occurrences. UserVarPtr extra info Data type info: Data type: address of a MIL_INT Data type: address of a MIL_INT Value &gt;= 1 Specifies the Y step size. M_THRESHOLD_MODE Inquires the threshold mode of the edge extraction. UserVarPtr extra info Data type info: Data type: address of a MIL_INT Data type: address of a MIL_INT M_DISABLE Specifies no threshold. M_HIGH Specifies a high threshold. M_LOW Specifies a low threshold. M_MEDIUM Specifies a medium threshold. M_VERY_HIGH Specifies a very high threshold. M_USE_MAGNITUDE_TARGET Inquires whether to use the gradient magnitude or to use extracted edges when searching for occurrences. UserVarPtr extra info Data type info: Data type: address of a MIL_INT Data type: address of a MIL_INT M_DISABLE Specifies to extract and use edges. M_ENABLE Specifies to use the magnitude of the gradient. Train AGM context ID with a composite-definition model Specifies a train AGM context, allocated using MagmAlloc() with M_GLOBAL_EDGE_BASED_TRAIN and used in MagmTrain() operations. It must contain a composite-definition model. M_EMPTY_REGIONS_MODE Inquires whether the regions of the model appearances that do not contain edges are considered when training the composite-definition model. UserVarPtr extra info Data type info: Data type: address of a MIL_INT Data type: address of a MIL_INT M_AUTO Specifies to automatically determine the empty regions. M_DISABLE Specifies not to consider empty regions. M_MODEL_PRECISION Inquires the percentage of the trained composite-definition model's edgels to use when searching for occurrences. UserVarPtr extra info Data type info: Data type: address of a MIL_DOUBLE Data type: address of a MIL_DOUBLE 0.0 &lt;= Value &lt;= 100.0 Specifies the amount of model edgels, as a percentage. M_NEGATIVE_LABELS_MAX_OVERLAP Inquires the maximum allowable overlap between two automatically generated negative (red) rectangles. UserVarPtr extra info Data type info: Data type: address of a MIL_DOUBLE Data type: address of a MIL_DOUBLE 0.0 &lt;= Value &lt; 90.0 Specifies the maximum allowable overlap, as a percentage. M_NEGATIVE_LABELS_MODE Inquires whether to automatically label negative model locations in the training images or to use manually defined labels. UserVarPtr extra info Data type info: Data type: address of a MIL_INT Data type: address of a MIL_INT M_AUTO Specifies to automatically label the negative model locations. M_USER_DEFINED Specifies to use manually defined negative (red) rectangles. M_NEGATIVE_LABELS_POSITIVE_MAX_OVERLAP Inquires the maximum allowable overlap between an automatically generated negative (red) rectangle and a positive (blue) rectangle. UserVarPtr extra info Data type info: Data type: address of a MIL_DOUBLE Data type: address of a MIL_DOUBLE 0.0 &lt;= Value &lt; 80.0 Specifies the maximum allowable overlap, as a percentage. M_REALIGN_STRENGTH Inquires the strength with which to displace the blue rectangles, which define the positive model locations in the training images, to better align them. UserVarPtr extra info Data type info: Data type: address of a MIL_DOUBLE Data type: address of a MIL_DOUBLE 0.0 &lt;= Value &lt;= 100.0 Specifies the strength of the realignment. M_SMOOTHNESS Inquires the degree of smoothness (noise reduction) applied to the training images during the edge extraction. UserVarPtr extra info Data type info: Data type: address of a MIL_DOUBLE Data type: address of a MIL_DOUBLE 0.0 &lt;= Value &lt;= 100.0 Specifies the smoothness value applied to the images, as a percentage. M_THRESHOLD_MODE Inquires the threshold mode of the edge extraction. UserVarPtr extra info Data type info: Data type: address of a MIL_INT Data type: address of a MIL_INT M_DISABLE Specifies no threshold. M_HIGH Specifies a high threshold. M_LOW Specifies a low threshold. M_MEDIUM Specifies a medium threshold. M_VERY_HIGH Specifies a very high threshold. M_TRAIN_LABELS_NOISE_MODE Inquires the mode with which to handle substandard labeled image regions when training the composite-definition model. UserVarPtr extra info Data type info: Data type: address of a MIL_INT Data type: address of a MIL_INT M_DISABLE Specifies not to handle substandard labeled image regions differently. M_LABELS_CONFIDENCE Specifies to be robust to substandard labels. M_USE_MAGNITUDE_TARGET Inquires whether to use the gradient magnitude or to use extracted edges when training the composite-definition model and searching for occurrences. UserVarPtr extra info Data type info: Data type: address of a MIL_INT Data type: address of a MIL_INT M_DISABLE Specifies to extract and use edges. M_ENABLE Specifies to use the magnitude of the gradient. To inquire information about a find or train AGM result buffer, the InquireType parameter can be set to one of the following values. In this case, you must set the Index parameter to M_GENERAL or M_DEFAULT. For inquiring about a find or train AGM result buffer ContextOrResultId Description InquireType UserVarPtr - Possible values returned AGM result buffer ID Specifies the identifier of a find or train AGM result buffer, allocated using MagmAllocResult(). M_MODIFICATION_COUNT Inquires the current value of the modification counter. The modification counter is increased by one each time that you call MagmFind() or MagmTrain(). Although you cannot identify the modification counter's contents, you can compare them throughout your application to know if the result buffer has been altered. UserVarPtr extra info Data type info: Data type: address of a MIL_INT Data type: address of a MIL_INT Value Specifies the current value of the modification counter. M_OWNER_SYSTEM Inquires the identifier of the system on which the AGM result buffer was allocated. UserVarPtr extra info Data type info: Data type: address of a MIL_ID Data type: address of a MIL_ID M_DEFAULT_HOST Specifies the default Host system of the current MIL application. MIL system identifier Specifies a valid system identifier, previously allocated using MsysAlloc(). Combination values for Tables: For inquiring about a find or train AGM context For inquiring about the type of model in a find or train AGM context For inquiring about a model in an AGM context For inquiring about a find or train AGM result buffer the values listed in all the parameter association tables. You can add one of the following values to the above-mentioned values to get information about the default value of an inquire type, regardless of the current value of the inquire type. For inquiring about the default value InquireType Description UserVarPtr - Possible values returned M_DEFAULT Inquires the default value of the specified inquire type. UserVarPtr extra info Data type info: Data type: defined elsewhere Data type: defined elsewhere M_IS_SET_TO_DEFAULT Inquires whether the specified inquire type is set to its default value. UserVarPtr extra info Data type info: Data type: address of a MIL_INT Data type: address of a MIL_INT M_FALSE Specifies that the inquire type is not set to its default value. M_TRUE Specifies that the inquire type is set to its default value. Combination values for Tables: For inquiring about a find or train AGM context For inquiring about the type of model in a find or train AGM context For inquiring about a model in an AGM context For inquiring about a find or train AGM result buffer the values listed in all the parameter association tables. You can add one of the following values to the above-mentioned values to determine whether an inquire type is supported. To inquire whether an inquire type is supported InquireType Description UserVarPtr - Possible values returned M_HAS_DEFAULT Inquires whether the specified inquire type has a default value. UserVarPtr extra info Data type info: Data type: address of a MIL_INT Data type: address of a MIL_INT M_FALSE Specifies that the inquire type does not have a default value. M_TRUE Specifies that the inquire type has a default value. M_SUPPORTED Inquires whether the specified inquire type is supported. UserVarPtr extra info Data type info: Data type: address of a MIL_INT Data type: address of a MIL_INT M_FALSE Specifies that the inquire type is not supported. M_TRUE Specifies that the inquire type is supported. Combination values for Tables: For inquiring about a find or train AGM context For inquiring about the type of model in a find or train AGM context For inquiring about a model in an AGM context For inquiring about a find or train AGM result buffer the values listed in all the parameter association tables. You can add one of the following values to the above-mentioned values to cast the requested information to a required data type. To specify the data type InquireType Description UserVarPtr - Possible values returned M_TYPE_MIL_DOUBLE Casts the requested information to a MIL_DOUBLE. UserVarPtr extra info Data type info: Data type: address of a MIL_DOUBLE MORE Data type: address of a MIL_DOUBLE Note: When a single inquire. M_TYPE_MIL_FLOAT Casts the requested information to a MIL_FLOAT. UserVarPtr extra info Data type info: Data type: address of a MIL_FLOAT MORE Data type: address of a MIL_FLOAT Note: When a single result. M_TYPE_MIL_ID Casts the requested information to a MIL_ID. Note that M_TYPE_MIL_ID should only be used with M_OWNER_SYSTEM. UserVarPtr extra info Data type info: Data type: address of a MIL_ID Data type: address of a MIL_ID M_TYPE_MIL_INT Casts the requested information to a MIL_INT. UserVarPtr extra info Data type info: Data type: address of a MIL_INT MORE Data type: address of a MIL_INT Note: When a single inquire. M_TYPE_MIL_INT32 Casts the requested information to a MIL_INT32. UserVarPtr extra info Data type info: Data type: address of a MIL_INT32 MORE Data type: address of a MIL_INT32 Note: When a single inquire. M_TYPE_MIL_INT64 Casts the requested information to a MIL_INT64. UserVarPtr extra info Data type info: Data type: address of a MIL_INT64 MORE Data type: address of a MIL_INT64 Note: When a single inquire. Return value The returned value is the requested information, cast to a MIL_INT64. If the requested information does not fit into a MIL_INT64, this function will return M_NULL or truncate the information. Compilation information Header Include mil.h. Library Use mil.lib; milagm.lib. DLL Requires mil.dll; milagm.dll. Syntax Description Parameters - ContextOrResultId - Index For specifying a context, model, or result buffer - InquireType - UserVarPtr Parameter Associations For inquiring about a find or train AGM context [AGM context ID] For inquiring about the type of model in a find or train AGM context [AGM context ID with a model] For inquiring about a model in an AGM context [Find AGM context ID with a composite-definition model] [Find AGM context ID with a single-definition model] [Train AGM context ID with a composite-definition model] For inquiring about a find or train AGM result buffer [AGM result buffer ID] + For inquiring about the default value + To inquire whether an inquire type is supported + To specify the data type Return value Compilation information ",
      "wordCount": 6156,
      "subEntries": []
    },
    {
      "id": "Reference_agm_MagmPreprocess",
      "version": null,
      "title": "MagmPreprocess",
      "subTitles": null,
      "location": "MIL Reference",
      "pageURL": "content\\Reference\\agm\\MagmPreprocess.htm",
      "text": " MagmPreprocess Synopsis Preprocess an AGM context. Syntax void MagmPreprocess( MIL_ID&nbsp;ContextAgmId, //in MIL_INT64&nbsp;ControlFlag //in ) Description This function preprocesses the specified AGM context. It sets internal settings so that future search or train operations will be optimized for speed and robustness. The procedure is potentially quite lengthy (up to a few seconds) and increases the size of the AGM context significantly. This function must be called before performing an MagmFind() or MagmTrain() operation. Call this function after all the required settings have been set; if some of the model's settings are changed after a call to MagmPreprocess(), the model must be preprocessed again. Note that you must preprocess the context after copying a composite-definition model to a find AGM context, even if no settings are changed. When you save the AGM context, the model's preprocessing changes are not stored with the model. Upon restoration, the model must be preprocessed again. Parameters Parameters ContextAgmId Specifies the AGM context to preprocess. The AGM context must have been previously allocated on the system using MagmAlloc() with M_GLOBAL_EDGE_BASED_FIND or M_GLOBAL_EDGE_BASED_TRAIN. ControlFlag Specifies whether to preprocess the AGM context or remove preprocessing information from the AGM context. Set this parameter to one of the following values: For specifying whether to perform preprocessing Value Description M_DEFAULT Performs the preprocessing of the AGM context. M_RESET Removes preprocessing information from the AGM context. Removing this information can be useful if you want to conserve computer memory within an application and preserve AGM context settings. Compilation information Header Include mil.h. Library Use mil.lib; milagm.lib. DLL Requires mil.dll; milagm.dll. Syntax Description Parameters - ContextAgmId - ControlFlag For specifying whether to perform preprocessing Compilation information ",
      "wordCount": 275,
      "subEntries": []
    },
    {
      "id": "Reference_agm_MagmRestore",
      "version": null,
      "title": "MagmRestore",
      "subTitles": null,
      "location": "MIL Reference",
      "pageURL": "content\\Reference\\agm\\MagmRestore.htm",
      "text": " MagmRestore Synopsis Restore an AGM context from disk. Syntax MIL_ID MagmRestore( MIL_CONST_TEXT_PTR&nbsp;FileName, //in MIL_ID&nbsp;SysId, //in MIL_INT64&nbsp;ControlFlag, //in MIL_ID&nbsp;*ContextAgmPtr //out ) Description This function restores an AGM context that was previously saved to a file, using MagmSave() or MagmStream(). This function restores all of the AGM context's settings that were in effect when the AGM context was saved. A restored AGM context is not preprocessed, therefore you must call MagmPreprocess() before calling MagmFind() or MagmTrain(). When the restored AGM context is no longer required, release it using MagmFree() unless M_UNIQUE_ID was specified during allocation; if M_UNIQUE_ID was specified, the smart identifier manages the restored AGM context's lifetime and you must not manually free it. Parameters Parameters FileName Specifies the name and path of the file from which to restore the AGM context. The function handles (internally) the opening and closing of the file. This parameter can be set to one of the following: For specifying the file name and path Value Description M_INTERACTIVE [This is only applicable to Windows] Opens the File Open dialog box from which you can interactively specify the drive, directory, and name of the file. MIL_TEXT(\"FileName\") 1 Specifies the drive, directory, and name of the file (for example, \"C:\\mydirectory\\myfile\"). Typically, AGM context files have an MAGM extension. To specify a file on a remote computer (under Distributed MIL), prefix the specified file name string with \"remote:///\" (for example, \"remote:///C:\\mydirectory\\myfile\"). 1 If you are passing the value in a variable, don't enclose it in MIL_TEXT(). SysId Specifies the system on which to restore the AGM context. This parameter should be set to one of the following values: For specifying the system identifier Value Description M_DEFAULT_HOST Specifies the default Host system of the current MIL application. MIL system identifier Specifies a valid system identifier, previously allocated using MsysAlloc(). ControlFlag Reserved for future expansion. This parameter must be set to M_DEFAULT. ContextAgmPtr Specifies the address of the variable in which to write the AGM context identifier or specifies the data type that the function should use to return the AGM context identifier. For retrieving the identifier or specifying how to return it Value Description M_NULL Specifies that you will use this function's return value to obtain the identifier of the allocated AGM context ; in this case, a standard MIL identifier of type MIL_ID is returned. M_UNIQUE_ID Specifies that you will use this function's return value to obtain the identifier of the allocated AGM context ; in this case, a MIL smart identifier of type MIL_UNIQUE_AGM_ID is returned instead of a standard MIL identifier. This setting is only available when using C++11 (or later). A MIL smart identifier manages the lifespan of the MIL object it owns (similar to a std::unique_ptr). Note, you can use a MIL smart identifier as though it were a standard MIL identifier, except that you cannot use it to manually free the AGM context (it is freed automatically). For more information, see the MIL smart identifiers subsection of the MIL custom data types, void pointers, extensions, and portability functions section of Chapter 2: Building an application. Address in which to write the find AGM context identifier Specifies the address of a MIL_ID in which to write the identifier of the restored find AGM context. If restoration fails, M_NULL is written as the identifier. Address in which to write the train AGM context identifier Specifies the address of a MIL_ID in which to write the identifier of the restored train AGM context. If restoration fails, M_NULL is written as the identifier. Return value The returned value is the AGM context identifier either as a standard identifier (MIL_ID) or a smart identifier (MIL_UNIQUE_AGM_ID). If allocation fails, M_NULL is returned (or nullptr if M_UNIQUE_ID was specified). Compilation information Header Include mil.h. Library Use mil.lib; milagm.lib. DLL Requires mil.dll; milagm.dll. Syntax Description Parameters - FileName For specifying the file name and path - SysId For specifying the system identifier - ControlFlag - ContextAgmPtr For retrieving the identifier or specifying how to return it Return value Compilation information ",
      "wordCount": 670,
      "subEntries": []
    },
    {
      "id": "Reference_agm_MagmSave",
      "version": null,
      "title": "MagmSave",
      "subTitles": null,
      "location": "MIL Reference",
      "pageURL": "content\\Reference\\agm\\MagmSave.htm",
      "text": " MagmSave Synopsis Save an AGM context to a file. Syntax void MagmSave( MIL_CONST_TEXT_PTR&nbsp;FileName, //in MIL_ID&nbsp;ContextId, //in MIL_INT64&nbsp;ControlFlag //in ) Description This function saves all the information about the previously allocated AGM context to disk, including the model's current settings. This information can be reloaded, using MagmRestore() or MagmStream(). However, preprocessing changes are not saved. Parameters Parameters FileName Specifies the name and path of the file in which to save the AGM context; it is recommended that you use the MAGM file extension for easier use with other Matrox Imaging software products. The function internally handles the opening and closing of this file. If this file already exists, it will be overwritten. This parameter can be set to one of the following values: For specifying the file name and path Value Description M_INTERACTIVE [This is only applicable to Windows] Opens the File Save As dialog box from which you can interactively specify the drive, directory, and name of the file. MIL_TEXT(\"FileName\") 1 Specifies the drive, directory, and name of the file (for example, \"C:\\mydirectory\\myfile\"). Typically, AGM context files have an MAGM extension. To specify a file on a remote computer (under Distributed MIL), prefix the specified file name string with \"remote:///\" (for example, \"remote:///C:\\mydirectory\\myfile\"). 1 If you are passing the value in a variable, don't enclose it in MIL_TEXT(). ContextId Specifies the identifier of the AGM context to save. ControlFlag Reserved for future expansion. This parameter must be set to M_DEFAULT. Compilation information Header Include mil.h. Library Use mil.lib; milagm.lib. DLL Requires mil.dll; milagm.dll. Syntax Description Parameters - FileName For specifying the file name and path - ContextId - ControlFlag Compilation information ",
      "wordCount": 273,
      "subEntries": []
    },
    {
      "id": "Reference_agm_MagmStream",
      "version": null,
      "title": "MagmStream",
      "subTitles": null,
      "location": "MIL Reference",
      "pageURL": "content\\Reference\\agm\\MagmStream.htm",
      "text": " MagmStream Synopsis Load, restore, or save an AGM context from/to a file or a memory stream. Syntax void MagmStream( MIL_TEXT_PTR&nbsp;MemPtrOrFileName, //in-out MIL_ID&nbsp;SysId, //in MIL_INT64&nbsp;Operation, //in MIL_INT64&nbsp;StreamType, //in MIL_DOUBLE&nbsp;Version, //in MIL_INT64&nbsp;ControlFlag, //in MIL_ID&nbsp;*ContextAgmIdPtr, //in-out MIL_INT&nbsp;*SizeByteVarPtr //out ) Description This function can load, restore, or save an AGM context from/to a file or memory stream. To inquire the number of bytes necessary to save an AGM context to memory stream, you should first call this function (MagmStream()) with M_INQUIRE_SIZE_BYTE. The content saved to memory stream is equivalent to the content saved to file. This function is equivalent to a file saved using MagmSave(). You can use this and other MIL stream functions, for example, to save all required MIL objects, as well as any other custom data, for your application to a memory stream. Once in a memory stream, you can write the stream to a single file or transfer it over a network. You are responsible for concatenating the streams and for saving the stream to file. All information about the previously allocated AGM context is saved, including the individual models current settings. However, preprocessing changes are not saved. All of the AGM context settings that were in effect when the AGM context was saved will be restored. A loaded or restored AGM context is not preprocessed; therefore, you must call MagmPreprocess() before calling MagmFind() or MagmTrain(). Parameters Parameters MemPtrOrFileName Accepts the address of one of the following (see the Parameter associations section for specifics on which is expected): MIL_TEXT_PTR [optionally, in C++: a reference to a MIL_STRING] Optionally, in C++: a reference to a std::vector of type MIL_UINT8 Specifies the file or memory stream. See the Parameter associations section for possible values that can be returned/specified. SysId Specifies the system on which to restore the AGM context. See the Parameter associations section for possible values that can be specified. Operation Specifies the operation to perform on the AGM context. See the Parameter associations section for possible values that can be specified. StreamType Specifies the type of stream in which to store/from which to restore the AGM context. For specifying the type of stream Value Description M_FILE Specifies a file stream. M_MEMORY Specifies a memory stream. You are responsible for allocating a block of memory for the stream. Version Specifies the MIL version of the AGM context. See the Parameter associations section for possible values that can be specified. ControlFlag Reserved for future expansion and must be set to M_DEFAULT. ContextAgmIdPtr Specifies the address of the variable in which to write or from which to read the identifier of the AGM context. See the Parameter associations section for possible values that can be returned/specified. SizeByteVarPtr Specifies the address of the variable in which to write the size of the AGM context, in bytes. If the size is not required, you can set this parameter to M_NULL. Note that the size of an AGM context will vary depending on the MIL version specified. Parameter associations The table below lists possible values for the MemPtrOrFileName, SysId, Operation, Version, and ContextAgmIdPtr parameters. For performing the stream operation. For performing the stream operation. Operation Description MemPtrOrFileName - Possible values passed or returned SysId Version ContextAgmIdPtr - Possible values passed or returned M_INQUIRE_SIZE_BYTE Inquires the number of bytes required to save an AGM context to memory stream. This operation is not supported when the StreamType parameter is set to M_FILE. MemPtrOrFileName This parameter must be set to M_NULL. SysId This parameter must be set to M_NULL. Version Specifies the MIL version with which the AGM context must be compatible when saved. The size of an AGM context might differ from one MIL version to another. M_DEFAULT Specifies the current version of MIL. M_PROC_VERSION_100_SP6 Specifies the version as being MIL 10.0 Service Pack 6. M_PROC_VERSION_100_SP7 Specifies the version as being MIL 10.0 Service Pack 7. ContextAgmIdPtr Specifies the address of the variable containing the identifier of the AGM context. M_LOAD Loads the content of a specified file or memory stream into a previously allocated AGM context. MemPtrOrFileName Specifies the file or memory stream from which to load the context. M_INTERACTIVE [This is only applicable to Windows] Opens a dialog box from which you can interactively specify the drive, directory, and name of the file, when the StreamType parameter is set to M_FILE. MIL_TEXT(\"FileName\") 1 Specifies the drive, directory, and name of the file (for example, \"C:\\mydirectory\\myfile\"), when the StreamType parameter is set to M_FILE. AGM contexts typically have an MAGM file extension. The function handles (internally) the opening and closing of the file. To specify a file on a remote computer (under Distributed MIL), prefix the specified file name string with \"remote:///\" (for example, \"remote:///C:\\mydirectory\\myfile\"). MemPtr Specifies the address of the block of memory, when the StreamType parameter is set to M_MEMORY. The block of memory should be of type MIL_UINT8. The specified address must correspond to the first memory address in which the object is located, and the block of memory must contain the entire object. Note that when using a C compiler (not a C++ or other compiler), you must cast the MIL_UINT8 pointer to a MIL_TEXT_PTR. SysId This parameter must be set to M_NULL. Version This parameter must be set to M_DEFAULT. ContextAgmIdPtr Specifies the address of the variable containing the identifier of the AGM context. All previous settings are overwritten with those of the loaded context, or are set to the default value if the settings didn't exist in the version of MIL from which the context is being loaded. M_RESTORE Restores an AGM context from a file or memory stream and assigns it a MIL identifier. MemPtrOrFileName Specifies the file or memory stream from which to restore the context. M_INTERACTIVE [This is only applicable to Windows] Opens a dialog box from which you can interactively specify the drive, directory, and name of the file, when the StreamType parameter is set to M_FILE. MIL_TEXT(\"FileName\") 1 Specifies the drive, directory, and name of the file (for example, \"C:\\mydirectory\\myfile\"), when the StreamType parameter is set to M_FILE. AGM contexts typically have an MAGM file extension. The function handles (internally) the opening and closing of the file. To specify a file on a remote computer (under Distributed MIL), prefix the specified file name string with \"remote:///\" (for example, \"remote:///C:\\mydirectory\\myfile\"). MemPtr Specifies the address of the block of memory, when the StreamType parameter is set to M_MEMORY. The block of memory should be of type MIL_UINT8. The specified address must correspond to the first memory address in which the object is located, and the block of memory must contain the entire object. Note that when using a C compiler (not a C++ or other compiler), you must cast the MIL_UINT8 pointer to a MIL_TEXT_PTR. SysId Specifies the system on which to allocate the AGM context. M_DEFAULT_HOST Specifies the default Host system of the current MIL application. MIL system identifier Specifies a valid system identifier, previously allocated using MsysAlloc(). Version This parameter must be set to M_DEFAULT. ContextAgmIdPtr Specifies the address of the variable in which to write the identifier of the AGM context. If the operation is not successful, M_NULL is returned. M_SAVE Saves an AGM context to a specified file or memory stream. MemPtrOrFileName Specifies the file or memory stream. M_INTERACTIVE [This is only applicable to Windows] Opens a dialog box from which you can interactively specify the drive, directory, and name of the file, when the StreamType parameter is set to M_FILE. MIL_TEXT(\"FileName\") 1 Specifies the drive, directory, and name of the file (for example, \"C:\\mydirectory\\myfile\"), when the StreamType parameter is set to M_FILE. For easier use with other Matrox Imaging software products, when saving an AGM context to a file, use the MAGM file extension. The function handles (internally) the opening and closing of the file. If the file already exists, it will be overwritten. To specify a file on a remote computer (under Distributed MIL), prefix the specified file name string with \"remote:///\" (for example, \"remote:///C:\\mydirectory\\myfile\"). MemPtr Specifies the address of the block of memory, when the StreamType parameter is set to M_MEMORY. The block of memory should be of type MIL_UINT8. The specified address must correspond to the first memory address in which to write, and the block of memory must be large enough to stream the entire object. To determine the required size, call this function with M_INQUIRE_SIZE_BYTE. Note that when using a C compiler (not a C++ or other compiler), you must cast the MIL_UINT8 pointer to a MIL_TEXT_PTR. SysId This parameter must be set to M_NULL. Version Specifies the MIL version with which the AGM context must be compatible when saved. M_DEFAULT Specifies the current version of MIL. M_PROC_VERSION_100_SP6 Specifies the version as being MIL 10.0 Service Pack 6. M_PROC_VERSION_100_SP7 Specifies the version as being MIL 10.0 Service Pack 7. ContextAgmIdPtr Specifies the address of the variable containing the identifier of the AGM context to save. 1 If you are passing the value in a variable, don't enclose it in MIL_TEXT(). Compilation information Header Include mil.h. Library Use mil.lib; milagm.lib. DLL Requires mil.dll; milagm.dll. Syntax Description Parameters - MemPtrOrFileName - SysId - Operation - StreamType For specifying the type of stream - Version - ControlFlag - ContextAgmIdPtr - SizeByteVarPtr Parameter Associations For performing the stream operation. Compilation information ",
      "wordCount": 1541,
      "subEntries": []
    },
    {
      "id": "Reference_agm_MagmTrain",
      "version": null,
      "title": "MagmTrain",
      "subTitles": null,
      "location": "MIL Reference",
      "pageURL": "content\\Reference\\agm\\MagmTrain.htm",
      "text": " MagmTrain Synopsis Train a composite-definition model that is in a train AGM context. Syntax void MagmTrain( MIL_ID&nbsp;TrainContextId, //in const MIL_ID&nbsp;*ImageArrayPtr, //in MIL_INT&nbsp;NumImages, //in MIL_ID&nbsp;TrainResultId, //in MIL_INT64&nbsp;ControlFlag //in ) Description This function trains a composite-definition model that is in a train AGM context and stores the result in a train AGM result buffer. The trained composite-definition model is constructed from training images with regions labeled as positive or negative. During training, the model learns what is a favorable feature of an occurrence and what is not. Retrieve results about the training operation using MagmGetResult(). Note, the train AGM context must be preprocessed (using MagmPreprocess()) before calling this function. Once trained, you copy the resulting trained composite-definition model to a find AGM context using MagmCopyResult(). The training process involves using model appearances and background samples to construct a model that is good at finding your model, especially in cluttered target images. These areas must be labeled in the training images using regions of interest (ROIs) containing blue/red rectangles. Blue rectangles define positive model locations, while red rectangles define negative model locations. Negative model locations include clutter in the background and areas in an image that resemble your model but aren't. You should use blue rectangles to specify appearances of the model that you want to find. MagmTrain() can only train one model; therefore, each blue rectangle must identify an occurrence of the same model. Note that model appearances don't need to be in the same location in the MagmFind() target images. If you enabled the automatic labeling of negative model locations (MagmControl() with M_NEGATIVE_LABELS_MODE set to M_AUTO), you must only label the positive model appearances; MagmTrain() will automatically identify and label the background areas of your training images. In this case, a minimum of one training image must have a blue ROI associated with it. The ROI can be composed of several non-contiguous and/or overlapping areas, but it must contain at least one blue rectangle and cannot contain any red rectangles. Note that there can be training images with no ROI (no rectangles). If you did not enable the automatic labeling of negative model locations, you must manually label both the model appearances and background samples before calling MagmTrain(). In this case, the set of training images must contain red and blue rectangles, associated to the images using ROIs. You should use red rectangles to specify clutter in the background. If there is an area in an image that resembles your model but isn't, you can use red rectangles to prevent MagmFind() from returning that area as a possible occurrence. A minimum of one training image must have an ROI associated with it. The ROI can be composed of several non-contiguous and/or overlapping areas, but it must contain at least one red rectangle and/or one blue rectangle. Considering all the rectangles across all training images, there must be a minimum of one red rectangle and one blue rectangle. Note that there can be training images with only red rectangles, only blue rectangles, or no rectangles. The training images with no rectangles are not used during training. Note that all rectangles must be the same size. You can use the AgmLabelingTool example, accessible from the Matrox Example Launcher, to define images with appropriate regions of interest. agmlabelingtool.cpp Use MagmControl() to configure individual model settings before calling this function. For example, you can set M_EMPTY_REGIONS_MODE to M_AUTO to take into consideration, when training the model, the regions of the model appearances that do not contain edges. You must call this function before calling MagmCopyResult(). You cannot copy the model to a find AGM context unless it is successfully trained. To check the training status of the model, use MagmGetResult() with M_STATUS. Parameters Parameters TrainContextId Specifies the identifier of the train AGM context with which to train the composite-definition model. The train AGM context must have been previously allocated on the required system using MagmAlloc() with M_GLOBAL_EDGE_BASED_TRAIN. It must also contain a composite-definition model, added using MagmDefine() with M_COMPOSITE. ImageArrayPtr Accepts the address of one of the following: array of type MIL_ID [optionally, in C++: a reference to a constant std::vector&lt;MIL_ID&gt; ] (and a maximum array rank for C# of 1) Required array size:(NumImages) MIL_ID Specifies either the address of the array containing the buffer identifiers of the training images or specifies the address of the variable containing the identifier of the image buffer container. The image buffers must be 1-band, 8-bit unsigned buffers. The minimum and maximum training image sizes are 6x6 and 32768x32768 pixels, respectively. A minimum of one image buffer must have a region of interest (ROI) with at least one blue rectangle, defined using MbufSetRegion(); blue rectangles should indicate positive model locations. In addition, if M_NEGATIVE_LABELS_MODE is set to M_USER_DEFINED, at least one image buffer must have an ROI containing a red rectangle; red rectangles should indicate negative model locations. The minimum and maximum rectangle sizes are 6x6 and 32768x32768 pixels, respectively. Note that all rectangles must be the same size. The region must be defined in vector format from a 2D graphics list (M_VECTOR or M_VECTOR_AND_RASTER). An error will be generated if the ROI is only in raster format (M_RASTER). NumImages Specifies the size of the specified image buffer array. When an image buffer container is specified, you must set NumImages to 1. When using a standard vector (std::vector) overload function in C++, you can pass M_DEFAULT to this parameter and MIL will automatically determine the size based on the number of items in the vector passed to the ImageArrayPtr parameter. For specifying the number of training images Value Description Value &gt;= 1 Specifies the size of the array passed to ImageArrayPtr. TrainResultId Specifies the train AGM result buffer identifier. The result buffer must have been allocated using MagmAllocResult() with M_GLOBAL_EDGE_BASED_TRAIN_RESULT. ControlFlag Reserved for future expansion. This parameter must be set to M_DEFAULT. Compilation information Header Include mil.h. Library Use mil.lib; milagm.lib. DLL Requires mil.dll; milagm.dll. Syntax Description Parameters - TrainContextId - ImageArrayPtr - NumImages For specifying the number of training images - TrainResultId - ControlFlag Compilation information ",
      "wordCount": 1010,
      "subEntries": []
    }
  ]
}]