[{
  "id": "UG_advanced-geometric-matcher",
  "version": "2024020714",
  "title": "Advanced Geometric Matcher",
  "subTitles": null,
  "location": "MIL UG P03: 2D processing and analysis",
  "pageURL": "content\\UserGuide\\advanced-geometric-matcher\\ChapterInformation.htm",
  "text": " Chapter 9: Advanced Geometric Matcher This chapter explains how to use the Advanced Geometric Matcher (AGM) module to train a model and locate occurrences in your target. Advanced Geometric Matcher module Steps to finding model occurrences and training a model Finding steps Training steps Basic concepts for the MIL Advanced Geometric Matcher module Defining and adding a model to your AGM context Single-definition models Defining a single-definition model from a CAD DXF file Defining a single-definition model from an Edge Finder result buffer Defining a single-definition model from an image Composite-definition models Preprocessing Model origin Finding model occurrences Finding model occurrences in an image Finding model occurrences in an Edge Finder result buffer Determining what is a match Detection score Fit and coverage scores Maximum association distance Interpreting results Search settings Model source Detection angle Edgel angle Empty regions Retrieving and analyzing search results Possible results Drawing results Improving results Training a model Labeling training images Labeling your training images using the AGM labeling tool Labeling your training images using the Graphics and Buffer modules Training settings Smoothness Threshold Training status When a composite-definition model is not successfully trained Using a trained composite-definition model Advanced Geometric Matcher examples ",
  "wordCount": 200,
  "subEntries": [
    {
      "id": "UG_advanced-geometric-matcher_Advanced_Geometric_Matcher_module",
      "version": null,
      "title": "Advanced Geometric Matcher module",
      "subTitles": null,
      "location": "MIL UG P03: 2D processing and analysis",
      "pageURL": "content\\UserGuide\\advanced-geometric-matcher\\Advanced_Geometric_Matcher_module.htm",
      "text": " Advanced Geometric Matcher module The Advanced Geometric Matcher module (AGM) allows you to find models based on edges. Specifically, the module finds model occurrences in the target by determining edge-related scores for each candidate, such as coverage, detection, and fit. This can result in the AGM module offering a more stable execution time than the Model Finder module when dealing with multiple targets of the same size. Note that with AGM, successively searching in targets of different sizes will slow the execution time. AGM can prove particularly useful when there are variations in the occurrences and/or you need to search for model occurrences on a cluttered background. AGM allows you to search for model occurrences using either a single-definition model or a composite-definition model. A single-definition model is defined from a single appearance of the model to find, using an entire image, a non-rotated region of an image, an Edge Finder result buffer, or a CAD DXF file, while a composite-definition model is trained, using labeled images, to construct the best possible model. In the case of a cluttered background, searching using a model defined from a single appearance might result in false occurrences being found due to background distraction. Unlike Model Finder, the AGM module allows you to train a model using multiple training images within which regions are identified as positive (true model occurrences) or negative (clearly non-model regions or potential false positives). This can result in a trained model that can better discriminate true occurrences from false occurrences in cluttered targets. When your target contains a lot of occurrences, it is typically faster to search using a single-definition model, compared to using a composite-definition model (or the Model Finder module). Note that although there can be variations in the occurrences, they must be at approximately the same scale as the model. The module does not provide support for camera calibration. If the training or target images are associated with a camera calibration context, or if the Edge Finder result buffer is associated with a camera calibration context and M_RESULT_OUTPUT_UNITS is not set to M_PIXEL, a MIL error will be generated. The module also allows you to restore an AGM context from a file or memory stream, or save an AGM context to a file or memory stream. Advanced Geometric Matcher module ",
      "wordCount": 386,
      "subEntries": []
    },
    {
      "id": "UG_advanced-geometric-matcher_Steps_to_train_a_model_and_find_occurrences",
      "version": null,
      "title": "Steps to finding model occurrences and training a model",
      "subTitles": [
        "Finding steps",
        "Training steps"
      ],
      "location": "MIL UG P03: 2D processing and analysis",
      "pageURL": "content\\UserGuide\\advanced-geometric-matcher\\Steps_to_train_a_model_and_find_occurrences.htm",
      "text": " Steps to finding model occurrences and training a model To use the AGM module, you can start by following the finding steps to search for a single-definition model. If you are not satisfied with the results, you can follow the training steps to train a composite-definition model, and then return to the finding steps to search for the trained model. Note that you can repeat the training phase until you obtain satisfactory results. Finding steps The following steps provide a basic methodology for using the MIL Advanced Geometric Matcher module to find model occurrences: Allocate a find AGM context, using MagmAlloc() with M_GLOBAL_EDGE_BASED_FIND. Allocate a find AGM result buffer to hold the results of the find operation, using MagmAllocResult() with M_GLOBAL_EDGE_BASED_FIND_RESULT. Define and add a single-definition model to the find AGM context, using MagmDefine() with M_SINGLE. Alternatively, you can copy a trained composite-definition model to the find AGM context, using MagmCopyResult() with M_TRAINED_MODEL, if you have performed the training steps in the list below. Specify your required search settings, using MagmControl(). Preprocess your find AGM context, using MagmPreprocess(). Search the target for model occurrences, using MagmFind(). Note that calling MagmFind() successively with targets of different sizes will slow the execution time. If necessary, use MagmDraw() to draw extracted features from the context or result buffer. For example, you can draw edges of the model or of a found occurrence. Retrieve the required results from the find AGM result buffer, using MagmGetResult(). If your results have false positives, you can try re-calling MagmFind() after modifying search settings, such as M_ACCEPTANCE_DETECTION, M_ACCEPTANCE_FIT, and M_ACCEPTANCE_COVERAGE. If false occurrences are still found, you can repeat these steps with a trained composite-definition model, obtained from following the training steps in the subsection below. If necessary, save your AGM contexts, using MagmSave() or MagmStream(). Once you save an AGM context, you can later restore it, using MagmRestore() or MagmStream(). Restoring an AGM context instead of creating it again can be more efficient, especially if the restored context requires no further modifications. You can save or restore an AGM context to/from a file or memory stream. Free all your allocated objects, using MagmFree(), unless M_UNIQUE_ID was specified during allocation. If results of the MagmFind() operation are unsatisfactory (for example, MIL finds false positives), you can improve results by using the faulty occurrences to train a composite-definition model. Once you have trained a model, you must copy it into a find AGM context and again call MagmFind(). Training steps The following steps provide a basic methodology for using the MIL Advanced Geometric Matcher module to train a model: Prepare the images to use to train the model. Associate the images with ROIs that identify model appearances and background samples. An ROI can be composed of several non-contiguous and/or overlapping areas, but it must contain at least one red rectangle and/or one blue rectangle. Considering all the rectangles across all training images, there must be a minimum of one red rectangle and one blue rectangle. Note that there can be training images with only red rectangles, only blue rectangles, or no rectangles. Blue rectangles define positive model locations, while red rectangles define negative model locations. Each blue rectangle must identify an occurrence of the same model. All rectangles must be the same size. If you want the negative model locations to be automatically labeled, you must not add any red rectangles to your training images, and you must set MagmControl() with M_NEGATIVE_LABELS_MODE to M_AUTO. Allocate a train AGM context, using MagmAlloc() with M_GLOBAL_EDGE_BASED_TRAIN. Allocate a train AGM result buffer to hold the trained composite-definition model, using MagmAllocResult() with M_GLOBAL_EDGE_BASED_TRAIN_RESULT. Define and add a composite-definition model to the train AGM context, using MagmDefine() with M_COMPOSITE. Specify training settings, such as M_EMPTY_REGIONS_MODE and M_SMOOTHNESS, using MagmControl(). Preprocess your train AGM context, using MagmPreprocess(). Train the composite-definition model, using MagmTrain() with the training images set up in the first step. Verify the status of the training operation and trained composite-definition model, using MagmGetResult() with M_STATUS. If the model is not completely trained, you can use MagmControl() to adjust the model settings and/or you can modify the blue and red rectangles in your training images; then, re-call MagmTrain(). Find model occurrences, using the finding steps in the subsection above. Note that after allocating a find AGM context, you must copy the trained composite-definition model to it, using MagmCopyResult() with M_TRAINED_MODEL. If the search results include false positives, you can mark them as background samples in the training images, using red rectangles, and then retrain your composite-definition model. Steps to finding model occurrences and training a model Finding steps Training steps ",
      "wordCount": 769,
      "subEntries": []
    },
    {
      "id": "UG_advanced-geometric-matcher_Basic_concepts",
      "version": null,
      "title": "Basic concepts for the MIL Advanced Geometric Matcher module",
      "subTitles": null,
      "location": "MIL UG P03: 2D processing and analysis",
      "pageURL": "content\\UserGuide\\advanced-geometric-matcher\\Basic_concepts.htm",
      "text": " Basic concepts for the MIL Advanced Geometric Matcher module The basic concepts and vocabulary conventions for the MIL Advanced Geometric Matcher module are: Composite-definition model. A model that can hold information about valid model appearances and background samples. This type of model requires training before it can be used to search for occurrences. Coverage score. The percentage of the total length of the model's edges that are found in an occurrence. Detection score. The likelihood that a found occurrence is a true occurrence. Edge. A curve that delineates a boundary, which can be established from intensity transitions in an image. Edgel. Elementary point (or edge element) within an edge. Fit score. A measure of the correlation between model edgels and occurrence edgels. Model. The information that defines the pattern of edges to find in the target. Model occurrence. An instance of the model found in the target. Model image. The model, when drawn, is a model image. For a single-definition model defined from an image, the model image is the entire source image or a copy of the region in the source image from which the model has been defined. For a single-definition model defined from an Edge Finder result buffer, the model image is the image source of the result buffer from which the model has been defined. For a single-definition model defined from a CAD DXF file, the model image is the image representation (edge map) of the model. For a composite-definition model, the model image is the entire source image; if a separate image has not been provided for the fit and coverage calculations, no model image exists. Model origin. The point in the model's coordinate system that is considered to be (0, 0). Model source. The immediate source of the model's edges. For a single-definition model, the model source is a single user-provided image, the buffer of the Edge Finder results, or a CAD DXF file. For a composite-definition model, the model source for detection is the train AGM result buffer; the model source for the fit and coverage can be the train AGM result buffer or a single user-provided image. Negative model location. An area in a training image where a model is not found. Negative model locations are background elements and are delimited by red rectangles. Positive model location. An area in a training image where a model is found. Positive model locations are model appearances and are delimited by blue rectangles. Single-definition model. A model built from a single model appearance. This type of model can be used to search for occurrences without prior training. Target. The image or Edge Finder result buffer in which to search for model occurrences. Trained composite-definition model. A composite-definition model that has been successfully trained with model appearances and background samples, allowing you to use it to search for occurrences. Training image. An image that contains appearances of the model and/or background. Basic concepts for the MIL Advanced Geometric Matcher module ",
      "wordCount": 496,
      "subEntries": []
    },
    {
      "id": "UG_advanced-geometric-matcher_Defining_and_adding_a_model_to_your_AGM_context",
      "version": null,
      "title": "Defining and adding a model to your AGM context",
      "subTitles": [
        "Single-definition models",
        "Defining a single-definition model from a CAD DXF file",
        "Defining a single-definition model from an Edge Finder result buffer",
        "Defining a single-definition model from an image",
        "Composite-definition models",
        "Preprocessing",
        "Model origin"
      ],
      "location": "MIL UG P03: 2D processing and analysis",
      "pageURL": "content\\UserGuide\\advanced-geometric-matcher\\Defining_and_adding_a_model_to_your_AGM_context.htm",
      "text": " Defining and adding a model to your AGM context After allocating an AGM context using MagmAlloc(), you can add a model to it using MagmDefine(). Since AGM does not support searching for occurrences with a different scale than the model, you should ensure your model has a similar scale as your expected occurrences. There are two types of models in the AGM module, single-definition (M_SINGLE) and composite-definition (M_COMPOSITE). A single-definition model is defined from a single appearance of the model to find. A composite-definition model is defined from multiple model appearances and background areas. A single-definition model does not require training, while a composite-definition model is trained using images within which regions are identified as positive (true model occurrences) or negative (clearly non-model regions or potential false positives). Both types of models support finding occurrences with slight variations and finding occurrences on a cluttered background. Single-definition models A single-definition model is defined from a single appearance of the model to find. An MagmFind() operation performed with a single-definition model is typically faster than with a composite-definition model. Using a single-definition model is also simpler than using a composite-definition model since it does not need training. You should start with a single-definition model and use a composite-definition model only if you find false occurrences. You can define a single-definition model from a CAD DXF file, an Edge Finder result buffer, or a single source image. In the latter case, the entire image is used as the model or the model is extracted from a non-rotated region. Defining a single-definition model from a CAD DXF file You can add a single-definition model that is defined from a CAD DXF file to a find AGM context, using MagmDefine() with M_DXF_FILE. Not every entity in a CAD DXF file is supported; unsupported entities are ignored. The supported entities are LINE, ARC, CIRCLE, ELLIPSE, INSERT, POLYLINE, and LWPOLYLINE (including bulge information). For INSERT entities, only single insertions are supported; multiple insertions using the MINSERT command are not supported. Extrusion is also not supported. When the model is added to the find AGM context from a CAD DXF file, the model will retain its coordinate system (the origin and the axis). Most CAD DXF files are oriented so that the Y-axis is positive going up, whereas the coordinate system MIL uses is oriented so that the Y-axis is positive going down. So if you take the edge coordinates of an object from a CAD DXF file and put them in an image, the imaged object will look flipped when compared to the original object. This is also the case for a model defined from a CAD DXF file. This means that, unless the object is symmetrical, the match will not be made. You can use MagmControl() with M_CAD_Y_AXIS to flip the Y-axis for the model so that it is positive going down. Defining a single-definition model from an Edge Finder result buffer You can define a single-definition model from the results of an edge extraction performed using Edge Finder. The included edges of the results are the ones that will be used to define the model. Some things have to be done before you can define a model from an Edge Finder result buffer. The Edge Finder result buffer must have been previously allocated using MedgeAllocResult(). The Edge Finder result buffer must be compatible with the AGM context. Enable this using MedgeControl() with M_AGM_COMPATIBLE prior to calling MedgeCalculate(). M_EXTRACTION_SCALE in MedgeControl() must be set to 1 (default); otherwise, you will get a MIL error. MedgeCalculate() must have been already called using this result buffer. See the Interfacing with Geometric Model Finder or Advanced Geometric Matcher section of Chapter 10: Edge Finder for more information. You can add a single-definition model that is defined from an Edge Finder result buffer to a find AGM context, using MagmDefine() with M_EDGE_RESULT. Defining a single-definition model from an image You can add a single-definition model that is defined from an image to a find AGM context, using MagmDefine() with M_IMAGE or M_IMAGE_REGION. The entire source image is used as the model or the model is extracted from a non-rotated region of the source image, respectively. The specified source image must be a 1-band, 8-bit unsigned image. The minimum size of a source image is limited to 6 x 6 pixels, while the maximum size of 32768 x 32768 pixels is permitted. The model's source image should be of the best quality possible. If noisy, try to clean the image using image processing techniques discussed elsewhere in this user guide. When using the entire source image as the model, it must not have a region of interest (ROI) associated with it. To extract the model from a non-rotated region of the source image, you must specify a source image that is associated with a non-rotated rectangular ROI. To define the ROI, add a rectangle graphic to a 2D graphics list, using MgraRectAngle(). To set that rectangle graphic as the ROI of the model source image, you can call MbufSetRegion() with either M_NO_RASTERIZE or M_RASTERIZE, producing an M_VECTOR ROI or an M_VECTOR_AND_RASTER ROI, respectively. Composite-definition models A composite-definition model is built from training images, where instances of the model and background areas are identified with blue and red rectangles, respectively. While both single-definition and composite-definition models can find occurrences with variations and occurrences in cluttered targets, composite-definition models excel at these tasks because they learn to recognize varied model appearances and to ignore clutter in the background. If there is an item in the target that resembles your model, searching with a single-definition model might result in that item falsely identified as an occurrence. To avoid this, use a composite-definition model. To add a composite-definition model to your train AGM context, use MagmDefine() with M_COMPOSITE. Then, train the model with training images using MagmTrain(). Before training the model, you must label the positive and negative model locations in the training images. You can only train and search for one model; therefore, each blue rectangle must identify an appearance of the same model. You should identify false occurrences as part of the background, using red rectangles, so that the resulting trained composite-definition model can better discriminate the true occurrences from false occurrences. Note that all rectangles must be the same size. If you set MagmControl() with M_NEGATIVE_LABELS_MODE to M_AUTO, MagmTrain() will automatically identify and label the negative model locations. In this case, you must not add any red rectangles to your training images. For more information about how to label your training images, see the Labeling training images subsection of the Training a model section later in this chapter. Once trained, you copy the trained composite-definition model to a find AGM context, using MagmCopyResult() with M_TRAINED_MODEL. Preprocessing After you add (or copy) a model to your AGM context and before performing an MagmFind() or MagmTrain() operation, you have to preprocess the context, using MagmPreprocess(), otherwise an error will occur. It does not matter the type of model, or the type of context. Calling MagmPreprocess() will prepare the model for matching or training. In the case of single-definition models defined from an image, it is also the time when edges are actually extracted from the model image. Note that the AGM context must be preprocessed again if some of the model's search settings are changed. You can check if you need to preprocess after changing a control using MagmInquire() with M_PREPROCESSED. When you save an AGM context, preprocessing information is not saved with the context. You must preprocess the context when the AGM context is restored. Model origin The model origin is the point in the model that is considered to be (0,0). The model origin for a model defined from a CAD DXF file is the same as point (0,0) in the CAD DXF file. For all other types of models, the location of the model origin is the center of the model. You can use MagmControl() with M_REFERENCE_... to have results returned for a point other than the model origin. Defining and adding a model to your AGM context Single-definition models Defining a single-definition model from a CAD DXF file Defining a single-definition model from an Edge Finder result buffer Defining a single-definition model from an image Composite-definition models Preprocessing Model origin ",
      "wordCount": 1382,
      "subEntries": []
    },
    {
      "id": "UG_advanced-geometric-matcher_Finding_model_occurrences",
      "version": null,
      "title": "Finding model occurrences",
      "subTitles": [
        "Finding model occurrences in an image",
        "Finding model occurrences in an Edge Finder result buffer",
        "Determining what is a match",
        "Detection score",
        "Fit and coverage scores",
        "Maximum association distance",
        "Interpreting results",
        "Search settings",
        "Model source",
        "Detection angle",
        "Edgel angle",
        "Empty regions"
      ],
      "location": "MIL UG P03: 2D processing and analysis",
      "pageURL": "content\\UserGuide\\advanced-geometric-matcher\\Finding_model_occurrences.htm",
      "text": " Finding model occurrences You can search for instances of a model in an image, or you can search for instances of it in an Edge Finder result buffer, using MagmFind(). In order for an occurrence to be found, it must be at approximately the same scale as the model. MagmFind() will write the results of the search in a find AGM result buffer (M_GLOBAL_EDGE_BASED_FIND_RESULT). Note that calling MagmFind() successively with targets of different sizes will slow the execution time. Finding model occurrences in an image To search for instances of a model in an image, the target image must be a 1-band, 8-bit unsigned image. The minimum and maximum target image sizes are 6 x 6 and 32768 x 32768 pixels, respectively. It is important to note that the minimum and maximum target image sizes are MIL limits. To make sure that you have enough memory, you can call MagmFind(); if you don't have enough memory, you will get a MIL error. Note that because AGM does not support calibration, the target image must be uncalibrated. Finding model occurrences in an Edge Finder result buffer When using an Edge Finder result buffer as the target, AGM searches for edges of the model only in the included edges of the result buffer. Therefore, using the Edge Finder result buffer as a target, instead of an image, allows you to be more specific about the edges in which to search. For example, you could select out unwanted edges in the target, which will speed up the search and further calculations, or create a target that is composed of user-defined edges. Some things have to be done before you can search for instances of a model in an Edge Finder result buffer: The Edge Finder result buffer must have been previously allocated using MedgeAllocResult(). The Edge Finder result buffer must be compatible with the AGM context. Enable this using MedgeControl() with M_AGM_COMPATIBLE. MedgeCalculate() must have already been called using this result buffer. Note that because AGM does not support calibration, the Edge Finder result buffer must be uncalibrated or M_RESULT_OUTPUT_UNITS must be set to M_PIXEL. Determining what is a match Before customizing your search settings, it is necessary to understand how MIL determines a match between your model and an occurrence in the target. The detection, fit, and coverage scores are the primary factors in determining which occurrences are considered matches with the model in your find AGM context. When you call MagmFind(), MIL searches the target for occurrences and returns all occurrences with scores greater than or equal to the specified acceptance levels. If the detection, fit, or coverage score of an occurrence is less than the acceptance levels, it is not considered a match and no result is returned. Detection score The detection score is the probability that the occurrence is a match. 100% indicates that MIL is certain the found occurrence is a true occurrence. Only occurrences with a detection score above a set acceptance level will be considered a possible match. You can set the minimum detection score using MagmControl() with M_ACCEPTANCE_DETECTION. You can retrieve the detection score of the occurrence using MagmGetResult() with M_SCORE_DETECTION. In the example below, if you set M_ACCEPTANCE_DETECTION to 60%, the wrong occurrence detected at 52% will not be returned. Fit and coverage scores If an occurrence's detection score is acceptable, it is a viable candidate and MIL proceeds to calculate its fit and coverage scores. You can set the mode of the fit operation using MagmControl() with M_FIT_MODE. The fit score is a measure of the correlation of the edgels in the model to those of the occurrence. 100% indicates a perfect fit, which means that the edgels found in the occurrence conform perfectly to those in the model. The coverage score is the percentage of the total length of the model's edgels found in the occurrence. 100% indicates that for each of the model's edgels, a corresponding edgel was found in the occurrence. Only occurrences with fit and coverage scores above set acceptance levels will be considered a match. You can set the minimum fit score using MagmControl() with M_ACCEPTANCE_FIT and the minimum coverage score with M_ACCEPTANCE_COVERAGE. You can retrieve the fit and coverage scores of the occurrence using MagmGetResult() with M_SCORE_FIT and M_SCORE_COVERAGE. See the Interpreting results subsection below for an example. The AGM module can detect occurrences with some variation in appearance. An occurrence with a high detection score can have a low fit or coverage score, since these scores do not support variation. Setting the acceptance level for the fit and/or coverage score to a high value might remove occurrences with deformities from the list of possible matches. Lowering these levels will allow for more varied occurrences to be returned. Maximum association distance The maximum association distance determines which model edgels are close enough to the occurrence to be included in the fit score calculation and increase the coverage score. Set the maximum association distance using MagmControl() with M_MAX_ASSOCIATION_DISTANCE. MIL measures each model edgel's distance from the nearest occurrence edgel. Model edgels that fall beyond this range do not affect the occurrence's fit operation. These edgels are also considered uncovered and decrease the coverage score. Interpreting results The following image will be used as our sample model. The following table illustrates how the fit and coverage work together to provide details about the nature of a candidate. Note that values given are for illustrative purposes only, and as such are only qualitative. Target image Fit score (MagmGetResult() with M_SCORE_FIT) Coverage score (MagmGetResult() with M_SCORE_COVERAGE) 100% All the model edgels found in the occurrence are a perfect fit. 100% All the edgels in the model are found in the occurrence. 100% All the model edgels found in the occurrence are a perfect fit. 70% Some of the edgels in the model are missing from the occurrence. 100% All the model edgels found in the occurrence are a perfect fit. 100% Although there are extra edgels in the occurrence, all the edgels in the model have been found in the occurrence. 80% Some of the edgels found in the occurrence do not conform perfectly in shape to those in the model. 100% All the edgels in the model are found in the occurrence. Search settings With successive calls to MagmControl(), you can customize the search settings of the model in the find AGM context. Besides the detection, fit, and coverage acceptance levels, fundamental model search settings include the source of the model, the detection angle range, the edgel angle mode, and the empty regions mode. You can inquire about these settings using MagmInquire(). Most of the model search settings can affect the speed and robustness of your application. For example, increasing the search perseverance (M_PERSEVERANCE_DETECTION) increases the number of candidates that MIL attempts to match to your model. This will take longer to complete, but will increase the possibility of finding all model occurrences. It is recommended that you begin with the default values and then adjust individual settings as required. Model source Training a composite-definition model produces a model that encompasses the features of the labeled appearances from your training images. Consequently, your trained composite-definition model might have many edgels if there is a lot of variation between the model appearances. When fitting the trained composite-definition model to a found occurrence, or when calculating the trained composite-definition model's coverage, this might result in low fit and coverage scores. To perform the fit and coverage calculations, you can choose to use either the trained composite-definition model or an explicitly-specified image of the model, using MagmControl() with M_MODEL_SOURCE. When your trained composite-definition model has more edgels than a typical appearance, you should use an explicitly-specified image of the model for the fit and coverage calculations. You can view the edges of your trained composite-definition model using MagmDraw() with M_DRAW_TRAINED_MODEL. When M_MODEL_SOURCE is set to M_USER_IMAGE, you must specify the model image using MagmControl() with M_MODEL_IMAGE; note that in this case, the detection uses the trained composite-definition model and the fit and coverage use the model specified with M_MODEL_SOURCE. Detection angle You can search for a single-definition model at a specific angle or within a range of angles. Set the nominal search angle using MagmControl() with M_DETECTION_REF_ANGLE. By default, the search angle is 0°. The MagmFind() operation can detect occurrences within the full angular range of 360° from the nominal angle specified with M_DETECTION_REF_ANGLE. Use the MagmControl() M_DETECTION_DELTA_POS_ANGLE and M_DETECTION_DELTA_NEG_ANGLE control types to specify the detection angle range in the counter-clockwise and clockwise direction from the nominal angle, respectively. Note that the detection angle range only limits the angle of detection. The angle at which an occurrence is detected might not be exact; its true angle can typically be within 10° of the angle of detection, even if that falls outside of the detection angle range. If M_FIT_MODE is disabled, the returned angle of an occurrence will always be the angle at which it was detected and will therefore always be within the detection angle range. If M_FIT_MODE is enabled, a fit operation is performed starting from the angle of detection. In refining the angle so that it is more accurate, the angle of the occurrence's reference axis returned by MagmGetResult() can end up being outside of the detection angle range. Edgel angle The edgel angle mode determines whether the orientation of edgels affects the detection score. Set the edgel angle mode for a single-definition model using MagmControl() with M_EDGEL_ANGLE_MODE. Edgel orientation is defined by the gradient angle (the orientation of the edge's most sudden change in brightness). When you enable M_EDGEL_ANGLE_MODE, the find operation calculates the difference between target and model edgel orientations. The greater the difference, the more the detection score will decrease. Note that edgel orientation is indifferent to whether the brightness changes from dark to light or the reverse. Also note that this control is only available for single-definition models. Empty regions Empty regions are featureless regions that do not contain edges. If your model has a consistent region without edges (for example, a disk with a hole in the center), these regions would typically be featureless in the occurrence. You can consider the empty regions of your model when searching for occurrences by enabling empty regions using MagmControl() with M_EMPTY_REGIONS_MODE. This ensures that the detection score decreases when edges are found in the corresponding regions of the occurrence. You can also set the empty regions mode when training a composite-definition model. A find operation that uses a composite-definition model will consider empty regions when empty regions were considered during training. If model appearances in your target rest on a non-featureless background, you should disable M_EMPTY_REGIONS_MODE. In this case, the detection score will not decrease when edges are found in the corresponding regions. Finding model occurrences Finding model occurrences in an image Finding model occurrences in an Edge Finder result buffer Determining what is a match Detection score Fit and coverage scores Maximum association distance Interpreting results Search settings Model source Detection angle Edgel angle Empty regions ",
      "wordCount": 1840,
      "subEntries": []
    },
    {
      "id": "UG_advanced-geometric-matcher_Retrieving_and_analyzing_search_results",
      "version": null,
      "title": "Retrieving and analyzing search results",
      "subTitles": [
        "Possible results",
        "Drawing results",
        "Improving results"
      ],
      "location": "MIL UG P03: 2D processing and analysis",
      "pageURL": "content\\UserGuide\\advanced-geometric-matcher\\Retrieving_and_analyzing_search_results.htm",
      "text": " Retrieving and analyzing search results After successfully locating your model occurrences in your target using MagmFind(), you can extract the required results from your find AGM result buffer using MagmGetResult(). For more information on locating model occurrences, see the Finding model occurrences section earlier in this chapter. Possible results Generally, you should first retrieve the total number of occurrences of the model (using MagmGetResult() with M_NUMBER), to ascertain the size of the result array needed. You can then retrieve several types of results with the AGM module. These results provide information on the nature of the occurrence(s) found. In addition to the detection, fit, and coverage scores discussed previously, you can retrieve results for: Number of occurrences (M_NUMBER). Angle (M_ANGLE). Position X (M_POSITION_X) and position Y (M_POSITION_Y). Scale (M_SCALE). Status of the MagmFind() operation (M_STATUS). Note that only occurrences with small scale differences can be found. Results are returned in descending score order using either the detection, fit, or coverage score. Set the score by which to sort using MagmControl() with M_SORT_CANDIDATES_SCORE. The result with the highest score is returned first. For a complete description of all possible results, refer to MagmGetResult() in the MIL Reference. Occurrences are indexed with positive integers starting from 0. Drawing results The MagmDraw() function provides several operations for drawing results in any specified image buffer or 2D graphics list. You can also choose to draw in the display's overlay buffer. By drawing into the display's overlay buffer, you can annotate an image non-destructively (see the Annotating the displayed image non-destructively section of Chapter 25: Displaying an image). You can use a previously allocated 2D graphics context (see Chapter 26: Generating graphics) to control the drawing color, or use the default 2D graphics context (M_DEFAULT). Supported drawing operations include drawing a bounding box around the model or occurrence, the edges of the model or occurrence, or a cross at the model's reference axis origin or occurrence position. Improving results When false occurrences are found, you should re-call MagmFind() after modifying the relevant search settings discussed in the Finding model occurrences section earlier in this chapter. For example, you can try: Increasing the minimum detection score (M_ACCEPTANCE_DETECTION) until you begin to miss model occurrences. Increasing the minimum fit score (M_ACCEPTANCE_FIT) when model appearances are not deformed. Increasing the minimum coverage score (M_ACCEPTANCE_COVERAGE) when no model appearance is occluded. If false occurrences are still found, you should use/re-train a composite-definition model. Make sure to label all the false occurrences as negative model locations. For more information, see the Composite-definition models subsection of the Defining and adding a model to your AGM context section earlier in this chapter and the Training a model section later in this chapter. When the find operation does not find all occurrences, you should experiment with different values for controls, such as M_EDGEL_ANGLE_MODE and M_EMPTY_REGIONS_MODE. See the MagmControl() function for other possible controls to modify. Retrieving and analyzing search results Possible results Drawing results Improving results ",
      "wordCount": 495,
      "subEntries": []
    },
    {
      "id": "UG_advanced-geometric-matcher_Training_a_model",
      "version": null,
      "title": "Training a model",
      "subTitles": [
        "Labeling training images",
        "Labeling your training images using the AGM labeling tool",
        "Labeling your training images using the Graphics and Buffer modules",
        "Training settings",
        "Smoothness",
        "Threshold",
        "Training status",
        "When a composite-definition model is not successfully trained",
        "Using a trained composite-definition model"
      ],
      "location": "MIL UG P03: 2D processing and analysis",
      "pageURL": "content\\UserGuide\\advanced-geometric-matcher\\Training_a_model.htm",
      "text": " Training a model A composite-definition model must be successfully trained, using labeled training images, before you can use it to search for occurrences. To train a model, use MagmTrain(). This function will store the trained composite-definition model in a train AGM result buffer (M_GLOBAL_EDGE_BASED_TRAIN_RESULT). Labeling training images Unlike the source image used to define a single-definition model, training images contain appearances of the model and background. Appearances teach the composite-definition model what is a favorable feature of an occurrence, while background samples identify which features are not. The model appearances and background samples must be labeled using blue and red rectangles, respectively; the model is trained accordingly. Blue rectangles define positive model locations, while red rectangles define negative model locations. You must draw blue rectangles around instances of the required model. MagmTrain() can only train one model; therefore, each blue rectangle must identify an occurrence of the same model. You should attempt to label your training images such that all model occurrences appear in the exact same position within each blue rectangle. If the blue rectangles are not precise, you can use MagmControl() with M_REALIGN_STRENGTH to allow the MagmTrain() operation to displace the blue rectangles. The higher the realignment strength, the further MagmTrain() can displace the blue rectangles so that the model occurrences appear in the same position within each blue rectangle. You can use MagmControl() with M_NEGATIVE_LABELS_MODE to set whether to automatically label the negative model locations in the training images or to use manually defined negative (red) rectangles. If set to M_USER_DEFINED, you must draw red rectangles around the background samples. It is important to also include background samples that resemble the model, since these are most likely to be misidentified as occurrences. In this case, the set of training images must contain red and blue rectangles, associated to the images using regions of interest (ROIs). The ROI can be composed of several non-contiguous and/or overlapping areas, but it must contain at least one red rectangle and/or one blue rectangle. Considering all the rectangles across all training images, there must be a minimum of one red rectangle and one blue rectangle. Note that there can be training images with only red rectangles, only blue rectangles, or no rectangles. The training images with no rectangles are not used during training. If set to M_AUTO, you must not draw red rectangles around the background samples; MagmTrain() will automatically identify and label the background areas of your training images. In this case, a minimum of one training image must have a blue ROI associated with it. The ROI can be composed of several non-contiguous and/or overlapping areas, but it must contain at least one blue rectangle and cannot contain any red rectangles. Note that there can be training images with no ROI (no rectangles). If after training, the MagmFind() operation returns false occurrences, you should return to this step and draw red rectangles around each of the incorrectly identified occurrences. Note that the more rectangles you add, the longer the training duration. Training images must be 1-band, 8-bit unsigned images. The minimum size of each training image, red rectangle, and blue rectangle is 6 x 6 pixels, while the maximum size is 32768 x 32768 pixels. Note that all rectangles must be the same size. The center of each rectangle must be inside the training image. Labeling your training images using the AGM labeling tool You can label your training images interactively using the AgmLabelingTool example, accessible from the Matrox Example Launcher. agmlabelingtool.cpp AgmLabelingTool provides an interface to help you interactively label your training images. After launching the tool and specifying the folder that contains your images, you must select an appearance of your model. This model appearance will be used as a reference for the labeling process. Note that all rectangles will be the same size as the reference model. Label all model appearances and, if required, background samples by adding and validating positive (blue) and negative (red) rectangles. Upon saving, you will be provided with a container of labeled training images for use with MagmTrain(). You will also be provided with an image of the reference model that you can use, instead of the trained composite-definition model, for the fit and coverage calculations. Labeling your training images using the Graphics and Buffer modules You can also use the Graphics and Buffer modules to label your training images. To do so, use the MIL 2D graphics functions, such as MgraAllocList(), MgraColor(), and MgraRect(), to add positive (blue) and, if required, negative (red) rectangles to a graphics list, and then use MbufSetRegion() to associate the graphics list with the training image buffer. Repeat the process for each training image. You can add the labeled image buffers to a container using MbufCopyComponent() or create an array of image buffers, which you can then pass to MagmTrain(). Training settings With successive calls to MagmControl(), you can customize the training settings of the model in the train AGM context. You can inquire about these settings using MagmInquire(). Fundamental training settings include the smoothness factor and the threshold mode. Smoothness The smoothness factor determines the degree of noise reduction applied to the training images. Set the smoothness factor value using MagmControl() with M_SMOOTHNESS (the default setting is 50.0). Increasing the smoothness factor reduces noise, resulting in the extraction of fewer unwanted edges. Threshold The threshold mode determines the edge extraction sensitivity. Set the threshold using MagmControl() with M_THRESHOLD_MODE (the default setting is M_HIGH). A higher threshold decreases the sensitivity of the edgel detection, resulting in the extraction of fewer edgels. You should use the highest possible threshold that still detects all pertinent edgels. Training status Once you have used MagmTrain() to train the composite-definition model, you should retrieve the model's training status using MagmGetResult() with M_STATUS. If MIL returns M_STATUS_TRAIN_OK, the composite-definition model was successfully trained; you can then copy it to a find AGM context, using MagmCopyResult() with M_TRAINED_MODEL, and use it to search for occurrences. If MIL returns M_STATUS_TRAIN_FAILED, the model was not successfully trained, and you cannot copy the model to a find AGM context. When a composite-definition model is not successfully trained You must successfully train your composite-definition model before you can use it to search for occurrences. AGM uses edgels to construct the trained composite-definition model. This means that the training will fail if no edgels are found within the blue (positive) rectangles of your training images. If this is the case, you should re-call MagmTrain() after making the necessary modifications. For example, you can try: Modifying the positive labels on your training images to ensure that discernible model appearances are located within the blue rectangles. MIL extracts edges by analyzing intensity transitions. If the regions within your blue rectangles do not contain intensity transitions, no edgels will be found. If your model is uniform in intensity, you should ensure that your blue rectangles encompass the entire model. This will ensure that the model's boundary is present for the edge detection. Modifying the smoothness value (M_SMOOTHNESS). Smoothing the image reduces intensity transitions, which can obscure edges. If the smoothness level is too high, edges might disappear. Lowering the smoothness value can allow MIL to find previously undetected edgels. Note that you should still specify a smoothness level high enough to remove unwanted edgels. Modifying the threshold mode (M_THRESHOLD_MODE) to ensure that relevant edges are extracted. MIL determines which edges are extracted from the training images based on a thresholding of the magnitude of the gradient at each edgel position. If there are no edges above the set threshold within the blue rectangles, no edgels will be found. Note that you should still use the highest possible threshold that detects all pertinent edgels. Using a trained composite-definition model Once you have successfully trained a composite-definition model, you can copy the model to a find AGM context using MagmCopyResult() with M_TRAINED_MODEL. To evaluate the trained model, you can: Draw the trained composite-definition model using MagmDraw() with M_DRAW_TRAINED_MODEL. If the drawing does not resemble your required model, you should modify the training images and/or modify the training settings and re-call MagmTrain(). Perform a search by following the steps outlined in the Finding steps subsection of the Steps to finding model occurrences and training a model section earlier in this chapter. A false occurrence might be found if a background sample in your target and your model share too many features. If the search returns false occurrences, you can identify them in your training images using negative (red) labels and re-call MagmTrain(). This will remove the unfavorable features from the composite-definition model. You can do this repeatedly until no false occurrences are found. When your composite-definition model is adequately trained, you can use it to search for occurrences in your target. For more information on searching for occurrences, see the Finding model occurrences section earlier in this chapter. Training a model Labeling training images Labeling your training images using the AGM labeling tool Labeling your training images using the Graphics and Buffer modules Training settings Smoothness Threshold Training status When a composite-definition model is not successfully trained Using a trained composite-definition model ",
      "wordCount": 1520,
      "subEntries": []
    },
    {
      "id": "UG_advanced-geometric-matcher_Advanced_Geometric_Matcher_example",
      "version": null,
      "title": "Advanced Geometric Matcher examples",
      "subTitles": null,
      "location": "MIL UG P03: 2D processing and analysis",
      "pageURL": "content\\UserGuide\\advanced-geometric-matcher\\Advanced_Geometric_Matcher_example.htm",
      "text": " Advanced Geometric Matcher examples The following example demonstrates how to define a model and find model occurrences in target images. magm.cpp To run this example, use the Matrox Example Launcher in the MIL Control Center. The example, Magm.cpp does the following: Extracts a single-definition model from a source image, then finds occurrences of it on a circuit board. Constructs a composite-definition model through training, then finds occurrences of it with slight variations in appearance in different target images. Advanced Geometric Matcher examples ",
      "wordCount": 84,
      "subEntries": []
    }
  ]
}]