[{
  "id": "UG_about",
  "version": "2024020714",
  "title": "About MIL Help",
  "subTitles": null,
  "location": "MIL UG P01: Customizing MIL Help, support, and trademarks",
  "pageURL": "content\\UserGuide\\about\\ChapterInformation.htm",
  "text": " About MIL Help This chapter presents the Help files distributed with MIL and describes how to make the most of their navigation and customizable features. This chapter is also used as a placeholder for information relevant to all the MIL Help files. Customize MIL Help How MIL Help is divided Tips for using MIL Help Help view settings Navigation Search tab Availability Sample code Limiting the displayed information Printing MIL Help MIL system-specific information Contacting customer support Copyrights, Trademarks, Patents, Limitations of Liability, and Disclaimers ",
  "wordCount": 87,
  "subEntries": [
    {
      "id": "UG_about_Welcome",
      "version": null,
      "title": "Customize MIL Help",
      "subTitles": null,
      "location": "MIL UG P01: Customizing MIL Help, support, and trademarks",
      "pageURL": "content\\UserGuide\\about\\Welcome.htm",
      "text": " Customize MIL Help The following are your current settings. To change your current settings, click on the %%settingicon%% button above. Save Settings To optimize your Help experience, see the online Help tips page. Here you will find guidance on navigation, searching for topics, and collapsing/filtering displayed information. For getting started, read Chapter 1: Introduction and Chapter 2: Building an application. For a list of differences between previous major releases or service/processing pack releases, see the whatsnew release note. For new information that has yet to be added, consult the lastminute release note. Throughout the MIL Help, major releases of MIL might be referred to using either decimals or roman numerals. For example, the names MIL X and MIL 10 are used interchangeably. MIL Help is available online at zebra.com/aurora-imaging-library-help. Note that the local version of MIL Help includes documentation for all the MIL updates that you have installed; this is not necessarily the case with the versions online. Zebra Vision Academy provides video-based training for Aurora Imaging Library (formerly Matrox Imaging Library) and delivers a multitude of categorized instructional videos on how to use the software to create vision applications. These tutorials are available to registered users at Zebra Vision Academy. To view the trademark acknowledgments, see the Copyrights, Trademarks, Patents, Limitations of Liability, and Disclaimers section later in this chapter. Customize MIL Help ",
      "wordCount": 226,
      "subEntries": []
    },
    {
      "id": "UG_about_Help_Division",
      "version": null,
      "title": "How MIL Help is divided",
      "subTitles": null,
      "location": "MIL UG P01: Customizing MIL Help, support, and trademarks",
      "pageURL": "content\\UserGuide\\about\\Help_Division.htm",
      "text": " How MIL Help is divided The MIL Help is divided into different parts that discuss various topics. The Help is divided as follows: MIL User Guide. See for general usage of MIL. Part 2: MIL in a nutshell. Provides necessary information to get started. This is essential reading for working with MIL. Part 3: 2D processing and analysis. Provides information about supported 2D processing and analysis operations. Part 4: 2D related information. Provides information about working with 2D data buffers. Part 5: 3D processing and analysis. Provides information about supported 3D processing and analysis operations. Part 6: 3D related information. Provides information about working with 3D data containers. Part 7: Machine learning fundamentals. Provides information about how to, in general, use the MIL Classification module to perform machine learning. Part 8: Machine learning tasks. Provides information about how to use the MIL Classification module to perform specific machine learning tasks, such as image classification, segmentation, and feature classification. Part 9: Communication. Provides information about communicating with robots, working with industrial communication protocols, and auxiliary I/O signals. Part 10: Other programming languages, APIs, and operating systems. Provides information about using MIL with programming languages other than C, and operating systems other than Windows. Part 11: Miscellaneous. Remaining chapters. Provide more detailed information about set up and management. MIL Reference. See for the reference description of a specific MIL function. MIL Hardware-specific Notes. See for general information about using MIL with different Matrox Imaging hardware (or third-party hardware that is compatible with MIL). Note that hardware-specific information regarding a specific MIL function is integrated into the function's reference description. Note that the information is divided by the MIL system that you allocate for the hardware. MIL Release Notes. See for the most-up-to-date information regarding this release. Note that there are different release notes for different topics. For example, after installing a processing update, see the whatsnew release note. How MIL Help is divided ",
      "wordCount": 323,
      "subEntries": []
    },
    {
      "id": "UG_about_Help_tips_online_and_Linux",
      "version": null,
      "title": "Tips for using MIL Help",
      "subTitles": [
        "Help view settings",
        "Navigation",
        "Search tab",
        "Availability",
        "Sample code",
        "Limiting the displayed information",
        "Printing MIL Help"
      ],
      "location": "MIL UG P01: Customizing MIL Help, support, and trademarks",
      "pageURL": "content\\UserGuide\\about\\Help_tips_online_and_Linux.htm",
      "text": " Tips for using MIL Help This topic discusses tips on using/navigating MIL Help. You can access the MIL Help online at zebra.com/aurora-imaging-library-help. You can access this help from Visual Studio if you have installed the MIL add-on. Place your cursor on or highlight a MIL function/value and press F1 to jump to its description in the MIL Reference. The value must be used in the correct contextual location of its corresponding function and parameter. For example, if you want to see the description for M_BACKGROUND_COLOR of MdispControl(), M_BACKGROUND_COLOR must be passed as the second parameter of MdispControl(). See the Using MIL add-on to Visual Studio section of Chapter 2: Building an application for more information. Help view settings The home page of the MIL Help displays the current Help view settings. You can change these settings by clicking on the Settings button. The Help view settings dialog is presented. You can narrow or broaden the scope of the information presented in a reference page using the settings in the Development environment information section of the dialog. You can specify the following information: MIL systems Allows you to customize the information displayed in the Help file for the MIL systems (MsysAlloc) for which you are developing your application. See the MIL system-specific information section later in this chapter. Product Determines whether visual cues will be given when functionality is limited or unsupported in MIL-Lite. Computer Allows you to customize the information displayed in the Help file for your Matrox or non-Matrox computer. Operating system Allows you to customize the information displayed in the Help file for Microsoft Windows or Linux. When you navigate to a reference page that has information that you should be aware of given your current settings, the icon is displayed next to the Availability button in the blue bar. See the Availability subsection of this section for further details. From the Help view settings dialog, you can also set the default reference table view using the options in the Reference table view options section. See the Limiting the displayed information subsection of this section. Navigation The following table shows the different ways to navigate MIL Help: Feature Location Description Home page Customize MIL Help Allows you to see your current Help view settings as well as useful buttons to certain chapters or online resources. Product name In the white header Jumps you back to the home page if clicked upon. Note that it indicates the MIL version and service pack to which the Help applies. Whether the Help includes information for other updates is only indicated in the release notes. Breadcrumbs In the white header Indicate the location and name of the current section/reference. Contents tab On the left Offers a hierarchical view of the Help. It has the following features: Automatically displays your current location in the Help. Allows you to jump to a specific page in the Help. Has a context menu that allows you to collapse the current folder (Collapse) or all folders (Collapse All). To access the context menu, right-click on a contents item. If you collapse folders of the contents, you can show the location of the current topic by clicking the Locate topic context menu item. Index tab On the left Allows you to navigate to a specific constant's location(s) on a reference page, or to a specific function's reference page. To navigate the available items, you can either type the word in the edit field, use your mouse, or use your arrow keys. Search tab On the left Allows you to have specialized searches through the Help for more specific information. Page map On the right Offers a hierarchical view of the current page. It has the following features: Automatically displays your current location on the page. Allows you to jump to a specific subsection on the page. Can be hidden/displayed by clicking on the Page map button in the blue bar. Filters button In the blue bar Allows for filtering of required information in the MIL Reference. The Filters button only appears in some long pages of the MIL Reference. You can select from a list of different possible filters (for example, type of context). Choose the filter you want, and then click on the Apply button. The filters only apply to values within tables. Previous/next buttons In the blue bar Jump to the previous or next page in MIL Help. Click on the left or right arrow button (). See also In the blue bar Allows you to jump to topics that are related to the current topic. INQ/SET/INFO buttons In the reference Allow you to navigate to the function and constant to use to inquire or set a specific setting. Many MIL settings that can be specified can also be inquired. In these cases, an inquire icon () will appear next to the parameter or value to use to specify the setting. In addition, a set icon () will appear next to the value to use to inquire about the setting. In some cases, a short description of a value is followed by the information icon (). If you hover your mouse over this icon, a boxed note will appear indicating where to look for more information on this topic; clicking on the link in the boxed note will bring you to this referenced location. Tooltips Hover over items Offer quick information. For example, you can hover over: A title in the Contents tab, Index tab, Search tab, or Page map to display the entire title and avoid scrolling or expanding the tab. Options in the Search tab for a quick description. Empty columns on the left in parameter association tables to display the independent parameter value to which the current dependent parameter value pertains. Search tab To navigate the Search tab: Options Allow you to narrow the search by selecting required options. The current options are kept until you click on the Reset button. Once you customize the search options, the Reset button will have a yellow exclamation mark to its left, to remind you that you are no longer searching with default options. The Match similar words option is enabled by default. Match similar words only affects the stemming of words that are not all caps. For example, when Match similar words is enabled and Match case is disabled, TILTED will only match TILTED and tilted; however, if you search for Tilted or tilted, the search will find tilt, tilted, TILT, and TILTED. You can sort through the resulting list of topics according to their Title or Location by clicking on the corresponding column heading. To refine your query and search through previous results, enable Search previous results. To limit which part of the Help is searched, you can expand Search locations and enable the required part. Popup search dialog Allows you to navigate to the results that were actually found. Things to note: This is especially useful if you have performed a wildcard search. If there are too many hits on the page, you can search for the required word by performing an additional search with Search previous results enabled. To disable highlighting, click on the slider at the bottom left of the dialog. You can always use your browser's search functionality to search your page. Simple mode Enter a search term in the text box provided. You can hyphenate compound words; the search will find instances as a hyphenated word, two consecutive words, and a single word without spaces in it. The search supports the following operators: \" Matches the exact phrase enclosed in double quotation marks. * Matches 0 or more characters or symbols (for example, M_*COLOR matches M_COLOR and M_BACKGROUND_COLOR). To have the search match a space, enable the Allow * wildcard to cross words option. Note that when you disable Match similar words and use a wildcard search (with *), you can add another * at the end of your search term to find additional characters at the end of the term. For example, the query M_*DISPARITY will not find M_3D_DISPARITY_BASELINE, whereas M_*DISPARITY* will. ? Matches one character, space, or symbol. Regular expression mode See your browser's regular expression (regex) JavaScript syntax. You can set up searches using different groupings such as \\b[a-c]\\w*, which matches any word that begins with an a, b, or c. For more information and examples, you can visit https://www.regex101.com. When entering your search expression, don't write it between slashes. By default, MIL Help performs global, case-insensitive searches (/---/gi). The regex search flags are not available; the g (global) and i (case-insensitive) options are performed internally. To match case, enable the Match case option in the Search tab (this internally removes the i regex flag). Max # highlighted instances per term Sets the maximum number of results to highlight on a page per term. Decreasing this number increases the load speed of a page accessed through the search results. Availability Features of the Availability button: Availability button Displays whether the current topic is applicable to MIL, MIL-Lite, and to which of the MIL-supported hardware and operating systems. In the MIL Reference manual, when the current topic is not applicable to one of your Help view settings, the Availability button will have a yellow exclamation mark to its left. If you click on the Availability button, it displays a list of what is not applicable in red. Sample code Features of the Sample code button: Sample code button Allows you to jump to calls to the current function in MIL examples. Typically lists up to a specific number of MIL examples. If there are additional examples, click on Search for other examples. This searches the examples included in the MIL Help for a call to the function. Note that Search location is automatically set to Sample Code. It is recommended to click on Reset or adjust your search locations after searching through the examples. To search the MIL examples in general, use the Search tab and enable Sample Code from MIL examples under the Search locations option. Note that these examples are not necessarily installed. To search and run installed examples, use Example Launcher accessible from the MIL Control Center. Limiting the displayed information To limit the displayed information in the MIL Reference: Collapse values tables Collapse/expand values tables in the MIL Reference using the Collapse/Expand tables button. You can use the arrows at the top of a table and at each individual value to collapse/expand just that specific table or value. You can change the default setting from the Help view settings dialog ( button); choose to expand/collapse Descriptions. Select your system Select the system for which you want information using the button. When viewing information for many systems, you can collapse the columns to a single column by clicking on the MIL systems information drop down menu. Use filters Apply any required filters using the Filters button. Typically, long reference pages provide a Filters button in the blue bar. These filters only affect the reference tables. To limit the displayed information in the MIL User Guide and MIL Hardware-specific Notes: Collapse sections Collapse/expand the subsections of the current section in the user guide using the Collapse/Expand section button. You can use the arrows next to the subsection titles to collapse/expand just that specific table or value. To limit margin content: Resize margins Resize the columns on either side of any page by dragging the vertical border. To hide the Contents, Index, and Search tabs, double-click on the vertical border. Printing MIL Help To print the page you are viewing, right-click on it and select Print. If printing from the MIL Reference, some MIL system columns might not print due to the width of the selected paper size. It is recommended that you print pages from the MIL Reference using the Landscape option. You should also enable background printing. Tips for using MIL Help Help view settings Navigation Search tab Availability Sample code Limiting the displayed information Printing MIL Help ",
      "wordCount": 1996,
      "subEntries": []
    },
    {
      "id": "UG_about_Board_specific_information",
      "version": null,
      "title": "MIL system-specific information",
      "subTitles": null,
      "location": "MIL UG P01: Customizing MIL Help, support, and trademarks",
      "pageURL": "content\\UserGuide\\about\\Board_specific_information.htm",
      "text": " MIL system-specific information Some parameter settings and information in the MIL Reference are only applicable when using certain MIL systems. This information is referred to as MIL system-specific information. A MIL system typically refers to a set of hardware components capable of grabbing, storing, processing, and/or displaying images (for example, a Matrox Radient system consists of the imaging board, the CPU, and a display board). MIL systems are allocated using MsysAlloc(). Use the MIL systems button in the Blue/Red menu bar to specify whether you want to show all the MIL system-specific information, or limit the MIL system-specific information to the MIL systems you have allocated. To change these settings and have these settings kept between sessions, use the Customize Help button. MIL system-specific information is denoted in the gray columns that appear to the right of the setting descriptions. Each column has a dark gray header at the top of its table and contains the name of the system, as well as the corresponding system letter. Next to remarks or settings, the column can contain either the system letter, indicating support, or a blank cell, indicating no support. For example, if a certain setting is available when using a Matrox Radient eCL system and this system is associated with the letter 'j', the letter 'j' will appear in the corresponding column next to the setting. If the setting is not supported for a Matrox Radient eCL system, the corresponding column would have a blank cell. For tables where settings and descriptions are available for or applicable to all systems, no MIL system-specific columns appear. When an update for a MIL system is officially documented in the MIL Reference, the corresponding update number is included in the system-specific column header (for example, the Matrox Radient eV-CL (u27)). If there are multiple updates officially documented for a MIL system, all update numbers for which the system is officially documented are listed in the column header (for example, the Matrox Clarity UHD (U36|U76)). In addition to the corresponding system letter, the column for these updates contains the number of the first update to support a setting, or M10 if the setting was supported in the base MIL 10 release. Note that if an update affects a component of MIL common to other systems, the columns for the other systems won't accurately reflect the first update to support any newly added settings. For more information on how MIL updates are documented, refer to the MIL updates section of Chapter 1: Introduction. To collapse the MIL system-specific information into a single tooltip per setting, change your MIL system selection on the Blue/Red menu bar so that Show as a tooltip is selected. Note that this option can also be set on the Welcome page. MIL system-specific information ",
      "wordCount": 465,
      "subEntries": []
    },
    {
      "id": "UG_about_Contacting_customer_support",
      "version": null,
      "title": "Contacting customer support",
      "subTitles": null,
      "location": "MIL UG P01: Customizing MIL Help, support, and trademarks",
      "pageURL": "content\\UserGuide\\about\\Contacting_customer_support.htm",
      "text": " Contacting customer support To address questions that are not answered in this manual, in any accompanying release note, or in release notes on any accompanying software media, contact your local Zebra partner or refer to the support page on the Zebra website. This page provides registered customers with technical support and product resources. If your question is not addressed and you are registered, you can contact technical support. To do so, complete and submit the online Technical Support Request Form, accessible from the aforementioned page. Once the information is submitted, a Zebra support representative will contact you shortly thereafter by email or phone, depending on the problem. If you are registered and you cannot complete the aforementioned form, you can contact Zebra's FrontLine Support Team by phone for support at (+1) 514-822-6061. Support Resources are available Monday through Friday from 9:00am to 5:00pm EST. Contacting customer support ",
      "wordCount": 149,
      "subEntries": []
    },
    {
      "id": "UG_about_Copyrights_acknowledgments_and_patent_notices",
      "version": null,
      "title": "Copyrights, Trademarks, Patents, Limitations of Liability, and Disclaimers",
      "subTitles": null,
      "location": "MIL UG P01: Customizing MIL Help, support, and trademarks",
      "pageURL": "content\\UserGuide\\about\\Copyrights_acknowledgments_and_patent_notices.htm",
      "text": " Copyrights, Trademarks, Patents, Limitations of Liability, and Disclaimers This section lists copyrights, acknowledgments, patent notices, limitations of liability, and disclaimers. Copyright ©1992-2024 Zebra Technologies Corp. and/or its affiliates. All rights reserved. Trademarks ZEBRA and the stylized Zebra head are trademarks of Zebra Technologies Corp., registered in many jurisdictions worldwide. All other trademarks are the property of their respective owners. Zebra Software The object code or source code (collectively, the \"Zebra Software\") is the exclusive property of Zebra or its licensors. Zebra Software is protected by copyright and other intellectual property rights. Zebra Software is licensed, not sold. Zebra Software should not be distributed except pursuant to a valid license agreement approved by Zebra containing appropriate restrictions. Use of Zebra Software is governed by the terms of the license agreement that accompanies or is included with the Zebra Software. UNAUTHORIZED COPYING, DISTRIBUTION, MODIFICATION, OR OTHER USE OF ZEBRA SOFTWARE IS STRICTLY PROHIBITED. Third-Party Software For the copyrights of any third-party software used or used in part by MIL or its utilities, refer to the MILConfig utility. Some scripts in this Help file are implemented using Nuglify library version 1.20.2 BSD 2-Clause License copyright © 2016 Alexandre Mutel; Andrew Bullock, Newtonsoft.Json framework version 12.02.2.23222 The MIT License copyright © 2008 James Newton-King, Dyn-Web tooltip version Nov 2012 Unlimited license copyright © 2003-2012 Sharon Paine, jQuery library versions 1.2.6 - 3.4.1 The MIT License copyright © 2008 - 2019 John Resig, jQuery UI version 1.12.1 The MIT License copyright © 2020, mark.js version 9.0.0 The MIT License copyright © 2014–2019 Julian Kühnel, Material components version 12.0.0 The MIT License copyright © 2014-2020 Google Inc., Roboto version 2.0 Apache License copyright © 2004. Patents This product might be protected by one or more patents. See zebra.com/patents. Limitations of Liability In no event will Zebra or its suppliers be liable for any indirect, special, incidental, economic, cover or consequential damages arising out of the use of or inability to use the product, user documentation or related technical support, including without limitation, damages or costs relating to the loss of profits, business, goodwill, even if advised of the possibility of such damages. In no event will Zebra and its suppliers' liability exceed the amount paid by you, for the product. Because some jurisdictions do not allow the exclusion or limitation of liability for consequential or incidental damages, the above limitation might not apply to you. Disclaimer Zebra reserves the right to make changes in specifications at any time and without notice. The information provided by this document is believed to be accurate and reliable. However, neither Zebra nor its suppliers assume any responsibility for its use; or for any infringements of patents or other rights of third parties resulting from its use. No license is granted under any patents or patent right of Zebra. Copyrights, Trademarks, Patents, Limitations of Liability, and Disclaimers ",
      "wordCount": 478,
      "subEntries": []
    }
  ]
}]