[{
  "id": "UG_introduction",
  "version": "2024020714",
  "title": "Introduction",
  "subTitles": null,
  "location": "MIL UG P02: MIL in a nutshell",
  "pageURL": "content\\UserGuide\\introduction\\ChapterInformation.htm",
  "text": " Chapter 1: Introduction This chapter presents the features of the Matrox Imaging Library package. It also explains the installation process and how to run a Matrox Imaging Library application program. Introduction to MIL and MIL-Lite MIL and MIL-Lite modules MIL and the Intel SIMD technologies Requirements to run MIL Under Windows Hardware requirements Supported software Software requirements for MIL Help Standby/sleep mode Under Linux Supported Linux distributions Hardware requirements Supported software Software requirements for MIL Help Before you start Installation Under Microsoft Windows Under Linux General installation notes MIL Control Center MILConfig utility Automatic updates Matrox Intellicam Testing the installation Communicating properly Compiling and linking Compiler warnings for deprecated constants and functions MIL User Guide and examples Examples Vision Academy MIL updates ",
  "wordCount": 124,
  "subEntries": [
    {
      "id": "UG_introduction_Introduction_to_MIL_and_MILLite",
      "version": null,
      "title": "Introduction to MIL and MIL-Lite",
      "subTitles": null,
      "location": "MIL UG P02: MIL in a nutshell",
      "pageURL": "content\\UserGuide\\introduction\\Introduction_to_MIL_and_MILLite.htm",
      "text": " Introduction to MIL and MIL-Lite The Matrox Imaging Library (MIL) is a hardware-independent, modular imaging library. MIL has been designed for fast application development and ease of use. MIL is capable of running solely with the Host CPU, but can take advantage of specialized acceleration Matrox hardware if it is available and is more efficient. MIL has a completely transparent management system and handles physical objects (such as imaging boards) as virtual objects, allowing for platform-independent applications. MIL uses the notion of systems to identify boards, and more than one board can be controlled by a single application program. MIL allows multiple computers to collaborate across a network, either in a controlling configuration within a single application or in a monitoring configuration between concurrent applications. Both configurations are supported using Distributed MIL. MIL is a C library intended to be used when writing C/C++ applications. However, by including the provided MIL.NET wrapper in your code, MIL functions are available when writing managed Visual C# applications. Alternatively, by including the provided MIL Python wrapper, MIL functions are available when writing code in Python language versions 3.6 or later. MIL comes in a full version, and a version that includes only core functions. The latter is referred to as MIL-Lite. MIL-Lite allows you to grab, display, archive, transfer, and annotate images. It also allows you to perform some processing operations that are typically useful to preprocess grabbed images. MIL-Lite can: Grab up to 16-bit grayscale images, or color images. Process 1, 8, 16, and 32-bit integer or floating-point grayscale images, depending on the operation. Process color images, depending on the operation. Each band of a color image is processed individually, one after the other. Basic color processing operations, such as converting color images to grayscale, are supported. Display 1, 8, or 16-bit grayscale or color images (if the platform supports it). Control custom FPGA configurations on applicable Matrox Imaging hardware to offload processing tasks from the Host. Communicate with automation and robot controllers using the specified protocols. Perform core 3D functions such as: display point cloud containers and 3D objects or generate 3D geometries. The full version of MIL expands upon the basic functionality of MIL-Lite and allows you to perform more advanced image processing and analysis. The full version of MIL provides a more extensive set of functions in the image processing module (for example, Fast Fourier or watershed transformations), as well as allowing you to use modules to perform operations such as: 3D reconstruction, bead analysis, blob analysis, code read/write, camera calibration, color analysis, edge finding, machine learning, measurement, metrology, geometric model finding, pattern matching, character recognition, registration, dot-matrix reading, and string reading. If the available MIL or MIL-Lite operations do not provide the required functionality, you can use the MIL Function Development module to create your own pseudo-MIL functions (also known as user-defined MIL functions). The MIL Help file refers to both versions of MIL simply as MIL, unless it is necessary to distinguish between them. Note that the Availability button of each function description indicates whether or not it is supported by MIL-Lite. Please review the MIL Release Notes for information on recent updates before using MIL. Introduction to MIL and MIL-Lite ",
      "wordCount": 536,
      "subEntries": []
    },
    {
      "id": "UG_introduction_MIL_and_MILLite_modules",
      "version": null,
      "title": "MIL and MIL-Lite modules",
      "subTitles": null,
      "location": "MIL UG P02: MIL in a nutshell",
      "pageURL": "content\\UserGuide\\introduction\\MIL_and_MILLite_modules.htm",
      "text": " MIL and MIL-Lite modules MIL and MIL-Lite share core functionality, including application and system control, image acquisition and archiving, graphical annotations, and basic image processing operations that are typically useful to preprocess grabbed images. In the command reference, each function has an availability note in the menu. If it is available in MIL-Lite, you can use it if you have a MIL-Lite license; typically, no extra license module is required. To establish at a glance which functions are supported in MIL-Lite, go to the Customize MIL Help page of the MIL Help file, and set your product setting to MIL-Lite. Then, from the MIL Reference tree structure of the table of contents, click on im (or any other module prefix); this displays the module's information page. The functions in blue are those available in MIL-Lite. The following is a summary of the functionality common to both MIL and MIL-Lite. Abbreviation Module name Description Mapp Application Allows you to initialize and control the execution environment for a MIL application. The module provides, among other things, integrated debugging services, a high-performance timer for benchmarking, portable threads and event handling, and automatic system resource compensation for processing and memory operations. Mbuf Buffer Allows you to allocate and control data buffers (storage areas) that are operated on by functions of several MIL modules. These buffers include image buffers and lookup table (LUT) buffers. The Buffer module allows you to isolate regions of a buffer using child buffers or regions of interest. In addition, this module can copy required sequential or non-sequential regions or bit-planes of a buffer to another buffer. The module's copy functions are optimized to make the best possible use of available system resources to maximize transferring speed. The module can archive and retrieve buffer data in common storage formats (for example, TIFF and JPEG). It can also create, save, and load sequences in AVI format. The module allows you to compress and decompress images and sequences, supporting both lossy and lossless JPEG and JPEG2000 compression algorithms. Furthermore, the module allows you to convert images grabbed from a camera with a Bayer filter, into 3-band color images. Mcom Industrial Communication Allows you to communicate with a device or a robot controller using a specified industrial protocol. Mdig Digitizer Allows you to manipulate and control the acquisition section of an imaging board and configurable cameras (such as GenICam SFNC-compliant cameras and GigE Vision cameras). It allows you to grab images or transmit/receive auxiliary signals, such as trigger input, timer output, and user output signals. It also allows you to use the serial interface of the imaging board, if the user signals are dependent upon the acquisition path used. Mdisp 2D Display Allows you to display images and manipulate their display. The 2D Display module offers many display effects, such as overlay, LUTs, and panning and zooming. Mfpga FPGA Allows you to perform custom processing operations using an on-board Processing FPGA. Performing processing operations on-board frees up the Host for other tasks. The module allows you to create, set up, and dispatch the required command(s) to carry out a required operation using specific processing units (PU) on a target Processing FPGA. You can configure, link, and queue multiple commands, as well as store necessary information in PU user-specific registers. This module assumes that the appropriate FPGA configuration with the required PUs has been loaded into the Processing FPGA. Mfunc Function Development Allows you to define functions to extend MIL's functionality. Using this module, you can implement functions/scripts and integrate them directly into MIL, where they behave like standard MIL functions (for example, respecting error handling and tracing). These are referred to as user-defined MIL functions. Supported languages include (but are not limited to) C, C++, C#, and Python 3.6 or later. Mgen Data Generation Allows you to generate data based on predefined algorithms and store it in a data buffer (for example, generating ramp data in a LUT buffer). Mgra Graphics Allows you to annotate an image with graphics or text either in raster-based (destructive) form or in vectorial form. Additionally, you can modify and create graphics interactively within a 2D display. Mim Image Processing Allows you to perform point-to-point, statistical, spatial filtering, morphological, wavelet, color, and geometric transformation operations. These operations allow you to perform image enhancements, distortion corrections, and analysis. Note that only a subset of the functions of the Image Processing module is available in MIL-Lite. Refer to the MIL Reference for details. Mobj Object Allows you to create and control MIL objects for a Distributed MIL application. Mseq Sequences Allows you to perform compression and decompression operations on sequences of images and save the result to a video stream. Msys System Allows you to allocate and control a MIL system. When you allocate a system, MIL opens communication channels and initializes the system (or hardware resources). Once Host communication has been established with a system, you can allocate its memory resources, display, and input capabilities. When a remote computer is specified during system allocation, the resources of the specified computer are made available: its specified Matrox imaging board (or third-party board), its CPU, and its memory. MsysIo System I/O Allows you to allocate and control an I/O command list. This module is a sub-module of the System module. Mthr Thread Allows you to allocate MIL selectable threads and synchronization events on a specified multi-threaded MIL system. MIL threads and events allow you to synchronize the execution of MIL calls on an on-board processor or a remote computer. M3ddisp 3D Display Allows you to display 3D data (point cloud containers and fully corrected depth maps) and other 3D graphics. The 3D Display module also allows you to manipulate the point-of-view of the 3D display. M3dgeo 3D Geometry Allows you to generate 3D geometries. The 3D Geometry module also allows you to define transformation matrices. M3dgra 3D Graphics Allows you to add graphic elements to a 3D graphics list. Graphic elements in a 3D graphics list allow you to annotate a 3D display. The following modules require the full version of MIL. Abbreviation Module name Description Magm Advanced Geometric Matcher Allows you to find model occurrences in cluttered target images by determining edge-related scores for each candidate. AGM allows you to use a single image as the reference model, or it can construct the best possible model through training, using model appearances and background samples. Mbead Bead Allows you to measure and verify beads (continuous strips of material) according to predefined specifications. You can verify that a bead occurs at a required position, that its width falls within a certain range, that it does not have any gaps, and that its gaps do not exceed a specified size. Mblob Blob Analysis Allows you to identify and measure connected regions of pixels (commonly known as blobs) within an image. Mcal Camera Calibration Allows you to map pixel coordinates to real-world coordinates despite the presence of optical, aspect ratio, rotation, and perspective distortions in images. This mapping can be used to specify settings, and calculate and get results, from other MIL modules in real-world units. In addition, the module allows you to fixture a coordinate system to instances of a target object; this allows you to specify settings and obtain results relative to a location at a fixed offset from an object. Mclass Classification Allows you to perform machine learning tasks, such as image classification, segmentation, and feature classification. Mcode Code Allows you to read and write several types of 1D codes (bar codes) and 2D codes (for example, Data Matrix codes), as well as composite codes. In addition, the module supports error correction schemes that allow you to both detect errors and recover data from degraded images. The module also provides functionality to verify the quality of printed codes, verifying if the scanned code meets your quality standards. Mcol Color Analysis Allows you to perform color-based operations such as matching, projection, and distance. You can use these operations to identify colors, segment colors (supervised), detect defects, enhance color-to-grayscale conversion, separate superimposed colors, and measure the relative presence of a color in an image. You can also adjust color data according to a specific color reference, using relative color calibration. Mdlocr Deep Learning OCR Allows you to perform optical character recognition using deep learning-based technology. Unlike other text reading modules, Deep Learning OCR does not require fonts or string models to read text in an image. String models can be defined using a string occurrence of an initial read operation to limit what is read. Mdmr SureDotOCR Allows you to perform optical character recognition on dot-matrix text using feature-based technologies. You can quickly create fonts and string models and use them to perform robust read operations. SureDotOCR is invariant to changes in contrast, and offers considerable tolerance towards variations in angle. The module can also adapt to some variations in scale, aspect ratio, and perspective. SureDotOCR supports multiple grammar-like rules and font definitions in a single context, and provides its own font file format, allowing you to more easily manage your fonts. SureDotOCR refers to MIL functions prefixed with Mdmr. Medge Edge Finder Allows you to extract different types of edges in images, such as edges of object contours or thin curvilinear shapes. It also provides edge analysis capabilities and can measure a wide assortment of edge features, such as edge length and Feret diameter. Mmeas Measurement Allows you to find sets of image characteristics or \"markers\" in an image, based on differences in pixel intensities. Upon finding a marker, the module returns the marker's spatial reference position and measures such features as its width and angle. The module can also take measurements between two markers. Mmet Metrology Allows you to measure the shape, size, and location of objects relative to one another in a target image and validate that they meet certain tolerances. This is done using a virtual template built from features (either physically present in an image or geometrically constructed) and tolerances specified. The template itself can be positioned where such features have been found in the target image. Mmod Geometric Model Finder Also referred to as Model Finder. Allows you to find models using an algorithmic approach that uses edge-based geometric features instead of a pixel-to-pixel correlation. The module's capabilities include: Finding models through a range of angles and scales. Finding occluded models. Greater tolerance of adverse lighting conditions. Results that provide more detailed information about the nature of the occurrence. Mocr Optical Character Recognition Allows you to perform character recognition using template-based technology. The Optical Character Recognition module reads and verifies character strings in images, providing results such as quality scores and validity flags. The module is especially designed to operate on character strings in degraded images, with up to ± 180° of rotation in the target string. The OCR module supports multiple strings and non-uniform spacing between characters. Mpat Pattern Matching Allows you to perform normalized grayscale correlation (NGC) pattern matching. The module's capabilities include finding: The number of occurrences of models in a target image. Occurrences of models at any angle in the target image. Mreg Registration Allows you to perform correlation-stitching registration, extended depth of field registration, depth-from-focus registration, or photometric stereo registration. Correlation-stitching registration allows you to find the transformations that optimally position images in the same coordinate system; these results can also be used to perform a mosaicing operation. Extended depth of field registration allows you to fuse images of a scene taken at different focus distances to simulate an image taken with an extended depth of field. Depth-from-focus registration allows you to generate an index map of a scene whereby each index represents a different depth, based on images of the scene taken at different focus distances. Photometric stereo registration allows you to use multiple images of a scene, taken with different lighting orientations, to detect defects on a reflective or smooth surface. Mstr String Reader Allows you to perform character recognition using feature-based technology. Being feature-based, String Reader is invariant to changes in scale, aspect ratio, and contrast. It also offers considerable tolerance towards variations in perspective and angle. In addition, the String Reader module supports multiple user-defined grammar rules, multi-font definitions, and fontless string reading, making applications simple to write and maintain. M3dblob 3D Blob Analysis Allows you to segment a point cloud into blobs, calculate blob features, and select and sort for blobs of interest. M3dim 3D Image Processing Allows you to perform arithmetic and statistical operations on point clouds, depth maps, and 3D geometries. The 3D Image Processing module can perform operations such as cropping, sampling, and point cloud manipulation. M3dmap 3D Reconstruction Allows you to use a 3D reconstruction setup to scan an object and acquire 3D (three-dimensional) information from 2D (two-dimensional) images. M3dmeas 3D Measurement Allows you to find markers in a depth map. Markers denote the location of transitions along a profile (edge transitions or invalid transitions). The 3D Measurement module allows you to search for markers in each row (profile) of a depth map, in a profile extracted from a depth map along a path, or in profiles extracted from a depth map at regular intervals perpendicular to a template. In the latter case, you can also fit a geometry to found markers. M3dmet 3D Metrology Allows you to calculate various distance measurements and statistics between a point cloud, depth map, or geometry object. The 3D Metrology module also allows you to fit a geometry object to a point cloud or depth map. M3dmod 3D Model Finder Allows you to find occurrences of cylinder or sphere models in a point cloud. M3dreg 3D Registration Allows you to calculate the optimal registration of the overlapping region shared between two (or more) point clouds, and defines the transformation needed to achieve this registration. MIL and MIL-Lite modules ",
      "wordCount": 2302,
      "subEntries": []
    },
    {
      "id": "UG_introduction_MIL_and_the_Intel_MMXSSE_technologies",
      "version": null,
      "title": "MIL and the Intel SIMD technologies",
      "subTitles": null,
      "location": "MIL UG P02: MIL in a nutshell",
      "pageURL": "content\\UserGuide\\introduction\\MIL_and_the_Intel_MMXSSE_technologies.htm",
      "text": " MIL and the Intel SIMD technologies MIL's processing operations have been optimized to take advantage of Intel's single-instruction, multiple-data (SIMD) technologies to accelerate multimedia (and multimedia-like) applications. SIMD technologies can handle computation-intensive algorithms that perform repetitive operations. These technologies cover a wide range of capabilities, such as basic arithmetic operations, logical operations, shift operations, comparison operations, and data transfer instructions. These instructions can assist in processing multiple pieces of data in parallel. SIMD technologies include: MMX, streaming SIMD extensions (SSE/SSE2/SSE3/SSE4), and advanced vector extensions (AVX/AVX2/AVX-512). SSE and AVX are iterative improvements to MMX. With each improvement, the amount of data that can be processed simultaneously increased (from 64-bit with MMX, to 128-bit with SSE, to 512-bit with AVX). In addition, each new SIMD technology provides additional instructions that MIL selectively uses to improve overall image processing performances. MIL and the Intel SIMD technologies ",
      "wordCount": 145,
      "subEntries": []
    },
    {
      "id": "UG_introduction_Requirements_to_run_MIL",
      "version": null,
      "title": "Requirements to run MIL",
      "subTitles": [
        "Under Windows",
        "Hardware requirements",
        "Supported software",
        "Software requirements for MIL Help",
        "Standby/sleep mode",
        "Under Linux",
        "Supported Linux distributions",
        "Hardware requirements",
        "Supported software",
        "Software requirements for MIL Help"
      ],
      "location": "MIL UG P02: MIL in a nutshell",
      "pageURL": "content\\UserGuide\\introduction\\Requirements_to_run_MIL.htm",
      "text": " Requirements to run MIL MIL is available as a set of DLLs under the Windows and Linux operating systems. The following computer requirements should be respected to ensure that MIL operates properly. Under Windows MIL X supports Microsoft Windows 10. See the whatsnew release note for the exact supported versions. Hardware requirements The minimum required hard disk space to install the MIL development environment is 6 GB. The minimum hard disk space required to install the MIL-Lite development environment is 4 GB. A minimum of 250 MB of free hard disk space is required to install the MIL runtime environment without any boards selected. In addition, a computer with a CPU that supports the SSE4.2 instruction set is required. Supported software The MIL installation media includes MIL files that support the following development environments under Microsoft Windows 10: Microsoft Visual C++ compiler (unmanaged). Microsoft Visual C# compiler. Microsoft .NET Framework environment. Python development environments. See the whatsnew release note for the exact supported versions of Microsoft Visual Studio and Python. Software requirements for MIL Help To view MIL Help, a browser with HTML5 support is required. Also, JavaScript must be enabled. Standby/sleep mode MIL does not support the sleep mode under Microsoft Windows. In Windows 10, a MIL application detects when the operating system enters the sleep mode. Once the operating system comes out of this mode, you will be prompted to restart the computer for proper functionality of the application. Under Linux To run MIL under Linux, there are minimum and recommended operating system and hardware requirements. For a list of the differences of using MIL under Linux, see the Working with Linux section of Chapter 61: Using MIL under Linux. Supported Linux distributions The following Linux distributions are supported for MIL X: Linux distribution Minimum recommended RAM x86-64 Armv8-A 64-bit Ubuntu LTS (64-bit) 2 GB X X SUSE Linux Enterprise (64-bit) 2 GB X Red Hat Enterprise Linux (64-bit) 2 GB X See the millinux release notes for the supported versions of the above-mentioned Linux distributions. Hardware requirements A minimum of 5 GB of free hard disk space is required to install the MIL development environment. The minimum required hard disk space to install the MIL-Lite development environment is 3 GB. A minimum of 772 MB of free hard disk space is required to install the MIL runtime environment without any boards selected. In addition, a computer with a CPU that supports the SSE4.2 instruction set or an embedded computer with an Arm Cortex-A family processor employing the Armv8-A 64-bit architecture is required. Supported software The MIL installation media includes MIL files that support the following development environments under Linux: Microsoft .NET Framework environment. Python development environments. GCC (GNU Compiler Collection). Intel C++ Compiler. See the whatsnew and millinux release notes for the supported versions of Python and the .NET Framework, respectively. Software requirements for MIL Help To view MIL Help, a browser with HTML5 support is required. Also, JavaScript must be enabled. Requirements to run MIL Under Windows Hardware requirements Supported software Software requirements for MIL Help Standby/sleep mode Under Linux Supported Linux distributions Hardware requirements Supported software Software requirements for MIL Help ",
      "wordCount": 528,
      "subEntries": []
    },
    {
      "id": "UG_introduction_Before_you_start",
      "version": null,
      "title": "Before you start",
      "subTitles": null,
      "location": "MIL UG P02: MIL in a nutshell",
      "pageURL": "content\\UserGuide\\introduction\\Before_you_start.htm",
      "text": " Before you start You are probably anxious to start using MIL. However, before you start, we recommend that you follow these steps: Register MIL on the support page of the Matrox Imaging website. This ensures that you are on our mailing list and will receive any information on product updates and promotions. Install MIL on your hard disk using the installation details (described later in this chapter). See the MIL Release Notes for additional documentation. Review the Default Values item in the MILConfig utility to make sure that the default setup configuration matches your system configuration. For more information on defaults, see the Using the defaults section of Chapter 2: Building an application. Run our sample program MappStart, from the Example Launcher utility, to test the installation. Before you start ",
      "wordCount": 132,
      "subEntries": []
    },
    {
      "id": "UG_introduction_Installation",
      "version": null,
      "title": "Installation",
      "subTitles": [
        "Under Microsoft Windows",
        "Under Linux",
        "General installation notes",
        "MIL Control Center",
        "MILConfig utility",
        "Automatic updates",
        "Matrox Intellicam"
      ],
      "location": "MIL UG P02: MIL in a nutshell",
      "pageURL": "content\\UserGuide\\introduction\\Installation.htm",
      "text": " Installation In addition to your MIL installation media, you will require a hardware license-key for development of applications. The key allows you to code, debug, and run your applications. MIL only supports hardware license-keys for USB ports. To redistribute your MIL applications, see the Distribution of MIL applications section of Chapter 68: Distribution and licensing. Under Microsoft Windows To install your MIL software under Microsoft Windows: Attach the development hardware license-key to the USB port of your computer. Place the installation media in an appropriate drive. Execute the MILxxSetup.exe program. Note that the Microsoft Windows automatic 8.3 file name creation option needs to be enabled for the MIL installer to access the temp folder when the user name contains a space. This option allows Windows to create short file/folder name aliases for ones with long names for programs, such as the MIL installer, that don't support spaces in the file/folder names. Alternatively, the MIL installer needs to run from a user account that belongs to the administrators group and has no spaces in it. The same applies for uninstalling MIL. During installation, you will be asked a number of questions. The type of questions include: Whether to install MIL optional components, such as MIL for .NET and Scripting, Distributed MIL, and Matrox Intellicam. The drive and directory on which to install MIL and the examples. The type of Matrox hardware drivers to install (for example, Matrox Radient eCL). Note that in some cases, Matrox hardware must be installed before you install its drivers. Whether you accept the licensing agreement. How Distributed MIL (if installed) will be launched: automatically at startup as a system service, automatically at startup as a user process, or manually by the user (using the MILConfig utility). The system type and Digitizer Configuration Format (DCF) to define your default configuration. Whether by default, displayed images should be shown in a window on the Microsoft Windows desktop or without a window on a dedicated screen. If the answer is the latter, you will be asked for the Video Configuration Format (VCF) to use by default. The amount of linear non-paged memory to reserve for MIL grab buffers. Whether to enable MIL auto-updates. Note that building the MIL examples using Visual Studio 2015 or 2017 also requires the presence of Windows SDK version 8.1, which is installed from the Visual Studio setup. Under Linux To install your MIL software under Linux: Ensure that the following development tools have been installed. See the MILLinux release notes for the complete list of required packages. GCC (GNU compiler collection) and G++. LSB (Linux standard base support). gtk2-devel (optional, needed for the mdispgtk and mdispwindowgtk examples). qt4-devel (optional, needed for the mdispqt and mdispwindowqt examples). Attach the development hardware license-key to the USB port of your computer. Place the installation media in an appropriate drive. Execute one of the following commands as the root user or using the sudo command. To install the full version of MIL, execute: # sh ./mil-10_XXXX-installer.run Whereas, to install MIL-Lite, execute: # sh ./mil-lite-10_XXXX-installer.run Replace XXXX with the MIL build number. During installation, a new group named mil is added to the /etc/group file, and you will be prompted to add at least one valid user to this group. Any user in this group can change the MIL configuration using the MILConfig utility, modify examples, recompile MIL drivers, and manage the Distributed MIL services. Note that you don't need to add the root user to the mil group. During installation, MIL drivers will be compiled to match the version of the running kernel. After installation, any user in the mil group can recompile the drivers by accessing the Driver Status page of the MILConfig utility, and then clicking on the Compile Drivers button. During installation, you will be asked a number of questions. The type of questions include: Whether you accept the licensing agreement. The type of Matrox hardware drivers to install (for example, Matrox Solios). The system type and Digitizer Configuration Format (DCF) to define your default configuration. Whether by default, displayed images should be displayed in a window on the desktop or without a window on a dedicated screen. If the answer is the latter, you will be asked for the Video Configuration Format (VCF) to use by default. The amount of linear non-paged memory to reserve for MIL grab buffers. The users to add to the mil group. Whether to restart your computer after installation. To uninstall MIL completely, type the following command as the root user or using the sudo command. # mil-uninstall General installation notes When installing MIL or MIL-Lite on a computer with an older version already installed, the setup program will not install MIL. The older version must be uninstalled before the setup program can install MIL. Note that the installation program also installs Matrox Intellicam (your frame grabber configuration program, not supported under Linux), MIL Control Center, Example Launcher, MIL interactive utilities (not supported under Linux), the MILConfig utility, and MIL CoPilot (not supported under Linux). After installation, read the MIL Release Notes for last minute information. MIL can be run without the hardware license-key if you activate a MIL provisional license. Once activated, the provisional license allows use of MIL on your computer for 30 days. Each time you run MIL, a dialog box appears indicating the number of days until the evaluation license expires. Once this time period has elapsed, MIL will not run unless you purchase a permanent license. For more information on activating a MIL license, see the MIL and MIL-Lite licenses section of Chapter 68: Distribution and licensing. A MIL provisional license can only be installed once. Any attempt to tamper with your computer's calendar, before the date of expiry, will disable MIL. In that event, MIL can only be re-used once a permanent license is obtained. MIL Control Center The MIL Control Center is an application that allows you to easily access files and applications that were installed along with MIL. Important utilities (such as Example Launcher, the MILConfig utility, Matrox Profiler, and Matrox Intellicam), interactive utilities related to the processing and analysis modules (such as Code Reader and Edge Finder), and files to help you develop with MIL (such as examples, images, predefined contexts, and the MIL Help files), can be launched through links in the MIL Control Center. The MIL Control Center also allows you to launch MIL CoPilot, which is an interactive environment for experimentation, prototyping, and code generation. MILConfig utility The MILConfig utility (MILConfig.exe), launched through the MIL Control Center, provides licensing, MIL reserved non-paged memory configuration, and system information tools. For example, if you need to change the amount of MIL reserved non-paged memory, you can do so at any time using the MILConfig utility. For more information on memory management options, see the Advanced memory management section of Chapter 23: Data buffers. Should you require technical support, use the MILConfig utility's Troubleshooting page to generate a text file that contains all the necessary system information required for basic troubleshooting; this file can then be forwarded to your Matrox technical support representative. For more information on the text file that the MILConfig utility generates, see the Interactive log subsection of the Matrox Profiler and trace logs section of Chapter 64: Development and debugging tools and techniques. Automatic updates The MILConfig utility has automatic update settings which allow you to automatically receive notice when a new version of MIL is available to download from the internet. A valid Matrox maintenance plan is required to download the new version of MIL. If automatic-updates are enabled during installation, the MILConfig utility will request your registration and web proxy information when you first open the MILConfig utility. If your network uses a proxy server, it must be configured to allow usage of the network protocols used to download MIL updates. Retrieving the list of available MIL updates requires HTTP, and downloading an update requires FTP. You can test whether your computer is able to download MIL updates using the Connection Test page in the MILConfig utility. Matrox Intellicam Matrox Intellicam provides fast camera interfacing and interactive access to all the grab features and functionalities of your Matrox frame grabber and GenICam SFNC-compliant cameras. It is included with MIL/MIL-Lite. It is automatically installed when installing MIL/MIL-Lite. You can also install Matrox Intellicam as a stand-alone product. The computer and operating system requirements for Matrox Intellicam are the same as MIL/MIL-Lite. A MIL or MIL-Lite license is required to use Matrox Intellicam. Matrox Intellicam allows you to grab with various camera types and see the results immediately. You can also use Matrox Intellicam to create and/or modify digitizer configuration format (DCF) files for use with Matrox frame grabbers that support non-standard acquisition. These files can then be used to interface with any camera supported by your frame grabber. Matrox Intellicam has an interactive tool called Feature Browser. This tool allows you to dynamically configure camera, system, and digitizer settings. It is useful if you want to experiment with different control values interactively and verify the results in real-time without having to re-compile your application program. In addition, the Matrox Feature Browser provides code snippets with the MIL functions and MIL constants associated with your selected settings; you can copy and paste these snippets into your MIL application's code. Installation Under Microsoft Windows Under Linux General installation notes MIL Control Center MILConfig utility Automatic updates Matrox Intellicam ",
      "wordCount": 1573,
      "subEntries": []
    },
    {
      "id": "UG_introduction_Testing_the_installation",
      "version": null,
      "title": "Testing the installation",
      "subTitles": [
        "Communicating properly"
      ],
      "location": "MIL UG P02: MIL in a nutshell",
      "pageURL": "content\\UserGuide\\introduction\\Testing_the_installation.htm",
      "text": " Testing the installation After completing the installation procedure, you should test the installation process by running a MIL example. Open the Example Launcher utility from the MIL Control Center, and launch the test program MappStart. This test program allocates a MIL application, opens communication with the default target system, displays a welcoming message, pauses, and frees the system resources. You can verify and edit the code that is executed by clicking on the Edit button in Example Launcher. mappstart.cpp Communicating properly During application development, you can use MappStart to ensure that the software is communicating properly with the target system. To make sure your frame grabber is working properly with your camera, use Matrox Intellicam or run a grab example. Testing the installation Communicating properly ",
      "wordCount": 127,
      "subEntries": []
    },
    {
      "id": "UG_introduction_Compiling_and_linking",
      "version": null,
      "title": "Compiling and linking",
      "subTitles": [
        "Compiler warnings for deprecated constants and functions"
      ],
      "location": "MIL UG P02: MIL in a nutshell",
      "pageURL": "content\\UserGuide\\introduction\\Compiling_and_linking.htm",
      "text": " Compiling and linking To compile a MIL application program, you must include the mil.h header file, in addition to the required standard C include files. After you have compiled your application program, you will have to link it with the appropriate libraries or import libraries for your operating system, compiler, and target board. The MIL LIB files (library files) are located in the Matrox Imaging\\Mil\\lib directory. If you are working with .NET, you must first reference Matrox.MatroxImaginglibrary.dll and then include the library in your code. See the Building a .NET application using MIL section of Chapter 60: Using MIL with .NET for more information. Note that MIL functions run at a slower speed during debug mode. Therefore, once you are done debugging your application, you should compile in release mode to achieve maximum processing speed. The following is a list of MIL and MIL-Lite files for the Microsoft Windows operating system, which can be included in your program. Note that you must include mil.lib to compile your application program. Microsoft Windows library files Description mil.lib Core library. milcom.lib Industrial Communication module library. milfpga.lib FPGA module library. milim.lib Image Processing module library (only some functionality is supported in MIL-Lite). mil3d.lib Core 3D library. The following is a list of MIL files for the Microsoft Windows operating system, which can be included in your program. Note that you must include mil.lib to compile your application program. Microsoft Windows library files Description mil.lib Core library. milagm.lib Advanced Geometric Matcher module library. milbead.lib Bead module library. milblob.lib Blob Analysis module library. milcal.lib Camera Calibration module library. milclass.lib Classification module library. milcode.lib Code module library. milcolor.lib Color Analysis module library. mildlocr.lib Deep Learning OCR module library. mildmr.lib SureDotOCR module library. miledge.lib Edge Finder and Analysis module library. milim.lib Image Processing module library. milmeas.lib Measurement module library. milmetrol.lib Metrology module library. milmod.lib Geometric Model Finder module library. milocr.lib Character Recognition module library. milpat.lib NGC Pattern Matching module library. milreg.lib Registration module library. milstr.lib String Reader module library. mil3dblob.lib 3D Blob analysis module library. mil3dim.lib 3D image processing module library. mil3dmap.lib 3D Reconstruction module library. mil3dmeas.lib 3D Measurement module library. mil3dmet.lib 3D Metrology module library. mil3dmod.lib 3D Model Finder module library. mil3dreg.lib 3D Registration module library. The following is a list of MIL and MIL-Lite files for the Linux operating system, which can be included in your program. Note that you must include libmil.so to compile your application program. Linux library files Description libmil.so Core library. libmilcom.so Industrial Communication module library. libmilfpga.so FPGA module library. libmilim.so Image Processing module library (only some functionality is supported in MIL-Lite). libmil3d.so Core 3D library. The following is a list of MIL files for the Linux operating system, which can be included in your program. Note that you must include libmil.so to compile your application program. Linux library files Description libmil.so Core library. libmilagm.so Advanced Geometric Matcher module library. libmilbead.so Bead module library. libmilblob.so Blob Analysis module library. libmilcal.so Camera Calibration module library. libmilclass.so Classification module library. libmilcode.so Code module library. libmilcolor.so Color Analysis module library. libmildlocr.so Deep Learning OCR module library. libmildmr.so SureDotOCR module library. libmiledge.so Edge Finder and Analysis module library. libmilim.so Image Processing module library. libmilmeas.so Measurement module library. libmilmetrol.so Metrology module library. libmilmod.so Geometric Model Finder module library. libmilocr.so Character Recognition module library. libmilpat.so NGC Pattern Matching module library. libmilreg.so Registration module library. libmilstr.so String Reader module library. libmil3dblob.so 3D Blob analysis module library. libmil3dim.so 3D image processing module library. libmil3dmap.so 3D Reconstruction module library. libmil3dmeas.so 3D Measurement module library. libmil3dmet.so 3D Metrology module library. libmil3dmod.so 3D Model Finder module library. libmil3dreg.so 3D Registration module library. Under Windows, you will generally not need to recompile your MIL applications after installing a new release, or update to, MIL X. Consult the whatsnew release notes to check for any exceptions to this general rule. Under Linux, you must always recompile your application after installing a new release of MIL X. Compiler warnings for deprecated constants and functions If you recompile a MIL application that uses deprecated constants and functions, compiler warnings will typically be generated. Deprecated constants and functions should no longer be used since they could be removed in a future release, or update to, MIL. All code that produces warnings about deprecated features should be updated to the code's current equivalent. For information on what has been deprecated, see the MIL release notes. Deprecated constants typically require that you replace them with the current equivalent constant. For example, M_SETUP is a deprecated constant for MappAllocDefault() and is equivalent to the current M_DEFAULT constant; so all cases of MappAllocDefault() with M_SETUP must be replaced with MappAllocDefault() with M_DEFAULT. You can establish what the equivalent for a deprecated constant is by searching for it in the mil.h file or by referring to the MIL release notes. Deprecated functions require that you replace them with either an equivalent function or a combination of an equivalent function with a specific constant. For example, MbufControlRegion() should be replaced with MbufControlArea(), while MdigLut() should be replaced with MdigControl() with M_LUT_ID. You can verify what the equivalent for a deprecated function is by referring to the MIL release notes. When building an application in C/C++, you can disable warnings about deprecated features using the M_MIL_WARN_ON_DEPRECATED extension. To disable warnings, include the following statement before the #include &lt;mil.h&gt; statement in your application's code: #define M_MIL_WARN_ON_DEPRECATED 0 Note, however, that code with deprecated features might not compile with a future release, or update to, MIL if you disable warnings and do not replace the code with the current equivalent. When building an application in the .NET environment, the process to disable compiler warnings is different and not specific to MIL. For more information, see the Disabling compiler warnings in .NET subsection of the Building a .NET application using MIL section of Chapter 60: Using MIL with .NET. Compiling and linking Compiler warnings for deprecated constants and functions ",
      "wordCount": 983,
      "subEntries": []
    },
    {
      "id": "UG_introduction_MIL_user_guide",
      "version": null,
      "title": "MIL User Guide and examples",
      "subTitles": [
        "Examples",
        "Vision Academy"
      ],
      "location": "MIL UG P02: MIL in a nutshell",
      "pageURL": "content\\UserGuide\\introduction\\MIL_user_guide.htm",
      "text": " MIL User Guide and examples This user guide has been structured to allow you to start processing your images with as little information overload as possible. After testing the installation, as well as verifying that the required MIL header file and libraries are installed, it is expected that you read Part 2: MIL in a nutshell. Part 3: 2D processing and analysis and Part 5: 3D processing and analysis, deal with enhancement, transformation and analysis operations. It is expected that you read only the chapters that you need; for the chapters on image processing, you can read only the required sections. Part 4: 2D related information and Part 6: 3D related information go into more detail about setting up and managing your images, displays and digitizers, as well as describing other topics that might be useful but not critical to getting started. Besides Chapters 1 and 2, this user guide has been written for using MIL under Microsoft Windows 10. Using MIL under Linux is very similar; refer to Chapter 61: Using MIL under Linux for a list of the differences. In general, Host refers to the CPU in one's computer, while system refers to a set of hardware components capable of grabbing, storing, processing, and/or displaying images. Descriptions of the individual functions are found in the MIL Reference. Examples Throughout this manual, examples have been provided to simplify concepts and get you started quickly. The source listing of most examples can be found on disk in the Matrox Imaging\\Mil\\Examples directory. To run and edit these examples, you can use Example Launcher, ExampleLauncher.exe, located in the \\Matrox Imaging\\Tools directory. Note that some examples will display images in grayscale even if the images are grabbed with a color camera. This is due to the fact that those examples perform statistical and/or analysis operations that do not support color processing. MIL's examples offer many advantages: The MappStart example is very simple, but it allows you to quickly test MIL's installation and become familiar with the basics behind running a MIL application. The MappStart example allocates an application, opens communication with the default system, displays a welcoming message, pauses, and then closes communication with the system. MappStart also demonstrates error handling capabilities. The examples use your default settings which have been specified at installation; therefore, very little time must be spent configuring your programming environment. However, if at some point you want to change the default settings, or are experiencing problems running the examples, your default settings can be changed on the Default Values tab of the MILConfig utility, (MILConfig.exe). This utility is located in the \\Matrox Imaging\\Tools directory. You can also change the default settings by clicking on the Change Defaults button in Example Launcher, which will take you directly to the Default Values tab of the MILConfig utility. Note that some systems cannot run some of the examples because they do not have the hardware capability or enough memory. You should skip these examples or modify them. Vision Academy Zebra provides the Zebra Vision Academy online training resource to help customers visualize the steps involved in using Aurora Imaging Library (formerly Matrox Imaging Library). This video-based training is an on-demand resource that delivers a multitude of categorized instructional videos on how to use the software to create vision applications. Access to the convenient and comprehensive on-demand video training resource is available to registered customers at Zebra Vision Academy. Note that training on how to use various hardware products is also available through Zebra Vision Academy. MIL User Guide and examples Examples Vision Academy ",
      "wordCount": 594,
      "subEntries": []
    },
    {
      "id": "UG_introduction_MIL_updates",
      "version": null,
      "title": "MIL updates",
      "subTitles": null,
      "location": "MIL UG P02: MIL in a nutshell",
      "pageURL": "content\\UserGuide\\introduction\\MIL_updates.htm",
      "text": " MIL updates MIL updates are periodically available for download through the Updates item found in the MILConfig utility. MIL updates include new features and bug fixes, as a Service Pack, a new version of previously released MIL system software (driver), or a driver for a new MIL system. When you download and install a new Service Pack, all Help files are updated to reflect the latest changes for the release. In addition, the whatsnew and lastminute release note files (among other release note files) are updated. If you need access to deprecated information, from previous versions of the MIL Help, refer to the appropriate Help file on the Matrox Imaging website. Typically, the documentation for non-Service Pack MIL updates will include, at a minimum, a release note, available in the MIL Release Notes part of this Help file. These updates can also include examples or hardware-specific chapters. Some non-Service Pack MIL updates are officially documented in the MIL Reference. In these cases, if the update is specific to a MIL system, it will be represented by one of the system-specific columns. For more information on MIL systems and how MIL system-specific information is documented, see the MIL system-specific information section of Chapter 0: About MIL Help. Note, a non-Service Pack MIL update that is officially documented in the MIL Reference might not update all Help files or reference pages. A non-Service Pack MIL update might modify common MIL components that add support for settings on a MIL system that is not the target of the update. System-specific columns for officially documented MIL systems that are not the target of the update will indicate support for the setting, but won't indicate the update number that added the support (for example, the column might report MIL 10; however, an update adding support for the setting is required in addition to MIL 10). If currently not available on your computer, you can install the next re-release of MIL (a release that incorporates all updates since the previous release) for the functionality. MIL updates ",
      "wordCount": 342,
      "subEntries": []
    }
  ]
}]