[{
  "id": "UG_licensing",
  "version": "2024020714",
  "title": "Distribution and licensing",
  "subTitles": null,
  "location": "MIL UG P11: Miscellaneous",
  "pageURL": "content\\UserGuide\\licensing\\ChapterInformation.htm",
  "text": " Chapter 68: Distribution and licensing This chapter presents how to distribute MIL or MIL-Lite and license MIL applications. Distribution of MIL applications Redistributing MIL or MIL-Lite DLL files and device drivers with your application Redistributing directly from the MIL or MIL-Lite installation media Redistributing using your own setup program Determining the required license for your application Interactive redistribution using your custom installation media Using the default MIL redistribution media Building a MIL redistribution with limited content Silent redistribution Redistributing MIL updates and service packs Uninstalling MIL and MIL-Lite licenses MIL provisional licenses MIL evaluation license MIL temporary license MIL permanent licenses MIL development license MIL runtime license Summary of activation procedures for all MIL licenses MIL-Lite licenses MIL-Lite development license MIL-Lite supplemental license Summary of MIL and MIL-Lite licenses Dongles for activating runtime and development licenses Software license-key for activating runtime license Hiding the MIL licensing process Generating the lock code Getting a software license-key Entering the software license-key Protecting your own MIL software application using a Matrox hardware fingerprint ",
  "wordCount": 172,
  "subEntries": [
    {
      "id": "UG_licensing_Distribution_of_MIL_applications",
      "version": null,
      "title": "Distribution of MIL applications",
      "subTitles": null,
      "location": "MIL UG P11: Miscellaneous",
      "pageURL": "content\\UserGuide\\licensing\\Distribution_of_MIL_applications.htm",
      "text": " Distribution of MIL applications There are some details that you must consider before you can distribute a MIL or MIL-Lite application, either for your customers' use or for your own. When doing this distribution, you must redistribute MIL/MIL-Lite DLLs and device drivers. In addition, when using a MIL processing module, you must purchase an appropriate runtime license; otherwise, your MIL application will not function correctly. MIL does not automatically install a license. The user must install the license, whether it is a provisional, development, or runtime license. This chapter deals with the different ways to distribute your application, obtain a license, and handle licensing for your customers. Note that MIL-Lite applications will work if a Matrox Imaging board or a supplemental license is present. A MIL installation without any license will work as a MIL-Lite runtime installation if a Matrox Imaging board is present. Distribution of MIL applications ",
      "wordCount": 150,
      "subEntries": []
    },
    {
      "id": "UG_licensing_Redistributing_MIL_or_MILLite_DLL_files_and_device_drivers_with_your_application",
      "version": null,
      "title": "Redistributing MIL or MIL-Lite DLL files and device drivers with your application",
      "subTitles": [
        "Redistributing directly from the MIL or MIL-Lite installation media",
        "Redistributing using your own setup program",
        "Determining the required license for your application"
      ],
      "location": "MIL UG P11: Miscellaneous",
      "pageURL": "content\\UserGuide\\licensing\\Redistributing_MIL_or_MILLite_DLL_files_and_device_drivers_with_your_application.htm",
      "text": " Redistributing MIL or MIL-Lite DLL files and device drivers with your application To distribute your MIL or MIL-Lite application, you will have to redistribute the MIL or MIL-Lite DLL files and the necessary device drivers with your application. When installing your application on a computer with the same required version of MIL or MIL-Lite DLL files and the necessary device drivers already installed, your application's setup program must not reinstall MIL or MIL-Lite. Your application should use the version of MIL or MIL-Lite already installed on the computer. Conversely, if the version of the MIL or MIL-Lite files on the computer is different from your application's required version, you must reinstall the MIL or MIL-Lite DLL files and device drivers with the version your application requires. Note that your MIL development computer should not have Matrox Design Assistant installed if you intend on redistributing a MIL-only application; this will cause your redistributed MIL application to have a different update version than your MIL development computer. Redistributing directly from the MIL or MIL-Lite installation media If the target computer (on which you want to install the MIL or MIL-Lite DLLs and device drivers) is immediately accessible, you can install the DLLs directly from the MIL or MIL-Lite installation media. To do so, run the MIL or MIL-Lite setup program and uncheck the \"MIL Development\" option. Redistributing using your own setup program To redistribute the MIL or MIL-Lite DLLs and device drivers when using your own setup program, you can have your application's setup program call MIL or MIL-Lite's redistribution setup program in one of two ways: Interactive redistribution. Prompts your customer for setup information. Silent redistribution. Uses a custom response file, instead of prompting your customer for information. Determining the required license for your application The successful distribution of a MIL application requires the appropriate runtime license for the various modules used within the application. Under Windows, you can use the Matrox Profiler utility to determine the MIL license that your application requires for the MIL package(s) used. The following steps outline how to establish the required MIL license: Make sure that you have an active MIL development license, or a MIL provisional license (that is, evaluation or temporary license). Start an interactive trace using Matrox Profiler. To create a new trace log in Matrox Profiler, choose Generate New Trace from the File menu. For more information concerning generating trace logs in Matrox Profiler, see the Matrox Profiler and trace logs section of Chapter 64: Development and debugging tools and techniques. Run your application, making sure to execute all aspects of your application that use MIL. This needs to include supported MIL system selections (for example, processing using a GigE Vision, and/or USB3 Vision-based image acquisition), MIL compression and decompression operations, and Distributed MIL calls. Terminate the application properly (that is, the MappFree() or MappFreeDefault() function must execute without errors). In Matrox Profiler, choose Show Trace Information from the View menu. In the above-mentioned window (Show Trace Information), you should see the output of the trace-log, along with a list of the MIL package(s) that were used during the execution of the application. These are the MIL package(s) that your MIL license must grant access to successfully run your application in its entirety. The previous steps are only applicable for applications traced under Windows. To determine the required MIL package(s) that must be licensed for applications running under Linux, you can either generate a trace-log to file and examine it in Matrox Profiler (in a Windows environment) using the above-mentioned steps, or use the following command in Gencode before starting your application. gencode /m Once your application has finished its execution, you must stop Gencode's monitoring process by pressing the Enter key. Gencode will then list the MIL package(s) used by your application. These are the MIL package(s) that your MIL license must grant access to successfully run your application in its entirety. Redistributing MIL or MIL-Lite DLL files and device drivers with your application Redistributing directly from the MIL or MIL-Lite installation media Redistributing using your own setup program Determining the required license for your application ",
      "wordCount": 688,
      "subEntries": []
    },
    {
      "id": "UG_licensing_Interactive_redistribution",
      "version": null,
      "title": "Interactive redistribution using your custom installation media",
      "subTitles": [
        "Using the default MIL redistribution media",
        "Building a MIL redistribution with limited content"
      ],
      "location": "MIL UG P11: Miscellaneous",
      "pageURL": "content\\UserGuide\\licensing\\Interactive_redistribution.htm",
      "text": " Interactive redistribution using your custom installation media To redistribute the MIL or MIL-Lite DLLs and device drivers, you can have your application's setup program call MIL or MIL-Lite's redistribution setup program using the interactive redistribution mechanism. In this case, your customer will be prompted for information during the setup. There are two ways to implement this mechanism. Using the default MIL redistribution media To redistribute the DLLs and device drivers and use the default installation options, do as follows: Copy the contents of the MIL or MIL-Lite installation media to your installation directory. Have your installation program call the MIL setup executable file, located in your installation directory. The setup program will prompt your customer to choose which features to install. Your customer should only select the MIL runtime option. The MIL runtime option installs the required MIL or MIL-Lite DLL files and device drivers on your client's computer. Building a MIL redistribution with limited content To limit the MIL or MIL-Lite installation content to include in your installation directory and restrict the installation options, use the Redist.exe program. To use this program, perform the following: Launch the Redist.exe program located in the Redist directory of your MIL or MIL-Lite installation media. The Matrox Imaging Library Redistribution dialog box is presented. Specify the location of the original setup executable file used to install MIL. To do so, click on the Browse button next to the Original MILxxSetup.exe file edit field. From the presented Open dialog box, select the MILxxSetup.exe file located in the root of your MIL or MIL-Lite installation media, and then click on the Open button. Specify the location of the directory in which to output the generated installation. To do so, click on the Browse button next to the Output Directory edit field. From the presented Browse For Folder dialog box, select your output directory, and then click on the OK button. Select the packages (for example, DMIL and/or Intellicam), the MIL systems, and other services (for example, Memory and PCI services) that you want to make available to your customer during installation. Select the options that best fit your situation. Click on the Generate Installation button to begin creating the disk image of the limited installation version of MIL or MIL-Lite into your output directory. Have your installation program call the MILxxSetup.exe file located in the root of the disk image generated with Redist.exe. The MILxxSetup.exe program will prompt your customer to choose which features to install from the features that you have made available. Interactive redistribution using your custom installation media Using the default MIL redistribution media Building a MIL redistribution with limited content ",
      "wordCount": 441,
      "subEntries": []
    },
    {
      "id": "UG_licensing_Silent_redistribution",
      "version": null,
      "title": "Silent redistribution",
      "subTitles": null,
      "location": "MIL UG P11: Miscellaneous",
      "pageURL": "content\\UserGuide\\licensing\\Silent_redistribution.htm",
      "text": " Silent redistribution A silent redistribution does not prompt your user for any MIL or MIL-Lite information; instead, it uses a response file to provide the necessary setup parameters for the intended computer. You would use a silent redistribution when you are including MIL or MIL-Lite within your application and you do not want to have any Matrox Imaging setup dialog boxes appear. You could also use a silent redistribution if you wanted to control the setup parameters for your client. It is not possible to create a response file for only some of the setup parameters and ask the customer for the rest of the setup information. If you are going to use a response file, you must answer all of the setup questions in the response file. To redistribute the MIL or MIL-Lite DLLs and device drivers using a silent redistribution: Copy the contents of the MIL or MIL-Lite installation media to your installation directory. Alternatively, you can use the Redist.exe program to select the redistribution packages (MIL and/or Intellicam) and drivers to copy in your installation directory. For more details on how to use this program, see the Interactive redistribution using your custom installation media section earlier in this chapter. Record your setup options. To do so, start the MILSetup.exe and follow the presented instructions for an interactive MIL or MIL-Lite redistribution. Any selected setting is recorded and stored in the milsetup.custom file. The milsetup.custom file will be created in the Matrox Imaging folder under (%ALLUSERSPROFILE%) and must be moved to the root folder of your installation directory next to MILSetup.exe. Have your redistribution program call the MILSetup.exe program with the /s switch. The setup will silently install MIL or MIL-Lite with the options that were selected during the recording phase and stored in the milsetup.custom file. You can also silently install MIL updates by having your redistribution program call the MIL update MILSetup.exe program with the /s switch. Silent redistribution ",
      "wordCount": 325,
      "subEntries": []
    },
    {
      "id": "UG_licensing_Redistributing_MIL_updates",
      "version": null,
      "title": "Redistributing MIL updates and service packs",
      "subTitles": null,
      "location": "MIL UG P11: Miscellaneous",
      "pageURL": "content\\UserGuide\\licensing\\Redistributing_MIL_updates.htm",
      "text": " Redistributing MIL updates and service packs When redistributing applications that require functionality only available with a MIL or MIL-Lite update, you can redistribute MIL updates with your installation program. To redistribute a MIL update not related to a driver update (such as a Service Pack), create a folder called servicepack in the root of your installation directory (the directory that contains the files you copied from the MIL/MIL-Lite installation media and your application's files) and then copy the setup executable files of the updates into this folder. To redistribute a MIL driver update, create a folder called update in the Matrox Imaging\\Drivers\\DriverName directory, where DriverName is the name of the driver whose updates you need to redistribute, and copy the setup executable files for the updates into the update folder. When your installation program calls the setup executable file for MIL, the setup executable files for any updates will be launched automatically during the process. Be aware that update setups in either folder are executed in alphabetical order. Updates might need to be installed in a particular order if, for example, you are installing an update to a service pack. In this case, rename the executable file so that it is executed in the correct order. Redistributing MIL updates and service packs ",
      "wordCount": 214,
      "subEntries": []
    },
    {
      "id": "UG_licensing_Uninstalling",
      "version": null,
      "title": "Uninstalling",
      "subTitles": null,
      "location": "MIL UG P11: Miscellaneous",
      "pageURL": "content\\UserGuide\\licensing\\Uninstalling.htm",
      "text": " Uninstalling To uninstall MIL or MIL-Lite, and all other Matrox Imaging products, call the Matrox Imaging Products Uninstall program. To uninstall in silent mode, use the silent uninstall program, silentuninstall.exe, located in the directory \"MIL\" under the root directory of the installation media. For a silent uninstall, copy the following files from the installation media to a folder on the computer where MIL is installed (these files must be present in the same directory): SilentUninstall.exe. MILSetup.exe. uninstall.iss. Matrox Imaging.msi. ISSetup.dll. To uninstall MIL and MIL-Lite in silent mode, you must change the working directory to the location where you have copied the above files and then call: silentuninstall.exe To reboot the computer after uninstalling, call: silentuninstall.exe reboot Uninstalling ",
      "wordCount": 120,
      "subEntries": []
    },
    {
      "id": "UG_licensing_MIL_and_MILLite_licenses",
      "version": null,
      "title": "MIL and MIL-Lite licenses",
      "subTitles": [
        "MIL provisional licenses",
        "MIL evaluation license",
        "MIL temporary license",
        "MIL permanent licenses",
        "MIL development license",
        "MIL runtime license",
        "Summary of activation procedures for all MIL licenses",
        "MIL-Lite licenses",
        "MIL-Lite development license",
        "MIL-Lite supplemental license",
        "Summary of MIL and MIL-Lite licenses"
      ],
      "location": "MIL UG P11: Miscellaneous",
      "pageURL": "content\\UserGuide\\licensing\\MIL_and_MILLite_licenses.htm",
      "text": " MIL and MIL-Lite licenses MIL and MIL-Lite have different licensing models: MIL-Lite. With MIL-Lite, there is a permanent development license (for MIL-Lite functionality) provided with Matrox Imaging hardware or when a MIL-Lite supplemental license is present. MIL. With MIL, there are two types of permanent licenses: a development license and/or a runtime license. Licenses are always verified when a MIL application is allocated, as well as when the application is running; this verification introduces negligible performance overhead. You can use a MIL provisional license while waiting to obtain a permanent license. Users with MIL installed also have the ability to run (but not debug) MIL-Lite applications if Matrox boards are present. Refer to the respective Matrox software license agreement for the legal provisions of using/redistributing MIL or MIL-Lite. The rest of this chapter deals with MIL and MIL-Lite and its licensing mechanisms. MIL provisional licenses MIL provisional licenses permit you to temporarily use MIL either while waiting for a permanent license, or to evaluate whether to buy MIL. The following table outlines the types of MIL provisional licenses and their function and purpose: Name of license Function Purpose MIL evaluation license Permits you to run and debug MIL applications for 30 days. To try out MIL's features, and evaluate whether you want to purchase a MIL permanent license. MIL temporary license Permits you to run MIL applications for 30 days. To run MIL applications while waiting for a hardware or software license-key to activate a permanent runtime license. MIL evaluation license A MIL evaluation license is a 30-day development license. The evaluation license permits you to run and debug MIL applications. You should use a MIL evaluation license to try out MIL's features, and evaluate whether you want to purchase a permanent license. The evaluation license needs to be activated using a code obtained from the MIL product page on the Matrox Imaging website or from a local representative, and will be valid for 30 days from the date of issue. This code must be entered in the MILConfig utility application, in the Activate pane, accessible from the Licensing item. Attempting to alter the computer's calendar before the evaluation license expires will immediately disable MIL. In that event, MIL can only be re-used once an appropriate license is installed. MIL temporary license A MIL temporary license is a 30-day runtime license that permits you to run MIL applications. It does not allow for development (debugging) of MIL applications. You should use a MIL temporary license to run MIL applications while waiting for a MIL runtime dongle or a software license-key to activate a permanent runtime license. The temporary license is only available on certain Matrox imaging hardware. The license is activated from the MILConfig utility application, in the Temporary License pane, accessible from the Licensing item. The license is valid for 30 days from the moment the license is activated with the MILConfig utility. Once the temporary license has expired, it is not possible to prolong or restart it. Attempting to alter the computer's calendar before the temporary license expires will immediately disable MIL. In that event, MIL can only be re-used once an appropriate license is installed. MIL permanent licenses MIL permanent licenses permit you to use MIL in perpetuity (that is, for an indefinite period of time). The following table outlines the types of MIL permanent licenses and their function and purpose: Name of License Function MIL development license Allows you to develop, debug, and run MIL applications. MIL runtime license Allows you to run MIL applications. MIL development license A MIL development license permits you to develop, debug, and run MIL applications. To activate the license, a MIL development dongle (hardware license-key) must be attached to your computer's USB port. A MIL development dongle is included with the MIL development package. MIL runtime license A MIL runtime license is required for each computer that will run a MIL application. It does not allow for development (debugging) of MIL applications. You can purchase a MIL runtime license according to the requirements of your application. A MIL runtime license grants access to specific modules/features, some of which are grouped together in packages. Consult the MIL datasheet or your local representative regarding the available runtime packages. A MIL runtime license can be activated using one of two methods: A MIL runtime dongle (hardware license-key). A software license-key. When using a software license-key, you can hide the MIL runtime licensing process from your customer using the Gencode command-line utility. For more information, see the Hiding the MIL licensing process section later in this chapter. Summary of activation procedures for all MIL licenses The following table outlines the activation procedures required for all MIL licenses on different operating systems: Type of MIL license Activation procedure For supported versions of Microsoft Windows or Linux For Microsoft Windows Embedded Compact 1 Evaluation license License is activated using the MILConfig utility, in the Activate pane, accessible from the Licensing item. License is activated using the Matrox smart camera portal website. Temporary license License is activated using the MILConfig utility, in the Temporary License pane, accessible from the Licensing item. License is activated using the Matrox smart camera portal website. Development license Requires a MIL development dongle (hardware license-key). Not applicable. 2 Runtime license Requires a MIL runtime dongle (hardware license-key) or software license-key. Requires a software license-key. 2 1 Windows Embedded Compact is supported only for Matrox smart cameras. 2 Under Windows Embedded Compact, there is only one type of permanent license: a runtime license. When you purchase this license, you receive both development and runtime privileges. To activate this license, you must have a software license-key. MIL-Lite licenses The following licenses will permit you to use MIL-Lite functionality on your computer. MIL-Lite development license MIL-Lite comes with a permanent development license (for MIL-Lite functionality) provided Matrox Imaging hardware or a MIL-Lite supplemental license is present. MIL-Lite supplemental license You can purchase MIL-Lite supplemental licenses according to the requirements of your application. A MIL-Lite supplemental license grants access to specific modules/features that are otherwise not accessible in MIL-Lite, some of which are grouped together in packages. A MIL-Lite supplemental license grants access to a MIL-Lite development license, if Matrox Imaging hardware is not present. Consult the MIL datasheet, your local representative, or Matrox Imaging sales regarding the available packages. The following MIL-Lite supplemental licenses are available: Distributed MIL. Compression/decompression. GigE Vision/USB3 Vision. A MIL-Lite supplemental license can be activated using one of two methods: A MIL-Lite supplemental license dongle (hardware license-key). A software license-key. When using a software license-key, you can hide the MIL-Lite supplemental licensing process from your customer using the Gencode command-line utility. For more information, see the Hiding the MIL licensing process section later in this chapter. Summary of MIL and MIL-Lite licenses The following table outlines the license requirements for different MIL and MIL-Lite activities: Activity Requirement Developing a MIL application MIL development license. MIL evaluation license. Running a MIL application MIL runtime license. MIL temporary license. Developing a MIL-Lite application MIL-Lite installed with any Matrox imaging board or a MIL-Lite supplemental license. Running a MIL-Lite application MIL-Lite installed with any Matrox imaging board or a MIL-Lite supplemental license. MIL installed with any Matrox imaging board. There are some considerations to take into account regarding licensing when running applications that use Distributed MIL (DMIL). For more information regarding licensing of a DMIL cluster, see the Licensing considerations subsection of the Preparing computers for Distributed MIL section of Chapter 62: Distributed MIL. If using a Matrox Supersight with multiple system host boards (SHBs), a license is shared across its SHBs. You can inquire which module have a valid license by using MappInquire() with M_LICENSE_MODULES. MIL and MIL-Lite licenses MIL provisional licenses MIL evaluation license MIL temporary license MIL permanent licenses MIL development license MIL runtime license Summary of activation procedures for all MIL licenses MIL-Lite licenses MIL-Lite development license MIL-Lite supplemental license Summary of MIL and MIL-Lite licenses ",
      "wordCount": 1328,
      "subEntries": []
    },
    {
      "id": "UG_licensing_Hardware_licensekey",
      "version": null,
      "title": "Dongles for activating runtime and development licenses",
      "subTitles": null,
      "location": "MIL UG P11: Miscellaneous",
      "pageURL": "content\\UserGuide\\licensing\\Hardware_licensekey.htm",
      "text": " Dongles for activating runtime and development licenses Dongles are used to activate MIL development and runtime licenses. To activate the license, the dongle must be attached to the USB port of your computer. If you decide that another computer needs to run a MIL application, you can transfer the dongle. This will allow the second computer to use MIL, but the first computer will have MIL disabled. To have MIL DLLs recognize the dongle, you must install the CodeMeter Runtime Kit software. To install this software, if you did not install it when you were installing MIL, run the CodemeterRuntime64.exe file, located in the \\Install\\CmStick directory of the MIL installation media, and follow the on-screen instructions. Note, the software is installed automatically whenever you install MIL, but might not be installed if MIL was redistributed to your computer using Redist.exe. Dongles for activating runtime and development licenses ",
      "wordCount": 149,
      "subEntries": []
    },
    {
      "id": "UG_licensing_Software_licensekey",
      "version": null,
      "title": "Software license-key for activating runtime license",
      "subTitles": null,
      "location": "MIL UG P11: Miscellaneous",
      "pageURL": "content\\UserGuide\\licensing\\Software_licensekey.htm",
      "text": " Software license-key for activating runtime license A software license-key is used to activate a MIL runtime license. The software license-key is derived from a lock code that is generated using the hardware fingerprint from one of several hardware components on the target computer. This lock code will then be used to obtain a software license-key and activate your MIL license. Note that the license is stored on the hardware component that you have chosen. If you install the hardware component on another computer, the license will be available on that computer. If you replace the hardware component with the fingerprint that you have chosen, you will need to obtain a new license. If your computer does not have any hardware component that can act as a fingerprint, you can purchase an ID dongle and use it as your hardware component instead. This gets attached to your computer's USB port, and it will allow you to generate a lock code that you can use to create a software license. You can activate a license using a software license-key as follows: Install MIL on your computer as described in the Installation section of Chapter 1: Introduction. Open the MILConfig utility from the MIL Control Center. Expand the Licensing item in the tree structure of the presented interface and then click on the Generate sub-item. In the pane to the right of the tree structure, select the type of MIL license to generate and any additional packages you want to license. Since the MIL Image Analysis package is included in the MIL Machine Vision package, these two packages are mutually exclusive. Select the hardware component from which to retrieve the fingerprint, from the License Fingerprint drop-down list box. After choosing the hardware component, click on the Generate button. This will generate a lock code. After generating a lock code, obtain a software license-key by contacting your local representative or using the Matrox licensing portal website. Activate the license by entering the software license-key in the Activate pane of the MILConfig utility, accessible from the Licensing item. Software license-key for activating runtime license ",
      "wordCount": 351,
      "subEntries": []
    },
    {
      "id": "UG_licensing_Hiding_the_MIL_licensing_process",
      "version": null,
      "title": "Hiding the MIL licensing process",
      "subTitles": [
        "Generating the lock code",
        "Getting a software license-key",
        "Entering the software license-key"
      ],
      "location": "MIL UG P11: Miscellaneous",
      "pageURL": "content\\UserGuide\\licensing\\Hiding_the_MIL_licensing_process.htm",
      "text": " Hiding the MIL licensing process It is possible to make the presence of MIL licensing hidden so that your customer can install your MIL application and not have to deal with the MIL licensing process. One way of hiding the MIL licensing process is to purchase and redistribute hardware license-keys. You will have to purchase a hardware license-key for each application that you are distributing. If purchasing and distributing hardware license-keys is not possible or preferable, there is a command-line utility, Gencode, that allows you to get a software license-key while hiding the MIL licensing process. Gencode is essentially the silent command-line version of the License item in the MILConfig utility. Gencode can generate the lock code needed to get a MIL software license-key, as well as register the license. For more detailed and up-to-date information on Gencode's parameters and functionality, refer to the Gencode help screen. You can access the help screen with the following command: gencode /h Gencode commands are case-sensitive. Generating the lock code There are many different ways of getting the information that the Gencode utility needs to generate a lock code. For example, you can create an interactive interface, or have a series of prompts during the setup of your application. If you know the hardware and the packages that your client will be using, you can build a batch file which calls Gencode with the predetermined information. For example, if you know that your client will be using a Matrox Solios board, you could hardcode Gencode's command-line parameter HardwareFingerprint to the constant that means Matrox Solios. To generate a lock code from a hardware fingerprint, the setup program of your application must internally call Gencode as follows: gencode /g Filename HardwareFingerprint Packages Replace the Filename parameter with the path and file name in which to store the lock code. Replace the HardwareFingerprint parameter with the fingerprint of the hardware component you will use to generate the lock code. Replace the Packages parameter with the value corresponding to packages you want to license. You can retrieve a list of available hardware, in your computer, that can be used as the fingerprint for the license, as well as their corresponding constant, using the following command: gencode /i You can retrieve a list of available hardware, in your computer, that can be used as the fingerprint for an upgradable license, as well as their corresponding constant, using the following command: gencode /u You can retrieve a list of possible packages, as well as the accepted values for each, using the following command: gencode /a Getting a software license-key Once the lock code is actually created, there are some steps that must be followed: Your customer must send you the lock code, by whichever means you designate. Take the lock code and obtain the software license-key by contacting your local representative or using the Matrox licensing portal website. Your customer must input the software license-key into whatever activation interface you have created. Entering the software license-key You can activate your customer's MIL license by entering the software license-key with the following command: gencode /r LicenseKey Replace the LicenseKey parameter with the software license-key that you obtained from your local representative or using the Matrox licensing portal website. Hiding the MIL licensing process Generating the lock code Getting a software license-key Entering the software license-key ",
      "wordCount": 558,
      "subEntries": []
    },
    {
      "id": "UG_licensing_Protecting_your_own_MIL_software_application_using_Matrox_hardware_fingerprint",
      "version": null,
      "title": "Protecting your own MIL software application using a Matrox hardware fingerprint",
      "subTitles": null,
      "location": "MIL UG P11: Miscellaneous",
      "pageURL": "content\\UserGuide\\licensing\\Protecting_your_own_MIL_software_application_using_Matrox_hardware_fingerprint.htm",
      "text": " Protecting your own MIL software application using a Matrox hardware fingerprint You might want to protect your own MIL software application using a third-party licensing package that requires a hardware fingerprint. In this case, you can use the hardware fingerprint of the Matrox Imaging board that your application uses. The MIL hardware fingerprint is a numerical value, unique to the Matrox hardware component. You can inquire about the fingerprint of your Matrox Imaging board using MappInquire() with M_..._FINGERPRINT. For example, to inquire the hardware fingerprint of your Matrox Rapixo CXP board, use M_RAPIXOCXP_FINGERPRINT. If the inquired Matrox hardware component is present and properly installed, the requested hardware fingerprint is returned. If it is not present or properly installed, 0 is returned. If using a MIL 10 runtime dongle, it is possible to store multiple licenses on the dongle using WIBU-Systems' CodeMeter API. You can therefore store your own MIL software application license and a MIL runtime license on a single dongle that you can provide to your client. Protecting your own MIL software application using a Matrox hardware fingerprint ",
      "wordCount": 181,
      "subEntries": []
    }
  ]
}]