[{
  "id": "UG_model-finder",
  "version": "2024020714",
  "title": "Geometric Model Finder",
  "subTitles": null,
  "location": "MIL UG P03: 2D processing and analysis",
  "pageURL": "content\\UserGuide\\model-finder\\ChapterInformation.htm",
  "text": " Chapter 8: Geometric Model Finder This chapter explains how to use the Geometric Model Finder module to locate occurrences of models in your target. Geometric Model Finder module Steps to performing a model search Basic concepts for the MIL Geometric Model Finder module Types of Model Finder contexts General geometric contexts Controlled geometric contexts Circle-shape contexts Ellipse-shape contexts Rectangle-shape contexts Segment-shape contexts Defining and adding models to your Model Finder context Image-type models Extracting edges Synthetic models Predefined-shape models Predefined-shape models in specialized contexts CAD-file models Model size, units, and camera calibration when dealing with synthetic model in a geometric or geometric-controlled context Model size, units, and camera calibration when dealing with synthetic model in a shape-specific context Models defined from result buffers Models defined from an Edge Finder result buffer Models defined from a Model Finder result buffer Models defined from two other models Preprocessing Model origin Model indices and labels Drawing and inquiring the model's active edges Guidelines for choosing models Make sure your images have enough contrast Avoid poor geometric models Be aware of ambiguous models Nearly ambiguous models Masking your model Search targets Finding models in an image Finding models in an Edge Finder result buffer Finding models in an M_SHAPE_SEGMENT Model Finder result buffer Determining what is a match Score, target score, and fit score Model and target coverage Fit error Interpreting results Position, angle, and scale Enabling calculations specific to searching within a range Search position and position range Angle and angular range Scale and scale range Customizing search settings Acceptance levels Certainty levels Expected number of occurrences Reference axis Reference axis origin Reference axis angle Forward and reverse transformation coefficients Search settings specific to models in specialized shape contexts Approximating the edges Radial deviation tolerance Aspect ratio and aspect ratio search constraint Deviation tolerance for rectangles and segments Angle for rectangles and segments Advanced search settings Polarity Separation Shared edges Fit error weighting factor Global context settings Setting the search speed Accuracy Timing out your search First and last levels Speeding up the search Adjust the search speed of the algorithm Disable calculations specific to range search strategies Define several models with different expected angles Limit the position range Limit the search scale Specify the exact number of expected occurrences Clean up your model and your target Change the search levels Use an appropriate context type for your search Retrieving and analyzing results Possible results Drawing results Camera calibration Requirements Models and their camera calibration context Setting the aspect ratio control Using transformation coefficients with calibrated images Geometric Model Finder example ",
  "wordCount": 430,
  "subEntries": [
    {
      "id": "UG_model-finder_Geometric_Model_Finder_module",
      "version": null,
      "title": "Geometric Model Finder module",
      "subTitles": null,
      "location": "MIL UG P03: 2D processing and analysis",
      "pageURL": "content\\UserGuide\\model-finder\\Geometric_Model_Finder_module.htm",
      "text": " Geometric Model Finder module The Geometric Model Finder module, also referred to as the Model Finder module, is a set of functions to find patterns, or models, based on geometric features. The module finds models using edge-based geometric features (geometric features from extracted edges) instead of a pixel-to-pixel correlation (which is used by the Pattern Matching (Mpat...()) module). As such, the Model Finder module offers several advantages over the Pattern Matching module. These advantages include a greater tolerance of lighting variations (including specular reflection), model occlusion, as well as variations in scale and angle. The Model Finder module allows you to tailor your search to fit the requirements of your application. You can search for any number of different models simultaneously, through a range of angles and scales. You can also search for different kinds of models with Model Finder including models created from images (image-type), models created from Edge Finder result buffers (Edge Finder-type), models created from Model Finder result buffers (Model Finder-type), models merged from two previous models (merge-type), and synthetic models. Synthetic models are either models that have a predefined shape, or models defined from CAD files. The module provides complete support for camera calibration. Searches can be performed in the calibrated real-world such that, without physically correcting your images, occurrences can be found even in the presence of complex distortions, and results calculated in real-world units. The module also allows you to restore a Model Finder context from a file or memory stream, or save a Model Finder context to a file or memory stream. Geometric Model Finder module ",
      "wordCount": 265,
      "subEntries": []
    },
    {
      "id": "UG_model-finder_Steps_to_performing_a_model_search",
      "version": null,
      "title": "Steps to performing a model search",
      "subTitles": null,
      "location": "MIL UG P03: 2D processing and analysis",
      "pageURL": "content\\UserGuide\\model-finder\\Steps_to_performing_a_model_search.htm",
      "text": " Steps to performing a model search The following steps provide a basic methodology for using the Geometric Model Finder module: Allocate your Model Finder context, using MmodAlloc(). Define and add your model(s) to this Model Finder context, using MmodDefine() or MmodDefineFromFile(). If necessary, mask any irrelevant, inconsistent, or featureless areas of your models, using MmodMask(). Specify your required search settings for both the context and the individual model(s), using successive calls to MmodControl(). Preprocess your Model Finder context, using MmodPreprocess(). Allocate a result buffer to hold the results of your search, using MmodAllocResult(). Search the target for occurrences of models in your Model Finder context, using MmodFind(). Retrieve the required results from the result buffer, using MmodGetResult(). If necessary, save your Model Finder context, using MmodSave() or MmodStream(). Free all your allocated objects using MmodFree(), unless M_UNIQUE_ID was specified during allocation. For information about using calibrated model source images and targets, see the Camera calibration section later in this chapter. Steps to performing a model search ",
      "wordCount": 168,
      "subEntries": []
    },
    {
      "id": "UG_model-finder_Basic_concepts",
      "version": null,
      "title": "Basic concepts for the MIL Geometric Model Finder module",
      "subTitles": null,
      "location": "MIL UG P03: 2D processing and analysis",
      "pageURL": "content\\UserGuide\\model-finder\\Basic_concepts.htm",
      "text": " Basic concepts for the MIL Geometric Model Finder module The basic concepts and vocabulary conventions for the MIL Geometric Model Finder module are: Active edges. Edges which are used to compose the geometric model without being masked out, and are searched for in the target. Bounding box of the edges. The smallest rectangle that fully encloses all of the edges of the model. Chain. The set of connected edgels that construct an edge. Edge. A curve that delineates a boundary, which can be established from intensity transitions in an image. In Model Finder, an edge is considered to be a chain, and its features. Edge feature. Information describing an edge, such as its length. Edge map. The edges extracted from the model image. Edgel. Elementary point (or edge element) within an edge. Model. The information that defines the pattern of active edges to find in the target and the search settings with which to do so. Model box. The box that delimits the boundaries of the model. Essentially, the model box is the bounding box of the edges plus a margin. For image-type and Edge Finder-type models, the size of the model box is specified when defining the model. For synthetic models, the margin can be adjusted after model definition. Model Finder context. A MIL object that stores all models for which to search. The Model Finder context also stores global search settings that apply to the search algorithm. Model image. For an image-type and Edge Finder-type model, the model image is a copy of the region in the model source image from which the model has been defined. Note that the model source image for an Edge Finder-type model is the image source of the result buffer. For a synthetic model, the model image is the image representation (edge map) of the model. Model mask. A binary image used to define irrelevant, inconsistent, or featureless areas in the model, so that only pertinent model details are used for the search. Model origin. The point in the model's coordinate system that is considered to be (0, 0). Model source. The immediate source of the model's edges. For example, for an Edge Finder-type model, the model source is the buffer of the Edge Finder results. Model source image. The image from which you have defined an image-type model, or from which you have extracted the edges for an Edge Finder-type model. Occurrence. An instance of the model found in the target. Score. A measure of the active edges in the model found in the occurrence, weighted by the deviation in position of these common edges. Synthetic models. Models that have a predefined shape, such as a circle or a square, or are defined from a CAD-type file. Target. The image or result buffer in which to search for occurrences of the model. Target score. A measure of edges found in the occurrence that are not present in the original model, weighted by the deviation in position of the common edges. Target edges. The edges in the target. Basic concepts for the MIL Geometric Model Finder module ",
      "wordCount": 517,
      "subEntries": []
    },
    {
      "id": "UG_model-finder_Types_of_Model_Finder_contexts",
      "version": null,
      "title": "Types of Model Finder contexts",
      "subTitles": [
        "General geometric contexts",
        "Controlled geometric contexts",
        "Circle-shape contexts",
        "Ellipse-shape contexts",
        "Rectangle-shape contexts",
        "Segment-shape contexts"
      ],
      "location": "MIL UG P03: 2D processing and analysis",
      "pageURL": "content\\UserGuide\\model-finder\\Types_of_Model_Finder_contexts.htm",
      "text": " Types of Model Finder contexts Using MmodAlloc(), you can allocate one of six types of Model Finder contexts: one that uses a general geometric search algorithm (M_GEOMETRIC), one that uses a controlled geometric search algorithm (M_GEOMETRIC_CONTROLLED), one that uses a circular shape (with deformation tolerance) matching algorithm (M_SHAPE_CIRCLE), one that uses an elliptical shape (with deformation tolerance) matching algorithm (M_SHAPE_ELLIPSE), one that uses a rectangular shape (with deformation tolerance) matching algorithm (M_SHAPE_RECTANGLE, or one that uses a segment (with deformation tolerance) matching algorithm (M_SHAPE_SEGMENT). All six algorithms use edge-based geometric features of the models and the target to establish a match. All M_SHAPE_... controlled objects can be searched for at an angle. This can be done by setting the angle using MmodControl() with M_ANGLE_REGION. Note, rotated rectangular search regions can be set using MmodControl() with M_SEARCH_POSITION_FROM_GRAPHIC_LIST or from a target image buffer associated with a rectangular M_VECTOR region of interest set with MbufSetRegion(). General geometric contexts General geometric Model Finder contexts use a general geometric search algorithm to locate user-specified models. General geometric contexts handle a full range of scale and angles unlike a controlled geometric context. Controlled geometric contexts Controlled geometric Model Finder contexts use a controlled geometric search algorithm to locate user-specified models. Using a controlled geometric context is recommended in situations where the image has high geometric complexity and where there are only small differences in scale between the occurrence and the nominal scale of the model (M_SCALE). In such a situation, a controlled geometric search is often faster and more robust than the general geometric search. The search method is especially fast when the angle between the occurrence and the nominal angle of the model (M_ANGLE) is small. Model searches use a hierarchical method to reduce the time needed to complete the search. Note that this might cause very thin lines to be missed as candidates. The speed of the search with a controlled geometric Model Finder context also depends on the angle range of the search. The search is faster when using a smaller angle range. There are restrictions on when you can use a controlled geometric context. Scale range searches are disabled when you use this context. As well, if you are retrieving a result relating to the entire context, you cannot get or draw the edges for the entire target; you can only get or draw the target edges in the region of an occurrence. Circle-shape contexts Circular-shape Model Finder contexts use a specialized algorithm to locate instances of circular shapes. This context has a tolerance for deformation of the shape being sought; therefore, it is not only applicable to circles but circular type shapes in general. This could include elliptical shapes and circular shapes with noisy contours. This context type is recommended when your target contains one or more circular shapes that must be found and other context types would either take too long to find the occurrences, or would not reliably find all occurrences of the circular shapes. Unlike the geometric and controlled geometric types of Model Finder contexts, you can only add one model to the context and it must be a synthetic model of type M_CIRCLE. There are further restrictions to an M_SHAPE_CIRCLE type of Model Finder context other than one model per context. For instance, you cannot add a mask (using MmodMask()) to a model in an M_SHAPE_CIRCLE type of Model Finder context. Any constants that are not supported for an M_SHAPE_CIRCLE type of Model Finder context are identified as such within their description. Ellipse-shape contexts Elliptical-shape Model Finder contexts use a specialized algorithm to locate instances of elliptical shapes. This context searches for occurrences of elliptical shapes based on their aspect ratio relative to that of the defined model. This strategy searches for a range of aspect ratios around a nominal aspect ratio. You can use MmodControl() with M_ELLIPSE_TOLERANCE_TO_CIRCLE to set how close an ellipse's aspect ratio must be to that of a circle's for it to be approximated as a circle. It also makes use of the deformation tolerance described for M_SHAPE_CIRCLE types of Model Finder context, such that ellipses that are not perfectly conic would still be identified as potential occurrences. This context type is recommended when your target contains one or more elliptical shapes that must be found and other context types would either take too long to find the occurrences, are not suited for the shape being sought, or would not reliably find all occurrences of the elliptical shapes. Like the M_SHAPE_CIRCLE type of Model Finder context, the M_SHAPE_ELLIPSE type of Model Finder context can only have one model added to the context and it must be a synthetic model of type M_ELLIPSE. Many of the restrictions that apply to an M_SHAPE_CIRCLE type of Model Finder context apply to an M_SHAPE_ELLIPSE type of Model Finder context. Any differences will be noted in the relevant constants. Rectangle-shape contexts Rectangle-shape Model Finder contexts use a specialized algorithm to locate instances of rectangular shapes. This context searches for occurrences of rectangular shapes based on their aspect ratio relative to that of the defined model. This strategy searches for a range of aspect ratios around a nominal aspect ratio. This context has a tolerance for the deformation of shapes such that rectangles that are not perfectly rectangular would still be identified as potential occurrences. However, at least a portion of each of their sides must be visible; that is, the model coverage on any side cannot be 0. This context type is recommended when your target contains one or more rectangular shapes that must be found and other context types would either take too long to find the occurrences, are not suited for the shape being sought, or would not reliably find all occurrences of the rectangular shapes. Like the M_SHAPE_CIRCLE type of Model Finder context, the M_SHAPE_RECTANGLE type of Model Finder context can only have one model added to the context and it must be a synthetic model of type M_RECTANGLE. Many of the restrictions that apply to an M_SHAPE_CIRCLE type of Model Finder context apply to an M_SHAPE_RECTANGLE type of Model Finder context. Any differences will be noted in the relevant constants. Segment-shape contexts Segment-shape Model Finder contexts use a specialized algorithm to locate instances of segment shapes. This context searches for occurrences of segments defined on a contour. The segment's angle (direction) is determined from its gradient's angle (the direction of the most sudden change from dark to light causing the edge). The segment's direction is therefore the angle of the gradient - 90°. This context has a tolerance for the deformation of line segments such that segments that are not perfectly straight, or segments that are broken up, would still be identified as potential occurrences. This context type is recommended when your target contains one or more line segments that must be found and other context types would either take too long to find the occurrences, are not suited for the shape being sought, or would not reliably find all occurrences of the line segments. Like the M_SHAPE_CIRCLE type of Model Finder context, the M_SHAPE_SEGMENT type of Model Finder context can only have one model added to the context and it must be a synthetic model of type M_SEGMENT. Many of the restrictions that apply to an M_SHAPE_CIRCLE type of Model Finder context apply to an M_SHAPE_SEGMENT type of Model Finder context. Any differences will be noted in the relevant constants. Types of Model Finder contexts General geometric contexts Controlled geometric contexts Circle-shape contexts Ellipse-shape contexts Rectangle-shape contexts Segment-shape contexts ",
      "wordCount": 1259,
      "subEntries": []
    },
    {
      "id": "UG_model-finder_Defining_and_adding_models_to_your_model_finder_context",
      "version": null,
      "title": "Defining and adding models to your Model Finder context",
      "subTitles": [
        "Image-type models",
        "Extracting edges",
        "Synthetic models",
        "Predefined-shape models",
        "Predefined-shape models in specialized contexts",
        "CAD-file models",
        "Model size, units, and camera calibration when dealing with synthetic model in a geometric or geometric-controlled context",
        "Model size, units, and camera calibration when dealing with synthetic model in a shape-specific context",
        "Models defined from result buffers",
        "Models defined from an Edge Finder result buffer",
        "Models defined from a Model Finder result buffer",
        "Models defined from two other models",
        "Preprocessing",
        "Model origin",
        "Model indices and labels",
        "Drawing and inquiring the model's active edges"
      ],
      "location": "MIL UG P03: 2D processing and analysis",
      "pageURL": "content\\UserGuide\\model-finder\\Defining_and_adding_models_to_your_model_finder_context.htm",
      "text": " Defining and adding models to your Model Finder context Once you have allocated a Model Finder context using MmodAlloc(), you can begin to add models to your Model Finder context. There are four different kinds of models that can be added to a Model Finder context: Model from an image. Synthetic model. Model from an Edge Finder or Model Finder result buffer. Model created from two other models. In general, all of these models can be mixed in the same Model Finder context, using MmodDefine() or MmodDefineFromFile(). The MmodDefine() function can add image-type models, result-type models, and predefined-shape synthetic models; the MmodDefineFromFile() function can add CAD-file synthetic models. If adding a model to a shape-specific Model Finder context, you can only add one model to it and it must be a synthetic model of the same type. Image-type models You can add models defined from an image to a Model Finder context manually or automatically, using MmodDefine() with M_IMAGE or M_AUTO_DEFINE, respectively. These types of models are referred to as image-type models. The specified model source image must be a 1-band, 8-bit unsigned image. When defining an image-type model manually, you must specify the region in the image from which to define the model. The minimum size of an image-type model is limited to 16.0 x 16.0 pixels, while the maximum size of 4096.0 x 4096.0 pixels is permitted. Note that image-type models are the only model type with a maximum permitted size of 4096.0 x 4096.0; all others have a maximum permitted size of 1024.0 x 1024.0. To extract an image-type model from a rotated region of the model source image, you must specify a source image that is associated with a rotated rectangular region of interest (ROI). To define the ROI, add a rectangle graphic at the required angle to a 2D graphics list, using MgraRectAngle(). To set that rectangle graphic as the ROI of the model source image, you can call MbufSetRegion() with either M_NO_RASTERIZE or M_RASTERIZE (specify M_FILL_REGION in either case), producing an M_VECTOR ROI or an M_VECTOR_AND_RASTER ROI, respectively. When defining a model automatically, MIL searches the model source image for unique geometric features. When the most suitable geometric features are found, the function automatically defines a model from those features. To be useful, the model source image should be a typical target image; otherwise, the selected area for the model might never be present in the target. Defining a model automatically is useful, for example, when you want to perform whole image alignment, for which the displacement of a unique model from its original location specifies the displacement of the image. MIL can automatically define a model based on specified settings or on default settings. The former is useful if you know, for example, that the selected model needs to be non-ambiguous only in a small range of angles; its ambiguity needs not be checked for the entire default range. Note that MIL searches for the unique model far enough from the image borders so that if the target image is shifted from the model source image, the model can still be found; you specify the maximum displacement that can occur between the position of the model in the source image and the position of the model when found in the target image. To define a model based on specified settings: Define an empty image-type model, using MmodDefine() with M_AUTO_DEFINE set to M_NULL. Set the model's settings, using MmodControl() with the index of the empty model. Define a unique geometric model from the model source image using MmodControl() with M_AUTO_DEFINE and the identifier of the source image. MmodControl() searches for a model with unique geometric features in the model source image that takes into account the settings previously specified using MmodControl(). To define a model based on default settings, use MmodDefine() with M_AUTO_DEFINE and the identifier of the source image. Extracting edges When you call MmodDefine(), it stores the specified region of the model source image with the model. This image is referred to as the model image. The model source image is then no longer needed. It is actually when you call MmodPreprocess() that edges are extracted from the model image. Specifically, MmodPreprocess() extracts the contour edges from the model image. For more information on contour edges, see the Extracting the edges section of Chapter 10: Edge Finder. The edge extraction process involves a denoising operation to even out rough edges and reduce noise. You can control the degree of smoothness (strength) of the denoising operation used for all models in the context, using MmodControl() with M_SMOOTHNESS. The range of this control type varies from 0.0 to 100.0; a value of 100.0 results in a strong noise reduction effect, while a value of 0.0 has almost no noise reduction effect. The default setting is 50.0. You can also control the detail level of the edge extraction process for all models in the context, using MmodControl() with M_DETAIL_LEVEL. Basically, this controls how much detail is extracted from the model image of each model in the context. The default setting (M_MEDIUM) offers a robust detection of edges from images with contrast variation, noise, and non-uniform illumination. Nevertheless, in cases where objects of interest have a very low contrast compared to high contrast areas in the image, some low contrast edges can be missed. The following examples show the use of the M_DETAIL_LEVEL control type. If your images contain low-contrast and high-contrast objects, and your object of interest is low-contrast, a detail level setting of M_HIGH should be used to ensure the detection of the low-contrast edges in the image. The M_VERY_HIGH setting performs an exhaustive edge extraction, including very low contrast edges. However, it should be noted that this setting is very sensitive to noise. Generally, the default settings for M_SMOOTHNESS and M_DETAIL_LEVEL are sufficient for the majority of images; you should adjust these settings only when dealing with very noisy images, extremely low or multi-contrasted images, or images with very thin, refined features. In such cases, it is recommended that you experiment with different settings to achieve the necessary level of accuracy and speed required by your application. Note that the settings for M_SMOOTHNESS and M_DETAIL_LEVEL are also applied to the search target when it is an image. Synthetic models Synthetic models are models that either have a predefined shape, or have been defined from a CAD DXF file. Synthetic models allow you to search the target for shapes. Predefined-shape models You can use MmodDefine() to add predefined-shape models to the context. The model types that are available are circle, cross, diamond, ellipse, rectangle, ring, square, and triangle. These model types are described in more detail in the description of MmodDefine(). Use the MmodDefine() parameters to define the attributes of the predefined-shape model, from the foreground color of the model to how it is constructed. The definition of each MmodDefine() parameter depends on the model. For example, for a circle model, MmodDefine() would have a parameter that defines the radius of the circle. For an ellipse model, MmodDefine() would have parameters that define the width and the height. You can also round all the corners of a model that has corners (the cross, diamond, rectangle, square, and triangle models), except for one in a M_SHAPE_RECTANGLE context. Set the radius of the curvature for the model's corners using MmodControl() with M_CORNER_RADIUS. Predefined-shape models use the center of the shape as the origin (0,0). Predefined-shape models in specialized contexts MIL has specialized shape-specific contexts to perform more robust searches for circles, ellipses, and rectangles. Using a specialized context, you can also search for segments. Even though these context types are dedicated to finding a particular shape, you must still add a model to the context, and it must be of the same type as the context. For these types of contexts, you can only add a single model to the context. Use MmodDefine() as described above to add the model to the specialized shape-specific context. You can only add a synthetic segment model (M_SEGMENT) to an M_SHAPE_SEGMENT context. This allows you to search for occurrences of segments on contours of objects. Note that if a line is found in the target, it is counted as two segment occurrences in opposite directions. To restrict it to a single occurrence, set MmodControl() with M_MIN_SEPARATION_ANGLE to M_DISABLE. See the Angle for rectangles and segments subsection of the Search settings specific to models in specialized shape contexts section later in this chapter. Searching for a predefined-shape model using a shape-specific context has the following primary advantages: For an M_RECTANGLE or M_SEGMENT synthetic model defined in a shape-specific context (M_SHAPE_RECTANGLE or M_SHAPE_SEGMENT, respectively), you can specify to find occurrences that are not perfectly straight or are broken up. To specify the tolerance for deformation, use MmodControl() with M_DEVIATION_TOLERANCE. For more information on this control types, see the Deviation tolerance for rectangles and segments subsection of the Search settings specific to models in specialized shape contexts section later in this chapter. For an M_CIRCLE synthetic model defined in an M_SHAPE_CIRCLE context, you can find occurrences that have deviation of the radii along the circumference of the model. For instance, an occurrence of a bottle cap could be identified as a circular model with the right radial deviation tolerance. You can control the radial deviation tolerance using M_SAGITTA_TOLERANCE. For more information regarding using this type of search constraint, see the Radial deviation tolerance subsection of the Search settings specific to models in specialized shape contexts section later in this chapter. For an M_ELLIPSE synthetic model defined in an M_SHAPE_ELLIPSE context, you can find occurrences of the model that have varying aspect ratios (for example, due to the perspective). You should define the ellipse model (MmodDefine() with M_ELLIPSE) with the same width and height as that of the occurrence if the image had no distortion. If the image does have distortion that affects the occurrence's aspect ratio, you can use MmodControl() with M_MODEL_ASPECT_RATIO, M_MODEL_ASPECT_RATIO_MAX_FACTOR, and M_MODEL_ASPECT_RATIO_MIN_FACTOR to account for the expected aspect ratio difference. For more information on these control types, see the Aspect ratio and aspect ratio search constraint subsection of the Search settings specific to models in specialized shape contexts section later in this chapter. CAD-file models You can add models that are defined from CAD DXF files to a Model Finder context, using MmodDefineFromFile(). The CAD DXF files must be in the R14 file format. Not every entity in a CAD DXF file is supported; unsupported entities are ignored. The supported entities are LINE, POLYLINE, LWPOLYLINE, CIRCLE, ARC, ELLIPSE, BLOCK (a collection of entities), and INSERT (an entity containing a reference to where the BLOCK should be drawn, and at what location and scale). Note that for the LWPOLYLINE entities, the bulge option is ignored by MIL. When the model is added to the Model Finder context from a CAD DXF file, the model will retain its coordinate system (the origin and the axis). Most CAD DXF files are oriented so that the Y-axis is positive going up, whereas the coordinate system MIL uses is oriented so that the Y-axis is positive going down. So if you take the edge coordinates of an object from a CAD DXF file and put them in an image, the imaged object will look flipped when compared to the original object. This is also the case for a model defined from a CAD DXF file. This means that, unless the object is symmetrical, the match will not be made. You can use MmodControl() with M_CAD_Y_AXIS to flip the Y-axis for the model so that it is positive going down. Model size, units, and camera calibration when dealing with synthetic model in a geometric or geometric-controlled context If adding a synthetic model to a M_GEOMETRIC or M_GEOMETRIC_CONTROLLED context, specify the model's dimensions in user-defined units. Specify the ratio between model units and pixel units using MmodControl() with M_PIXEL_SCALE. If the target is not calibrated, M_PIXEL_SCALE is used for the match. If the target is calibrated, the model units should be the same as the calibrated units. If the target is calibrated, M_PIXEL_SCALE will be used for draw operations, but not for the match nor the returned results. Note that if you are searching for a synthetic model in a calibrated target, you must also associate the camera calibration context of the target with the model, using M_ASSOCIATED_CALIBRATION. MIL needs the camera calibration context for internal purposes at preprocessing time. Note that MIL will not use the camera calibration context to compensate for incongruencies between the model and the target, nor will MIL map the model's coordinate system to that of the target. After you have specified your pixel scale and scale settings, you can verify if your synthetic models are valid, using MmodInquire() with M_VALID. Synthetic models can be invalid if their global size in X or Y (size of the model box x M_PIXEL_SCALE x M_SCALE) is less than 16 or greater than 1024. By default, synthetic models in a M_GEOMETRIC or M_GEOMETRIC_CONTROLLED context are defined to have a 10% margin around the bounding box of their active edges. When finding an occurrence, extra edges found in this area will reduce the target score. You can change the size of the margin using MmodControl() with the M_BOX_MARGIN_... control types. Model size, units, and camera calibration when dealing with synthetic model in a shape-specific context If adding a synthetic model to a M_SHAPE_... context, specify the model's dimensions in target units; the model is considered to have the same units as the target. If the target is calibrated, the model's dimensions and settings will be interpreted in world units. Conversely, if the target is not associated with a camera calibration context, the model's dimensions and settings will be interpreted in pixel units. The model will be defined in the same coordinate system as the target. You cannot associate a camera calibration context with the model in a M_SHAPE_... context. By default, synthetic models are defined to have a 10% margin around the bounding box of their active edges. For a model in an M_SHAPE_... type of Model Finder context, this margin is only used for drawing; it does not affect the match. You can change the size of the margins using MmodControl() with the M_BOX_MARGIN_... control types. Models defined from result buffers You can define models from two different types of result buffers: Edge Finder result buffers and Model Finder result buffers. This allows you to use the edge map information in the result buffer to define the model. In the case of these models, the model source image is the image from which the results were obtained. The model source is the result buffer in which the results are stored. The model image is a copy of the region in the model source image from which the model has been defined. Models defined from an Edge Finder result buffer You would define models from an Edge Finder result buffer if you want to use other types of edges, such as crest edges, or if you want to re-use the edge map for another purpose. If you know that the edges of interest have a minimum size, you could use Edge Finder to include only edges above that size. The included edges of the results are the ones that will be used to define the model. These result-type models are referred to as Edge Finder-type models. Some things have to be done before you can define a model from an Edge Finder result buffer. The Edge Finder result buffer must have been previously allocated using MedgeAllocResult(). The Edge Finder result buffer must be compatible with the Model Finder context. Enable this using MedgeControl() with M_MODEL_FINDER_COMPATIBLE prior to calling MedgeCalculate(). You can speed up the time it takes to search for the models by setting M_EXTRACTION_SCALE in MedgeControl() prior to calling MedgeCalculate(). For more information, see the Interfacing with Geometric Model Finder or Advanced Geometric Matcher section of Chapter 10: Edge Finder. MedgeCalculate() must have been already called using this result buffer. You can add models defined from an Edge Finder result buffer to a Model Finder context using MmodDefine() with M_EDGE_RESULT. The size of the model can be defined using the offset and size parameters of MmodDefine(). Models defined from a Model Finder result buffer Adding models defined from a Model Finder result buffer allows you to define new models from previous match occurrences. These models are referred to as Model Finder-type models. There are many reasons to use a Model Finder-type model. For example, if you have a model that changes slightly over time, you can define a model from the result to update it. Updating the model prevents potentially misidentifying the model because it has changed beyond your starting tolerances. To define a Model Finder-type model, use MmodDefine() with M_MOD_RESULT and pass the identifier of the Model Finder result buffer and the index of the occurrence to use. The model is defined with the edges of the target at the occurrence position. You have to use MmodControl() with M_MOD_DEFINE_COMPATIBLE enabled before you can use this feature; this must be done before MmodFind() finds the result. The result buffer must be compatible with the Model Finder context. Models defined from two other models Models can be defined from two previously existing models and added to the context. Use MmodDefine() with M_MERGE_MODEL and specify the two models from which to create the new model. The model will be formed by taking the first model specified and adding the edges of the second model that are not included in the edges of the first model. There are no restrictions on the types of models you can merge. They can be of different types, as long as they are part of the same model context. Preprocessing After you add models to your context and before performing the search, you have to preprocess the context, using MmodPreprocess(), otherwise an error will occur. It does not matter the type of model, or the type of context. Calling MmodPreprocess() will prepare models for geometric matching. In the case of image-type models, it is also the time when edges are actually extracted from the model image. Note that the Model Finder context must be preprocessed again if some of the models' search settings are changed. You can check if you need to preprocess after changing a control using MmodInquire() with M_PREPROCESSED. When you save a Model Finder context, preprocessing information is not saved with the context. You must preprocess the context when the Model Finder context is restored. Model origin The model origin is the point in the model that is considered to be (0,0). The location of the model origin depends on the type of model: for image and Edge Finder-type models, the model origin is the center of the upper left pixel of the model image; for predefined-shape models, the center of the shape is the model origin. The model origin for a model defined from a CAD DXF file is the same as point (0,0) in the CAD DXF file. You can inquire the X- and Y-coordinates of a predefined-shape's model origin using MmodInquire() with M_MODEL_IMAGE_ORIGIN_.... You can inquire the X- and Y-coordinates of an image or Edge Finder-type's model origin using MmodInquire() with M_ORIGINAL_.... You can use MmodControl() and MmodInquire() with M_REFERENCE_... to have results returned for a point other than the model origin. Model indices and labels Each model added to a Model Finder context can be accessed by its index. The first model is assigned an index of 0, and for each subsequent model added, the index is increased by one. You can also apply setting changes to all models within a Model Finder context using M_ALL as the index. When a model is deleted, all model indices greater than the deleted model are shifted down by one. MIL searches for all models within a context in parallel, therefore the model index does not have any bearing in terms of a search order. Models can also be given a user-defined numeric label, using MmodControl() with M_USER_LABEL. A user label can be used as a means of identifying your model, independently from its index in the Model Finder context. However, user labels cannot be used as a direct replacement for the index; to retrieve the index of a model from the user label, use MmodInquire() with M_INDEX_FROM_LABEL. The user label, once converted to an index value, can be used with any Mmod...() function that takes an index value. All user labels must be unique integers; that is, no two user labels can have the same integer. To remove a label from a model, set the user label to M_NO_LABEL. Drawing and inquiring the model's active edges When testing different model source images for the best model candidate, you can use MmodDraw() to draw the model's active edges. This can be done for any type of model, although for synthetic models it is less useful, since the edges should already be known. The resulting edge map can reveal whether the edges you have chosen are the ones that you want, or if there are problems with the edges. You can use MmodInquire() with the M_ALLOC_SIZE... inquire types to determine the necessary size for the destination image buffer. To make corrections for image-type or Model Finder-type models, you might have to adjust the image processing control types, or mask unwanted edges. For Edge Finder-type models, you can exclude edges that you don't want from the Edge Finder result buffer and redefine the model, or you can mask unwanted edges. If you have used offsets to define the model region in the model source, you can draw the active edges at the position where the model was defined using MmodDraw() with M_ORIGINAL; otherwise the active edges will be drawn at the center of the top-left pixel of the destination image. This is valid for image-type or Edge Finder-type models. You can use MmodInquire() with the M_CHAIN_INDEX, M_CHAIN_X, and M_CHAIN_Y controls to inquire the active edges of the model. Note that if you try to draw a model's edges and its Model Finder context has not been preprocessed, a preliminary edge extraction operation will be performed for the model. You can also draw features from a zoomed region of the model image, as well as other items. To do so, specify the appropriate values for the MgraControl() M_DRAW_OFFSET_X, M_DRAW_OFFSET_Y, M_DRAW_ZOOM_X, and M_DRAW_ZOOM_Y control types. The relative origin values must be specified in pixels, and are relative to the coordinates of the top-left corner of the region in the model image, while the scale values specify the X- and Y-scaling factors used to fill the destination image buffer. Defining and adding models to your Model Finder context Image-type models Extracting edges Synthetic models Predefined-shape models Predefined-shape models in specialized contexts CAD-file models Model size, units, and camera calibration when dealing with synthetic model in a geometric or geometric-controlled context Model size, units, and camera calibration when dealing with synthetic model in a shape-specific context Models defined from result buffers Models defined from an Edge Finder result buffer Models defined from a Model Finder result buffer Models defined from two other models Preprocessing Model origin Model indices and labels Drawing and inquiring the model's active edges ",
      "wordCount": 3885,
      "subEntries": []
    },
    {
      "id": "UG_model-finder_Guidelines_for_choosing_models",
      "version": null,
      "title": "Guidelines for choosing models",
      "subTitles": [
        "Make sure your images have enough contrast",
        "Avoid poor geometric models",
        "Be aware of ambiguous models",
        "Nearly ambiguous models"
      ],
      "location": "MIL UG P03: 2D processing and analysis",
      "pageURL": "content\\UserGuide\\model-finder\\Guidelines_for_choosing_models.htm",
      "text": " Guidelines for choosing models While finding models based on geometric features is a robust, reliable technique, there are a few pitfalls which you should be aware of when allocating your models so that you choose the best possible model. Make sure your images have enough contrast Contrast is necessary for identifying edges in your model source and target image with subpixel accuracy. For this reason, it is recommended that you avoid models that contain only slow gradations in grayscale values. Avoid poor geometric models Poor geometric models suffer from a lack of clearly defined geometric characteristics, or from geometric characteristics that do not distinguish themselves sufficiently from other image features. These models can produce unreliable results. Be aware of ambiguous models Certain types of geometric models provide non-unique, or ambiguous, results in terms of position, angle, or scale. Models that are ambiguous in position are usually composed of one or more sets of parallel lines only. Such models make it impossible to establish a unique position for them. A large number of matches can be found since the actual number of line segments in any particular line is theoretically limitless. Models that are ambiguous in scale are usually composed only of straight lines which pass through the same point; some spirals are also ambiguous in scale. Models that consist of small portions of objects should be tested to verify that they are not ambiguous in scale. For example, a model of an isolated corner is ambiguous in terms of scale because it consists of only two straight lines that pass through the same point. Symmetric models are often ambiguous in angle due to their similarity in features. For example, circles are completely ambiguous in terms of angle. Other simple symmetric models, such as squares and triangles, are ambiguous with respect to certain angles: Nearly ambiguous models When the major part of a model contains ambiguous features, false matches can occur because the percentage of the occurrence's edges involved in the ambiguous features is great enough to be considered a match (see the Determining what is a match section later in this chapter). To avoid this, make sure that your models have enough distinct features to be found among other target features. This will ensure that only correct matches are returned as results. For example, the following model can produce false matches since the greater proportion of active edges in the model is composed of parallel straight lines rather than distinguishing curves. Guidelines for choosing models Make sure your images have enough contrast Avoid poor geometric models Be aware of ambiguous models Nearly ambiguous models ",
      "wordCount": 436,
      "subEntries": []
    },
    {
      "id": "UG_model-finder_Masking_your_model",
      "version": null,
      "title": "Masking your model",
      "subTitles": null,
      "location": "MIL UG P03: 2D processing and analysis",
      "pageURL": "content\\UserGuide\\model-finder\\Masking_your_model.htm",
      "text": " Masking your model Once you have added a model to your geometric (M_GEOMETRIC) or controlled geometric (M_GEOMETRIC_CONTROLLED) type of Model Finder context, you can then mask any irrelevant, inconsistent, or featureless areas of your model using MmodMask(). You cannot mask models added to an M_SHAPE_... type of Model Finder context. For models in supported contexts, you can define three types of masks: a \"don't care\", a \"flat region\", and a \"weighted region\" mask. You can use these types of masks with the same model. Note that \"don't care\" and \"flat region\" masks are not supported for synthetic models. With a \"don't care\" mask (M_DONT_CARE), MIL ignores the masked regions when searching for occurrences of the model. Masked edges in the model edge map and edges in the corresponding regions of the target edge map will be ignored and will not contribute to either the score or the target score. These regions might be noise edges, unwanted edges, inconsistent features, or simply regions that are irrelevant to your search. In the following example, a mobile phone is used as the model. However, occurrences of this model have displays containing inconsistent characters from target image to target image. Since these characters are variable, they should be masked in the model. With a \"flat region\" mask (M_FLAT_REGIONS), the masked regions are expected to be featureless in the found occurrence, and any edges present in these regions will reduce the target score. Masked edges in the model edge map will be ignored while edges in the corresponding regions of the target edge map will lower the target score. Features that are present in a region where none are expected can indicate that an error has occurred, for example in the manufacturing process. With a \"weighted region\" mask (M_WEIGHT_REGIONS), the extracted model features have weights according to the values of the \"weighted region\" mask. The weights of the features are used to calculate the score; although the weights themselves don't affect the target score, edges corresponding to negative weights will be ignored when calculating the target score. The valid range for the weights of the mask is -127 to +127. Positive weights indicate how significant it is for a given pixel to be part of an edge in the occurrence; the more positive the weight, the greater the influence on the score. The absence of a pixel that corresponds to a very positive weight reduces the score more than the absence of one with a lower weight. The longer the edges with a positive weight, the more significant the edges to the target coverage and to the target score. Negative weights indicate how significant it is for a given pixel not to be part of an edge of the occurrence; the more negative the weight, the more the influence on the score. The presence of a pixel that corresponds to a very negative weight will reduce the score more than the presence of one that corresponds to a less negative weight. The effect of positive and negative weights on the score is relative. A \"weighted region\" mask that has negative weights of -100 and positive weights of 100 will have the same score as the same mask where the negative weight is -1 and the positive weight is 1. Note that weights that have no correspondence to edges in the model have no effect on the score. \"Weighted regions\" are particularly useful when the pattern you are searching for in the target also exists as a subset of other patterns; that is, you cannot otherwise identify the required pattern uniquely. In these cases, you have to create a model that includes the unwanted extra edges and mask the extra edges with negative weights. In the example below, the square is the shape that is being searched for, while every other shape is unacceptable. The \"weighted region\" mask will cause the one acceptable shape to be found with a high score, while ensuring that the two other shapes that are similar are found with a low score. A separate image buffer is used to create each mask and each buffer must be of the same size as the model. Note that if you modify the margin of a synthetic model's bounding box after a mask has been applied, the mask will be discarded since it is no longer the same size as the model. You must then re-apply a mask that is of the same size as the new model box. For a \"don't care\" or \"flat region\" mask, the buffer must be a 1-band 8-bit unsigned buffer, where any non-zero pixel value is considered a masked pixel. For a \"weighted region\" mask, the buffer must be a 1-band 8-bit signed buffer and the valid range for the weights of the mask is -127 to +127. This buffer can be calibrated; however, even if the model is calibrated, the mask is applied on a pixel basis. Note that if you expect significant misalignment between the model and the target, you might need to compensate for this by slightly increasing the region of the \"don't care\" or \"flat region\" pixels in the mask. If you want to verify the mask that has been applied to a model, you can use MmodDraw() to draw the model's masked pixels. If necessary, you can clear a model's current mask by setting the mask to M_NULL. Finally, when you change the masked pixels of a model, you must preprocess the search model again. Masking your model ",
      "wordCount": 917,
      "subEntries": []
    },
    {
      "id": "UG_model-finder_Search_targets",
      "version": null,
      "title": "Search targets",
      "subTitles": [
        "Finding models in an image",
        "Finding models in an Edge Finder result buffer",
        "Finding models in an M_SHAPE_SEGMENT Model Finder result buffer"
      ],
      "location": "MIL UG P03: 2D processing and analysis",
      "pageURL": "content\\UserGuide\\model-finder\\Search_targets.htm",
      "text": " Search targets You can search for instances of a model in an image, or you can search for instances of it in an Edge Finder result buffer. If you are searching for instances of a M_RECTANGLE model that is in a shape-specific context, you can also search for it in an M_SHAPE_SEGMENT Model Finder result buffer. In all cases, use MmodFind() to find the model. This function will write the results of the search in a specified Model Finder result buffer. Finding models in an image To search for instances of models in an image, the target image must be a 1-band, 8-bit unsigned image. The minimum and maximum target image sizes are 16x16 and 32768x32768 pixels, respectively. It is important to note that the minimum and maximum target image sizes are MIL limits. To make sure that you have enough memory, you can call MmodFind(); if you don't have enough memory, you will get a MIL error. For an M_GEOMETRIC or M_GEOMETRIC_CONTROLLED type of Model Finder context, the target image must be in the same calibrated state as the models. If the models are calibrated, the target must be; if the models are not calibrated, the target must not be. For a synthetic model in an M_SHAPE_... type of Model Finder context, the model cannot be calibrated and will inherit the camera calibration of the target image. If the target is calibrated, the model will be interpreted in world units, and conversely, if the target does not have a camera calibration context associated with it, the model will be interpreted in pixel units. You can search for a synthetic model in a calibrated or non-calibrated target image. If the target is calibrated, the model units should be the same as the calibrated units. In addition, you must associate the camera calibration context of the target image with the model using MmodControl() with M_ASSOCIATED_CALIBRATION. MIL needs the camera calibration context for internal purposes at preprocessing time. Note that MIL will not use the camera calibration context to compensate for incongruencies between the model and the target, nor will MIL map the model's coordinate system to that of the target. Note that the edge extraction process, applied to the target image, uses the same denoising operation and detail level as the one for all image-type models in the Model Finder context. For more information, see the Extracting edges subsection of the Defining and adding models to your Model Finder context section earlier in this chapter. Finding models in an Edge Finder result buffer When using an Edge Finder result buffer as the target, Model Finder searches for active edges of the models only in the included edges of the result buffer. Therefore, using the Edge Finder result buffer as a target, instead of an image, allows you to be more specific about the edges in which to search. For example, you could select out unwanted edges in the target, which will speed up the search and further calculations, or create a target that is composed of user-defined edges. Some things have to be done before you can search for instances of a model in an Edge Finder result buffer: The Edge Finder result buffer must have been previously allocated using MedgeAllocResult(). The Edge Finder result buffer must be compatible with the Model Finder context. Enable this using MedgeControl() with M_MODEL_FINDER_COMPATIBLE. MedgeCalculate() must have already been called using this result buffer. If the models in an M_GEOMETRIC or M_GEOMETRIC_CONTROLLED type of Model Finder context are calibrated, the results in the Edge Finder result buffer must also be calibrated. If the models are not calibrated, the results must not be calibrated either. In the case of synthetic models, the same rules apply as when using a calibrated image as a target. Finding models in an M_SHAPE_SEGMENT Model Finder result buffer If you are searching for instances of a M_RECTANGLE model that is in a shape-specific context, you can also search for it in an M_SHAPE_SEGMENT Model Finder result buffer. This can be useful if you want to restrict the search to segment-type edges. Search targets Finding models in an image Finding models in an Edge Finder result buffer Finding models in an M_SHAPE_SEGMENT Model Finder result buffer ",
      "wordCount": 706,
      "subEntries": []
    },
    {
      "id": "UG_model-finder_Determining_what_is_a_match",
      "version": null,
      "title": "Determining what is a match",
      "subTitles": [
        "Score, target score, and fit score",
        "Model and target coverage",
        "Fit error",
        "Interpreting results"
      ],
      "location": "MIL UG P03: 2D processing and analysis",
      "pageURL": "content\\UserGuide\\model-finder\\Determining_what_is_a_match.htm",
      "text": " Determining what is a match Before customizing your search settings, it is necessary to understand how a match between your model and occurrences in the target is determined. The score (M_SCORE) and the target score (M_SCORE_TARGET) are the primary factors in determining which occurrences are considered matches with the models in your Model Finder context. Score, target score, and fit score The score is a measure of the active edges in the model found in the occurrence, weighted by the deviation in position of these common edges. Active edges in the model not found in the occurrence reduce the score. The target score is a measure of edges found in the occurrence that are not present in the original model (that is, extra edges), weighted by the deviation in position of the common edges. Edges found in the occurrence that are not present in the model will reduce the target score. Due to the nature of models in a shape-type context, target score is not supported for these types of models. Instead, for these models, there is a fit score. The fit score is a measure of the correlation of the edges in the model to those of the occurrence. For a model in an M_GEOMETRIC or M_GEOMETRIC_CONTROLLED type of Model Finder context, the model scores are calculated as follows: Score = Model coverage x [1 - (Fit error weighting factor x Normalized Fit Error)]. Target Score = Target coverage x [1 - (Fit error weighting factor x Normalized Fit Error)]. For a model in an M_SHAPE_... type of Model Finder context, the model and fit scores are calculated as follows: Score = (Model coverage/Max coverage) x [1 - (Fit error weighting factor x Normalized Fit Error)]. Fit score = [1 - Normalized Fit Error]. Note that for all Model Finder context types, the terms within the square brackets result in a number between 0.0 and 1.0. The model coverage, target coverage, and fit error components of the score and target score are explained below. Note that the target coverage (M_TARGET_COVERAGE) result type is not supported for an M_SHAPE_... type of Model Finder result buffer, which is why the target score (M_SCORE_TARGET) is not supported either. Model and target coverage The model coverage and target coverage are defined as follows: Model coverage. The model coverage is the percentage of the total length of the model's active edges found in the occurrence. 100% indicates that for each of the model's active edges, a corresponding edge was found in the occurrence. Target coverage. The target coverage is the percentage of the total length of edges present within the occurrence's bounding box, corresponding to the model's active edges. Thus, a target coverage score of 100% means that no extra edges were found. Lower scores indicate that features or edges found in the target (result occurrence) are not present in the model. Using a weighted mask with a model can affect the score and target score. In cases where a weighted mask is used, the model coverage would be as below: The target coverage is as follows: Fit error Fit error. The fit error is a measure of how well the edges of the occurrence correspond to those of the model. The fit error is calculated as the average quadratic distance, in pixels or calibrated units, between the edgels in the occurrence and the corresponding active edges in the model (the mean squared error): A perfect fit gives a fit error of 0.0. The fit error weighting factor (between 0.0 - 100.0) determines the importance to place on the fit error when calculating the score and target score. Interpreting results The following diagram illustrates how the model coverage, target coverage, and fit error work together to provide details about the nature of a result occurrence. Determining what is a match Score, target score, and fit score Model and target coverage Fit error Interpreting results ",
      "wordCount": 652,
      "subEntries": []
    },
    {
      "id": "UG_model-finder_Position_angle_scale",
      "version": null,
      "title": "Position, angle, and scale",
      "subTitles": [
        "Enabling calculations specific to searching within a range",
        "Search position and position range",
        "Angle and angular range",
        "Scale and scale range"
      ],
      "location": "MIL UG P03: 2D processing and analysis",
      "pageURL": "content\\UserGuide\\model-finder\\Position_angle_scale.htm",
      "text": " Position, angle, and scale You can control the position, angle, and scale at which Model Finder searches for each model in a target. You can restrict the position, angle, and scale at which model occurrences can be found, to an expected (nominal) position, angle, or scale or to a given range. Enabling calculations specific to searching within a range Depending on whether searching for models within a range of positions, angles, and/or scales, Model Finder typically uses different search strategies to evaluate the edge-based features of the target candidates. Typically, to search for models within a range, calculations specific to the corresponding search strategy should be enabled for the context (MmodControl() with M_SEARCH_POSITION_RANGE, M_SEARCH_ANGLE_RANGE, and/or M_SEARCH_SCALE_RANGE). If you expect that the occurrences sought are close to the specified nominal position, angle, or scale (for example, in a registration application), you can try disabling the calculations specific to the corresponding search strategies to see if Model Finder can still find the required occurrences. Disabling one or more of these calculations might speed up the search depending on the model and the target. These control types are not supported for M_SHAPE_... type of Model Finder contexts because these search strategies are natively supported. Note that candidates can only be returned as results if found within the ranges specified for their model. Therefore, if you have disabled calculations specific to a search strategy and occurrences at positions, angles, and/or scales outside of a required range are being returned, you can restrict which candidates are returned as occurrences by narrowing the appropriate ranges. Furthermore, the various search ranges can still be set even if the calculation specific to the corresponding search strategy has been disabled. This is due to the fact that at the end of the matching process, MIL performs a best fit match for finer accuracy. This final fit process can introduce model translations (rotation, position-shifting, scaling) relative to the expected occurrence. Once potential candidates have been identified, the final fit process will look for the best model within the specified ranges. Therefore, it is possible to restrict this final fit process to a smaller range than normally allowed, by explicitly setting the accepted range for identified candidates. Search position and position range You can search for each model defined in a Model Finder context at a specific position or within a position range. The position range limits the region in which the position of a model occurrence can be found; position coordinates which fall outside this region cannot be returned as results (MmodGetResult() with M_POSITION_X and M_POSITION_Y). Note that the position returned for an occurrence is determined by the model's reference axis origin; by default, this position is set to the center of the model; however, it can be displaced if necessary (see the Reference axis subsection of the Customizing search settings section later in this chapter). The default position range is the entire image plane (M_INFINITE) in the positive X- and Y-direction, meaning that all X- and Y-coordinates in the positive direction (even outside the target if applicable) can be returned as results. You can use the MmodControl() M_POSITION_DELTA_NEG_X, M_POSITION_DELTA_NEG_Y, M_POSITION_DELTA_POS_X, and M_POSITION_DELTA_POS_Y control types to set the position range relative to the nominal position. Alternatively, you can define a search position region using a rectangle drawn in a 2D graphics list by allocating a 2D graphics list, defining a rectangle within this 2D graphics list, and then using MmodControl() with M_SEARCH_POSITION_FROM_GRAPHIC_LIST. For models in M_SHAPE_... type of Model Finder contexts, you can also search within a rectangular region by passing a target image buffer associated with a rectangular M_VECTOR or M_VECTOR_AND_RASTER region of interest (ROI) directly to MmodFind(). You can set this ROI using MbufSetRegion(). You can, if necessary, set a different position range for each model in your context. Depending on the number of details present in the target, using a small position range generally decreases the search time. Always set the position range to the minimum required when speed is a consideration; M_POSITION_DELTA_NEG_X, M_POSITION_DELTA_NEG_Y, M_POSITION_DELTA_POS_X, and M_POSITION_DELTA_POS_Y can be greater or equal to zero. If they are all set to zero, the occurrence must be at the position specified by the nominal position. Note that you can specify a position range which defines a region partially, or totally, outside of the target; this might be necessary, depending on the reference axis origin of the model. By default, for an M_GEOMETRIC or M_GEOMETRIC_CONTROLLED type of Model Finder context, calculations specific to position-range search strategies are enabled but can be disabled (see the Enabling calculations specific to searching within a range subsection of this section). If you are searching for a single occurrence of each model in your context and you know the nominal position of each (for example, registration applications), you can disable the calculations specific to position-range search strategies for the context, using MmodControl() with M_SEARCH_POSITION_RANGE set to M_DISABLE. When disabled, you must specify a good nominal position for each model (using MmodControl() with M_POSITION_X and M_POSITION_Y). You can restrict which candidates are returned as occurrences by narrowing the position-range. For an M_SHAPE_... type of Model Finder context, calculations specific to position-range search strategies are not necessary; as such, M_SEARCH_POSITION_RANGE is not supported. With M_SHAPE_... type of Model Finder contexts, you can search for a model within rectangular regions at an angle. You can specify the search region with MmodControl() and M_POSITION_..., and set its angle with M_ANGLE_REGION. You can also specify a rotated search region using MmodControl() with M_SEARCH_POSITION_FROM_GRAPHIC_LIST. To do so, pass a 2D graphics list containing one rectangle graphic at any angle and set its input units to pixels. The rectangle graphic will define the search region. Setting the search region at an angle does not affect the angle at which MIL expects to find the model; it only limits the location in which the reference position of the model can be found. If you expect to find the model at a non-zero angle, you must set its nominal search angle, using MmodControl() with M_ANGLE. Likewise, searching within a region at an angle has no effect on the angle of a found occurrence's reference axis returned by MmodGetResult(). Alternatively, you can search within a rotated rectangular region by passing a target image buffer associated with a rectangular M_VECTOR or M_VECTOR_AND_RASTER region of interest (ROI) at any angle to MmodFind(). You can set this ROI using MbufSetRegion(). Passing a target image buffer associated with a rectangular ROI to MmodFind() will override the MmodControl() M_POSITION_... and M_ANGLE_REGION control types during the search and use the settings of the ROI instead. Likewise, passing a target image buffer associated with a rectangular ROI to MmodFind() will override the search region settings specified using M_SEARCH_POSITION_FROM_GRAPHIC_LIST and a 2D graphics list. Angle and angular range You can search for each model defined in a Model Finder context at a specific angle or within an angular range. For each model in your context, you can specify the angle of the search, using MmodControl() with M_ANGLE. By default, the search angle is 0°. You can also search within the full angular range of 360° from the nominal angle specified with M_ANGLE. Use the MmodControl() M_ANGLE_DELTA_POS and M_ANGLE_DELTA_NEG control types to specify the angular range in the counter-clockwise and clockwise direction from the nominal angle, respectively; the default for both is 180°. The angular range limits the possible angles which can be returned as results for an occurrence. Note that for general geometric contexts, the actual angle of the occurrence does not affect search speed. If you need to search for a model at discrete angles only (for example, at intervals of 90 degrees), it is typically more efficient to allocate a controlled geometric context, and define several models with different expected angles, than to search through the full angular range. For a model in an M_SHAPE_RECTANGLE or M_SHAPE_SEGMENT Model Finder context, there are additional control types related to angle to control the segment and rectangle found; see the Angle for rectangles and segments subsection of the Search settings specific to models in specialized shape contexts section later in this chapter. By default, for an M_GEOMETRIC or M_GEOMETRIC_CONTROLLED type of Model Finder context, calculations specific to angular-range search strategies are enabled but can be disabled (see the Enabling calculations specific to searching within a range subsection of this section). If you expect that the occurrences sought are close to the specified nominal angle, you can disable the angular calculations using MmodControl() with M_SEARCH_ANGLE_RANGE set to M_DISABLE. When disabled, you must specify a good nominal angle for each model, which is within the model's angular range. You can restrict which candidates are returned as occurrences by narrowing the angular-range. Note that M_SEARCH_ANGLE_RANGE must be enabled to search for a rotation-invariant non-synthetic model (for example, an image-type model of a circle). Note that the angle of the search region does not affect the nominal angle at which MIL expects to find occurrences. For more information, refer to the Search position and position range subsection of this section. Scale and scale range The scale of the model establishes the size of the occurrence that you expect to find in the target. If the expected occurrence is smaller or larger than that of the model, you can set the nominal scale of the occurrence for each individual model, using MmodControl() with M_SCALE. The supported scale factors are 0.5 to 2.0 for models in an M_GEOMETRIC or M_GEOMETRIC_CONTROLLED type of Model Finder context. For models in an M_SHAPE_... type of Model Finder context, the nominal scale can be any positive value. When the scale of occurrences can vary around the specified nominal scale, you can enable calculations specific to scale-range search strategies for the context using MmodControl() with M_SEARCH_SCALE_RANGE set to M_ENABLE. To specify the range of scales, use MmodControl() with M_SCALE_MAX_FACTOR and M_SCALE_MIN_FACTOR. The minimum factor and the maximum factor together determine the scale range from the nominal scale (M_SCALE). The maximum and minimum factors are applied to the M_SCALE setting as follows: Maximum scale = (M_SCALE) x (M_SCALE_MAX_FACTOR) Minimum scale = (M_SCALE) x (M_SCALE_MIN_FACTOR) Note that the range is defined as factors so that if you change the expected scale (M_SCALE), you do not have to modify the range. A search through a range of scales is performed in parallel, meaning that the actual scale of an occurrence has no bearing on which occurrence will be found first. By default, for an M_GEOMETRIC type of Model Finder context, calculations specific to scale-range search strategies are disabled but can be enabled (see the Enabling calculations specific to searching within a range subsection of this section). When disabled, you must specify a good nominal scale for each model, which is within the model's scale range. Note that occurrences can still be found within the scale range specified for their model. You can restrict which candidates are returned as occurrences by narrowing the scale-range. When calculations specific to scale-range search strategies are enabled, the scale range should be used to cover an expected variance in the scale; you should not use the scale range to cover different expected scales at different positions. In this case, it is typically more efficient to define several models with different expected scales. This is because a large scale range could potentially slow down your operation; as well, you could find unwanted occurrences. For models in an M_GEOMETRIC_CONTROLLED type of Model Finder context, scale-range searches are not supported, so you cannot enable M_SEARCH_SCALE_RANGE. However, you can still use M_SCALE_MAX_FACTOR and M_SCALE_MIN_FACTOR to restrict the results that are returned. For an M_SHAPE_... type of Model Finder context, calculations specific to scale-range search strategies are not necessary because scale-range is natively supported; as such, M_SEARCH_SCALE_RANGE is not supported. Position, angle, and scale Enabling calculations specific to searching within a range Search position and position range Angle and angular range Scale and scale range ",
      "wordCount": 1979,
      "subEntries": []
    },
    {
      "id": "UG_model-finder_Customizing_search_settings",
      "version": null,
      "title": "Customizing search settings",
      "subTitles": [
        "Acceptance levels",
        "Certainty levels",
        "Expected number of occurrences",
        "Reference axis",
        "Reference axis origin",
        "Reference axis angle",
        "Forward and reverse transformation coefficients"
      ],
      "location": "MIL UG P03: 2D processing and analysis",
      "pageURL": "content\\UserGuide\\model-finder\\Customizing_search_settings.htm",
      "text": " Customizing search settings With successive calls to MmodControl(), you can customize the global search settings of a Model Finder context, the search settings of each individual model in the context, and the general settings of a Model Finder result buffer; specify which settings to modify using the Index parameter (M_CONTEXT, the model's index, or M_GENERAL, respectively). You can also customize a search setting for all the models in a context by setting the Index parameter to M_ALL. However, when using M_ALL, ensure that the specified setting is appropriate for all models. You can inquire about any Model Finder context setting, individual model setting, or Model Finder result buffer setting using MmodInquire(). This section discusses the fundamental model search settings that are usually necessary to adjust (and not previously discussed) and their inter-related global context settings. Other settings are discussed later. Fundamental model search settings include the acceptance and certainty levels which determine what is considered a match, the expected number of occurrences to find, the reference axis which determines the position returned for a match. Most of the model search settings can affect the speed and robustness of your application. It is recommended that you begin with the default settings, and then, as your application demands, adjust the individual settings as required. Acceptance levels For each model in an M_GEOMETRIC or M_GEOMETRIC_CONTROLLED type of Model Finder context, acceptance levels can be set for both the score and target score; whereas for a model in an M_SHAPE_... type of Model Finder context, you cannot set the acceptance levels for the target score. The acceptance levels determine the minimum scores required for an occurrence to be considered a match. MIL will search the target for the required number of occurrences, returning the occurrences with the best scores greater than or equal to the acceptance levels. If the score or target score of an occurrence is less than the acceptance levels, it is not considered a match and no result will be returned. You can set the acceptance level for the score of a specified model, using MmodControl() with M_ACCEPTANCE. For example, a setting of 100% means that you will only accept occurrences that contain every active edge in the model with a perfect fit. That is, for every active edge in the model, an equivalent edge must be found in the occurrence with a perfect fit. However, perfect matches are generally unobtainable in real images because of noise and distortion introduced when grabbing images. You should use a reasonable acceptance level that is high enough to avoid false matches, but not so high that occurrences are missed. If your images have considerable noise and/or distortion, or if occlusion of occurrences is expected, you might have to set the level below the default value of 60%. You can set the target score required using M_ACCEPTANCE_TARGET. A setting of 100% for the target score means that you will not tolerate any extra edges, and common edges will have a perfect fit. A setting of 0% (default) allows for any number of extra edges. Essentially, the target score acceptance level allows you to control how tolerant your search is to details not present in the original model. Note that the contribution of the fit can be controlled using MmodControl() with M_FIT_ERROR_WEIGHTING_FACTOR, and that the default value for the weighting factor is 25.0%. For more information, see the Fit error weighting factor subsection of the Advanced search settings section later in this chapter. Note that the M_ACCEPTANCE_TARGET control type is not supported for an M_SHAPE_... type of Model Finder context. Certainty levels The certainty levels are used to speed up the search when very good matches are expected often. Any occurrence that is greater than or equal to the certainty levels is considered a certain match. The certainty levels determine the score and target score above (or equal to) which the algorithm can assume that it has found a certain match. Both of these scores must be greater than or equal to their respective certainty levels for an occurrence to be considered a certain match. If the required number of occurrences has been found above (or equal to) these certainty levels, MIL stops searching the target for better ones, avoiding exhaustive checking of all possible candidates. If not, MIL will continue to search for the required number of matches greater than or equal to the acceptance level and with the best score. You can set the certainty level for the score of a specified model using MmodControl() with M_CERTAINTY (the default setting is 90%). You can set the certainty level for the target score of a specified model using M_CERTAINTY_TARGET (the default value is 0%). Note that the M_CERTAINTY_TARGET control type is not supported for an M_SHAPE_... type of Model Finder context. If necessary, when searching for a fixed number of occurrences in a target, you can ensure that MIL always returns those occurrences with the highest match score among those found, by setting the certainty levels of each individual model to 100%. MIL will return occurrences with the best score(s) greater than or equal to the acceptance or those with scores of 100%. Note that doing so will probably increase the search time. Expected number of occurrences You can set the expected number of occurrences for the Model Finder context, and for each individual model in the Model Finder context. For each individual model in the context, you can set the expected number of occurrences of the model in the target. To do so, use MmodControl() with M_NUMBER, specifying the index of the particular model. The default value is 1. To find all occurrences of a model, set M_NUMBER to M_ALL. The number set for the context specifies the maximum total of all model occurrences (for all models within the context together). To set the number for a Model Finder context, use MmodControl() with M_NUMBER, specifying M_CONTEXT as the index. The default value is M_ALL, which finds the expected number of occurrences specified for each model. Note that setting the number of occurrences for the context to M_ALL and the number of occurrences for one of the models to M_ALL can significantly slow the MmodFind() operation, depending on the complexity of your model and the target (operation speed will only be slightly affected for simple models on a uniform background). It is recommended that you specify the exact number of expected occurrences whenever possible. MIL searches for all models within a context in parallel, therefore the model index does not have any bearing in terms of a search order. Once the number of occurrences for the context has been found, with scores greater than or equal to the certainty levels, the search will stop. For example, in an application involving a number of different objects being examined one at a time on a conveyor belt, the actual object present in the target at any time is unknown. Since only one occurrence is expected at any one time, the Model Finder context's number would be set to one, as would the number for all the models within the context. MIL will search the target for all three models; the first occurrence of any of these models, found above (or equal to) the certainty level, will stop the search. To further illustrate the relationship between the M_NUMBER setting for the context and that of the individual models, the tables below show the maximum possible results which can be returned for different context M_NUMBER settings. Model Finder Context Element Setting for M_NUMBER Maximum possible results Context M_ALL All Model 0 1 1 Model 1 M_ALL All Model 2 2 2 The following table shows that if certain M_NUMBER settings are specified, different combinations of maximum number of results are possible. Model Finder Context Element Setting for M_NUMBER Ex. 1 Ex. 2 Ex. 3 Ex. 4 Ex. 5 Ex. 6 Context 6 6 6 6 6 6 6 Model 0 1 0 1 0 1 0 1 Model 1 M_ALL 6 5 5 4 4 3 Model 2 2 0 0 1 1 2 2 Reference axis When an occurrence of a model is found, the model's reference axis determines the coordinates and angle returned as the actual occurrence's found position and angle. Position results return the coordinates of the model's reference axis origin transformed at the model occurrence. Angle results are also returned relative to the reference axis, rather than the model source image axis. Reference axis origin By default, the reference axis origin, for an image-type or result-type model, is at the center of the model box. For a synthetic model, the reference axis origin is, by default, at the model origin. For models defined with an M_SHAPE_... type of Model Finder context, the reference axis origin is, by default, at the center of the conic shape (whether that be a circle or an ellipse). If the default reference axis is not at a practical position for your application, you can change the position of the reference axis origin using MmodControl() with M_REFERENCE_X and M_REFERENCE_Y. Specify coordinates relative to the model origin; position results are returned relative to the origin of the target. Modifying the reference axis origin can be useful if you cannot define a unique model for an object of interest. In this case, define a model that is unique and at a fixed location relative to your object of interest and move your reference axis. In the diagram below, the easily found chip is used as the model, and the model's reference axis origin is shifted to the location of the diode. The reference axis origin does not have to reside within the model, meaning that you can place the reference axis origin outside of the model boundaries. Note that the found position of an occurrence respects differences in angle and scale, meaning that the found position is relative to the angle and scale of the occurrence. When changing the reference axis origin, make sure to update the position range if necessary, particularly when searching through a range of angles and/or scales. The position range limits the region in which the position of a model occurrence can be found; position coordinates which fall outside this region cannot be returned as results (see the Search position and position range subsection of the Position, angle, and scale section earlier in this chapter). In the diode example presented above, the position range must include, and can be limited to, a small area including the diode for the chip to be found. Reference axis angle Often, when allocating models, the angle of the object in your model source image is not aligned with the horizontal image axis. When occurrences in your target are successfully located, the angle of the occurrence returned is with respect to the model's reference axis. The actual angle of your object of interest in the model is not taken into consideration. You can align the reference axis with the object of interest using MmodControl() with M_REFERENCE_ANGLE. Angle results will then reflect the actual angle of your object of interest. In the example above, setting the reference axis angle to 4.0 degrees will ensure that the angle returned for the occurrence will represent the actual angle of the object. Forward and reverse transformation coefficients Forward and reverse transformation coefficients are available (as results) for mapping additional points of interest other than the reference axis origin. These coefficients allow you to convert coordinates in the model coordinate system to the corresponding coordinates in the target coordinate system for that occurrence (or vice versa). These coefficients handle variations in scale, translation, and angle, allowing for easier mapping of critical points between model and occurrence. Use the following equations: xd = Axs + Bys + C yd = Exs + Fys + D where: A, B, C, D, E, F: Transformation coefficients (forward or reverse). Note that E = -B and F = A for models that do not have an M_ASPECT_RATIO result type. xs and ys : Source coordinates (with respect to the origin of the model coordinate system for a forward transformation or target coordinate system for a reverse transformation). xd and yd : Destination coordinates (with respect to the origin of the target coordinate system for a forward transformation or model coordinate system for a reverse transformation). If the model is calibrated, these coefficients are given for the real world. For more information, see the Using transformation coefficients with calibrated images subsection of the Camera calibration section later in this chapter. Customizing search settings Acceptance levels Certainty levels Expected number of occurrences Reference axis Reference axis origin Reference axis angle Forward and reverse transformation coefficients ",
      "wordCount": 2112,
      "subEntries": []
    },
    {
      "id": "UG_model-finder_Search_settings_specific_to_models_in_specialized_shape_contexts",
      "version": null,
      "title": "Search settings specific to models in specialized shape contexts",
      "subTitles": [
        "Approximating the edges",
        "Radial deviation tolerance",
        "Aspect ratio and aspect ratio search constraint",
        "Deviation tolerance for rectangles and segments",
        "Angle for rectangles and segments"
      ],
      "location": "MIL UG P03: 2D processing and analysis",
      "pageURL": "content\\UserGuide\\model-finder\\Search_settings_specific_to_models_in_specialized_shape_contexts.htm",
      "text": " Search settings specific to models in specialized shape contexts MIL supports context types for specialized shape searches. Besides supporting many search settings supported for equivalent predefined-shape models in M_GEOMETRIC and M_GEOMETRIC_CONTROLLED types of Model Finder contexts, a predefined shape model in an M_SHAPE_... context supports additional search settings, specific to their model type. Approximating the edges When calculating the target edges for specialized shape searches, each edge of the target is piecewise approximated using a connected series of straight line segments. You can control the resolution of the edge approximation using MmodControl() with M_RESOLUTION_COARSENESS_LEVEL. The range of this control varies from 0 to 100. When set to 0, a very fine approximation of the edges is performed. A fine approximation can help to find small occurrences in the target image. When set to 100, a coarse approximation of the edges is performed. The default value is 50. The following animation shows the effects of edge approximation. Radial deviation tolerance For a model in an M_SHAPE_CIRCLE or M_SHAPE_ELLIPSE type of Model Finder context, you can adjust the sagitta tolerance (MmodControl() with M_SAGITTA_TOLERANCE) to limit the allowable radii deviation from the defined conic shape (circle of ellipse). Given the other specified constraints for the model, there is a certain amount of deviation that can be permitted. Using M_SAGITTA_TOLERANCE, you can restrict this amount. Essentially, M_SAGITTA_TOLERANCE establishes the search area in which to consider active edges for an occurrence at a given scale; a best fit conic is then fit within these active edges. For a model in an M_SHAPE_CIRCLE type of Model Finder context, the sagitta tolerance allows you to specify how perfectly circular you want the occurrence to be. This allows you to find circular shapes that do not have a constant radius over the full angular range of the contour. For instance, an elliptical shape could be identified as a potential occurrence if the radii variation is within the bounds specified using M_SAGITTA_TOLERANCE. More generally, the sagitta tolerance allows you to identify shapes that are elliptical (or circular) in nature, but have rough or noisy edges, such as a bottle cap, could be identified as a potential occurrence of a circle. If the occurrence in the target is expected to be perfectly circular with a constant radius across the full angular range, you could safely set the sagitta tolerance close to 0.0%. Whereas, if the typical occurrence within a target does not contain a perfectly smooth contour, such as containing rough edges, this control type should be increased from the default value of 25.0%. The following two images deal with trying to identify an elliptical shape as an occurrence of a circle model. In the image on the left, you can see that the algorithm found the edge of the ellipse but, because the selected sagitta tolerance was set too low, the center of the search area does not coincide with the center of the occurrence being sought. In the image on the right, you can see that the ellipse falls completely within the upper and lower bounds of the search area established by the sagitta tolerance, and as such the occurrence being sought is found. The model coverage for the image on the left would be relatively low, never reaching 50%. Whereas the model coverage for the image on the right would be near 100%. This is because the contour being sought is completely within the bounds of the search area defined by the sagitta tolerance for the image on the right; so, the entire contour is considered an active edge of the occurrence. For the image on the left, the bounds of the search area defined by the sagitta tolerance do not encompass the ellipse entirely, so only the portion of the contour within the bounds is considered as an active edge of the occurrence. In contrast, the fit error for the image on the left would be small, while the image on the right would have a much higher fit error. This is because the returned occurrence (best fit circle) for the image on the left coincides closely with the portion of the ellipse within the search area, whereas the returned occurrence for the image on the right only has 4 intersection points with the ellipse. The following images demonstrate a situation where the outline of a flower needs to be identified as an occurrence. In the image on the left, the sagitta tolerance was set too low, causing the algorithm to identify the outline of the petal as being the circular shape being sought. In the image on the right, the sagitta tolerance was set to an appropriate level, and the average outline of the flower was identified as an occurrence. The model coverage for the image on the left would be roughly 50% while the coverage for the image on the right would be near 100%. Much like for the elliptical example, the contour being sought is completely within the bounds of the sagitta tolerance for the image on the right; while for the image on the left, the bounds of the sagitta tolerance encompass only one petal of the flower. The fit error for the image on the left would be much lower than that for the image on the right. This is because the returned occurrence for the image on the left corresponds strongly with the portion of the flower within the search area; while for the image on the right, the returned occurrence does correspond closely with the contour being sought, but due to the nature of the contour (not perfectly circular), there will always be a fit error. The following images demonstrate cases where the sagitta tolerance was set to an appropriate level and where it was set to be too high. The image on the left demonstrates a case where the sagitta tolerance was set to an appropriate level and the occurrence of the circular shape was accurately detected. The image on the right demonstrates a case where the sagitta tolerance was set to an exceedingly high level. It can be seen that the upper bound of the sagitta tolerance covers the edge of an adjacent rectangle, and as such, the edge of the rectangle is misidentified as being a part of the occurrence being sought. Although the model coverage would be high, over 75%, in the two images above, the model coverage for the image on the right would actually be higher than that on the left. This is because the algorithm detects the edges of the rectangle as being the missing edges. There are still some edges which are missing for the model on the right (from +/- 25 o to +/- 30 o ); this means that the model coverage will never be 100%. The fit error for the image on the left would be very low since the model's active edges coincide highly with the edges of the contour being sought. In contrast, the fit error for the image on the right would be higher since the occurrence does not have as close a fit with the active edges. Aspect ratio and aspect ratio search constraint For a model in an M_SHAPE_ELLIPSE type of Model Finder context, you can set the nominal aspect ratio at which you expect to find the occurrence in the target. This is useful, for example, if an elliptical object might appear shorter because of perspective and you can't perform camera calibration. To do so, set the factor to apply to the model's aspect ratio so that it matches the nominal aspect ratio of the occurrence, using MmodControl() with M_MODEL_ASPECT_RATIO; this is referred to as the nominal aspect ratio factor. It is applied as follows. Effective aspect ratio = Nominal aspect ratio factor x (Model width/Model height) Note that to change the effective aspect ratio of the model, MIL internally changes the effective height of the model; the effective width of the model is not modified. That is, the nominal aspect ratio factor is inversely applied to the height of the model. Effective model height = Model height / Nominal aspect ratio factor If you want to search for occurrences of the model that have the established effective aspect ratio, but are wider than the original model's width, you must adjust the model's scale using M_SCALE. For a model in an M_SHAPE_ELLIPSE type of Model finder context, the occurrence's aspect ratio is calculated such that its width is the length of its longest side and its height of the shorter side, regardless of the occurrence's orientation; therefore the occurrence will always have an aspect ratio greater than or equal to 1. As such, the aspect ratio of the model, multiplied by the nominal aspect ratio factor must be greater than or equal to 1. To use the minimum allowable value for the nominal aspect ratio factor, you can set M_MODEL_ASPECT_RATIO to M_CIRCLE_ASPECT_RATIO. This will ensure that the final aspect ratio is equal to 1. You can also specify a range of aspect ratios that the occurrence can have. To do so, you specify the minimum and maximum factors with which to multiply the nominal aspect ratio factor, using MmodControl() with M_MODEL_ASPECT_RATIO_MAX_FACTOR and M_MODEL_ASPECT_RATIO_MIN_FACTOR. The minimum factor and maximum factor together determine the aspect ratio range from the nominal aspect ratio (M_MODEL_ASPECT_RATIO). Maximum effective aspect ratio = (M_MODEL_ASPECT_RATIO) x (M_MODEL_ASPECT_RATIO_MAX_FACTOR) x (Model width / Model height). Minimum effective aspect ratio = (M_MODEL_ASPECT_RATIO) x (M_MODEL_ASPECT_RATIO_MIN_FACTOR) x (Model width / Model height). These also only affect the effective height of the model. For example, if you define your model to have both a width and length of 5, the model's aspect ratio is therefore 1. Setting the M_MODEL_ASPECT_RATIO control type to 2, and leaving the M_MODEL_ASPECT_RATIO_MIN_FACTOR and M_MODEL_ASPECT_RATIO_MAX_FACTOR control types to their default values of 0.8 and 1.2 respectively, corresponds to an aspect ratio range from 1.6 to 2.4. If you defined a model having a height of 5 and a width of 10, its aspect ratio would be 2. If the M_MODEL_ASPECT_RATIO, M_MODEL_ASPECT_RATIO_MIN_FACTOR, and M_MODEL_ASPECT_RATIO_MAX_FACTOR control types are left to their default values of 1, 0.8, and 1.2 respectively, this corresponds to an aspect ratio range from 1.6 to 2.4. However, if the M_MODEL_ASPECT_RATIO control type was set to 2, and the M_MODEL_ASPECT_RATIO_MIN_FACTOR and M_MODEL_ASPECT_RATIO_MAX_FACTOR control types are still left to their default values of 0.8 and 1.2 respectively, this corresponds to an aspect ratio range from 3.2 to 4.8. Note that the range is defined as factors so that if you change the nominal aspect ratio factor (M_MODEL_ASPECT_RATIO), you do not have to modify the range settings. As the factors increase in value, the height of the effective model is reduced proportionally. Furthermore, the minimum effective aspect ratio should be greater than or equal to 1. If M_MODEL_ASPECT_RATIO_MIN_FACTOR is set such that it would lead the minimum effective aspect ratio to be less than 1, MIL will internally set the control type to M_CIRCLE_ASPECT_RATIO. Instead of excluding a candidate that falls outside the aspect ratio range, you can constrain its fit. This candidate will have its fit constrained to the closest bound of the aspect ratio range, will have its score reduced accordingly, but will still be identified as a candidate. To do so, use MmodControl() with M_SEARCH_ASPECT_RATIO_CONSTRAINT set to M_ENABLE, which is the control type's default value. When disabled, only candidates that are within the bounds established using the maximum and minimum factors can be returned as occurrences. For example, if the aspect ratio range was from 1.6 to 2.4 and M_SEARCH_ASPECT_RATIO_CONSTRAINT control type was set to M_DISABLE, a candidate with an aspect ratio of 2.6 would not be identified as a candidate. However, the candidate would be identified as a possible occurrence if the M_SEARCH_ASPECT_RATIO_CONSTRAINT control type was set to M_ENABLE; in this case, the candidate would have a reduced score, and its aspect ratio would be constrained to 2.4 (that is, reported as being 2.4). Deviation tolerance for rectangles and segments For a model in an M_SHAPE_RECTANGLE or an M_SHAPE_SEGMENT type of Model Finder context, you can adjust the deviation tolerance (M_DEVIATION_TOLERANCE) to limit the allowable deformation from the defined rectangle or segment. This sets the tolerance of the deformation of rectangles and line segments such that rectangles or segments that are not perfectly straight, or rectangles or segments that are broken up, would still be identified as potential occurrences. Given the other specified constraints for the model, there is a certain amount of deviation that can be permitted. Using M_DEVIATION_TOLERANCE, you can restrict this amount. Angle for rectangles and segments As with other model types, you can specify the nominal angle and angular range at which to search for a model in an M_SHAPE_RECTANGLE or M_SHAPE_SEGMENT Model Finder context, using MmodControl() with M_ANGLE and M_ANGLE_DELTA... control types, respectively. For an M_SHAPE_SEGMENT context, Model Finder searches for segment occurrences along contours, so the segment's angle (direction) is determined from contour's gradient angle (the direction of the most sudden change from dark to light causing the edge). The segment's angle is the angle of the gradient - 90°. Note that a rectangle at a specified angle, M_ANGLE, and a rectangle at M_ANGLE + 180° are the same rectangle. Due to the symmetry of rectangle and segment models and the search algorithm used when defined in a shape-specific context, you can search within multiple angular ranges, without defining additional contexts and performing additional searches, using M_ANGLE_MULTIPLE_RANGE. This allows you to search for occurrences at the nominal angle and at the angle perpendicular to this angle simultaneously (M_STEP_90). In the case of a segment model, you can also search for occurrences with opposite segment gradient directions (M_STEP_180). Calculations specific to angle-range search strategies are not necessary; as such, M_SEARCH_ANGLE_RANGE is not supported. A segment occurrence can run the length of a contour that transitions between 180° opposing gradient directions (for example, along an edge of a chessboard grid row), as long as part of the segment meets the angle requirements along the contour. The segment occurrence is reported to have the angle closest to the angle being sought. For example, if searching at a nominal angle of 0° and a segment along a contour transitions between 0° and 180°, the segment is returned as an occurrence and is reported to have an angle of 0°. To force Model Finder to find segment occurrences that have an appropriate angle along their entire length, enable M_SEGMENT_CONSISTENT_GRADIENT. The following animation illustrates how M_SEGMENT_CONSISTENT_GRADIENT influences what is returned as an occurrence. When searching for segments in an image with lines, each line is counted as two occurrences with opposite angles. You can restrict what is returned to one occurrence by setting MmodControl() with M_MIN_SEPARATION_ANGLE to M_DISABLE. Search settings specific to models in specialized shape contexts Approximating the edges Radial deviation tolerance Aspect ratio and aspect ratio search constraint Deviation tolerance for rectangles and segments Angle for rectangles and segments ",
      "wordCount": 2484,
      "subEntries": []
    },
    {
      "id": "UG_model-finder_Advanced_search_settings",
      "version": null,
      "title": "Advanced search settings",
      "subTitles": [
        "Polarity",
        "Separation",
        "Shared edges",
        "Fit error weighting factor"
      ],
      "location": "MIL UG P03: 2D processing and analysis",
      "pageURL": "content\\UserGuide\\model-finder\\Advanced_search_settings.htm",
      "text": " Advanced search settings In addition to the fundamental search settings, the Model Finder module also provides advanced settings that allow you to specify whether the polarity of the edges in a model differs from those in occurrences, how much or little separation between occurrences is permitted, as well as other information. Polarity The polarity of an edge indicates whether edges occur as transitions from light to dark or vice versa. When the polarity of edges in the target might be different from those of the model (for example, due to shadows), you should specify the expected polarity using MmodControl() with M_POLARITY. This control type allows you to specify whether edges present in the model and in the occurrence have the same, the reverse, either of these, or a mixture of both polarities. The default polarity setting for a model in an M_GEOMETRIC or M_GEOMETRIC_CONTROLLED type of Model Finder context is M_SAME. For a model in an M_SHAPE_CIRCLE, M_SHAPE_ELLIPSE, or M_SHAPE_RECTANGLE type of Model Finder context, the default polarity setting is M_SAME_OR_REVERSE. Note that for a model in an M_SHAPE_SEGMENT type of Model Finder context, M_POLARITY is not supported. The polarity setting can be useful when dealing with adverse lighting conditions where dark shadows can cause edges to vary in polarity. Separation You can specify the minimum amount of separation from other occurrences (of the same model) for an occurrence to be considered distinct (a match). In essence, this determines the amount of overlap by different model occurrences that is possible. You can set the minimum separation for five criteria, which are: the X-position, Y-position, angle, scale, and the aspect ratio. These can be set for each individual model in your Model Finder context. For an occurrence to be considered distinct from another, only one of the minimum separation conditions needs to be met. For example, if the minimum separation in terms of angle is met, then the occurrence is considered distinct, regardless of the separation in position or scale. However, each of these separation criteria can be disabled (M_DISABLE) so that it is not considered when determining a valid occurrence. DISTINCT OCCURRENCE = (Separation in X) OR (Separation in Y) OR (Separation in Angle) OR (Separation in Scale) OR (Separation in Aspect Ratio) The minimum positional separation (MmodControl() with M_MIN_SEPARATION_X and M_MIN_SEPARATION_Y) determines the minimum distance between the found positions of two occurrences of the same model. This separation is specified as a percentage of the model size at the nominal scale (M_SCALE). The minimum value that you can set for M_MIN_SEPARATION_X and M_MIN_SEPARATION_Y is 0, which means that there is no minimum distance needed for occurrences to be distinct; all occurrences will be considered distinct regardless of other separation conditions. You can set very large values for M_MIN_SEPARATION_X and M_MIN_SEPARATION_Y; if they are large enough, for example, if the values are larger than the size of the image, it is equivalent to setting this separation condition to M_DISABLE since this condition will never be met. In this case, whether an occurrence is distinct or not will depend on the other separation conditions. The minimum angular separation (M_MIN_SEPARATION_ANGLE) determines the minimum difference in angle between occurrences. This value is specified as an absolute angle value. The default value is 10.0 o . The minimum value that you can set for M_MIN_SEPARATION_ANGLE is 0, which means that there is no minimum difference in angle needed for occurrences to be distinct; all occurrences will be considered distinct regardless of other separation conditions. The maximum absolute angle difference is 180 degrees. For a diagram of the delta convention used in MIL, see the Angle and angular range subsection of the Position, angle, and scale section earlier in this chapter. If the angle is larger than 180, an error will be returned. At 180 degrees, it is equivalent to setting this separation condition to M_DISABLE. In this case, whether an occurrence is distinct or not will depend on the other separation conditions. It is to be noted that M_MIN_SEPARATION_ANGLE is not supported for models defined with an M_SHAPE_CIRCLE type of Model Finder context. The minimum scale separation (M_MIN_SEPARATION_SCALE) determines the minimum difference in scale between occurrences, as a scale factor. The default value is 1.1. The minimum value that you can set for M_MIN_SEPARATION_SCALE is 1, which means that there is no minimum difference in scale needed for occurrences to be distinct; all occurrences will be considered distinct regardless of other separation conditions. The maximum value that you can set for M_MIN_SEPARATION_SCALE is 4, which is equivalent to setting this separation condition to M_DISABLE for an M_GEOMETRIC or an M_GEOMETRIC_CONTROLLED type of Model Finder context. In this case, whether an occurrence is distinct or not will depend on the other separation conditions. The minimum aspect ratio separation (M_MIN_SEPARATION_ASPECT_RATIO) determines the minimum difference in aspect ratio between occurrences. The default value is 1.1. The minimum value that you can set for M_MIN_SEPARATION_ASPECT_RATIO is 1, which means that there is no minimum difference in the aspect ratio needed for occurrences to be distinct; all occurrences will be considered distinct regardless of other separation conditions. The maximum you can set for M_MIN_SEPARATION_ASPECT_RATIO is 4. It is to be noted that M_MIN_SEPARATION_ASPECT_RATIO is only supported for a model defined in an M_SHAPE_ELLIPSE or M_SHAPE_RECTANGLE type of Model Finder context. The five criteria are summarized below in equation form. The following example illustrates the five separation criteria; an arrow represents two occurrences of the same model and the various types of separation possible. It should be noted that for a model to be found, the number of visible edges in the occurrence must be sufficient to provide a match according to your acceptance levels. In addition, to find occurrences of a model in an M_SHAPE_RECTANGLE type of Model Finder context, at least a portion of each side of the rectangle must be visible; that is, the model coverage on any side cannot be 0. You can control the minimum coverage on each side using MmodControl() with M_MIN_SIDE_COVERAGE. Shared edges You can choose to allow occurrences to share edges, using MmodControl() with M_SHARED_EDGES set to M_ENABLE. Otherwise, edges that can be part of more than one occurrence are considered part of the occurrence with the greatest score. For example, in the illustration below, two occurrences of two simple models share a common edge. With shared edges enabled, these occurrences would have perfect scores. However, with shared edges disabled (default), the shared edge would be considered part of occurrence 1, since it has the greater score; the score of occurrence 2 would be subsequently reduced by the loss of the shared edge in the score calculation. For models in an M_SHAPE_CIRCLE, M_SHAPE_ELLIPSE, or M_SHAPE_SEGMENT type of Model Finder context, M_SHARED_EDGES is not supported. Fit error weighting factor The fit error weighting factor, MmodControl() with M_FIT_ERROR_WEIGHTING_FACTOR, determines the relative importance of the fit error when calculating the match score and the target score. The higher the factor, the greater the influence that the fit error has on the resulting score and target score for an occurrence (see the Determining what is a match section earlier in this chapter). Setting this factor to 0.0 means that the fit error is not considered in the score calculation, so the score is equal to the coverage score. Setting this factor to 100.0 means that the fit error has a maximum contribution in the score. The default value for M_FIT_ERROR_WEIGHTING_FACTOR is 25.0%. Advanced search settings Polarity Separation Shared edges Fit error weighting factor ",
      "wordCount": 1249,
      "subEntries": []
    },
    {
      "id": "UG_model-finder_Global_context_settings",
      "version": null,
      "title": "Global context settings",
      "subTitles": [
        "Setting the search speed ",
        "Accuracy",
        "Timing out your search",
        "First and last levels"
      ],
      "location": "MIL UG P03: 2D processing and analysis",
      "pageURL": "content\\UserGuide\\model-finder\\Global_context_settings.htm",
      "text": " Global context settings The global search settings of a Model Finder context determine the strategy used to search for all of the context's models in the target. These settings directly affect the speed and robustness of the search. The context settings can be adjusted to fit your individual application's needs, using MmodControl() with the index parameter set to M_CONTEXT. We recommend experimenting with different settings to find the particular settings that provide your application with the necessary robustness. This section discusses some of the Model Finder context settings that were not previously discussed in this chapter. Setting the search speed You can specify the algorithm's search speed for an M_GEOMETRIC or M_GEOMETRIC_CONTROLLED type of Model Finder context, using MmodControl() with M_SPEED. The speed can be set to M_MEDIUM (default), M_HIGH, or M_VERY_HIGH. When you preprocess the context, MIL analyzes the patterns of the models and determines which shortcuts are appropriate for the search speed setting. At higher search speed settings, the search can take all reasonable shortcuts; therefore, when possible, the search is performed faster than at lower speeds. You can typically use higher speed settings when high accuracy is not an issue; this is because increasing the speed might affect the robustness, as well as the accuracy, of the search. Accuracy You can set the positional accuracy for your search, using MmodControl() with M_ACCURACY. For an M_GEOMETRIC or M_GEOMETRIC_CONTROLLED type of Model Finder context, it can be set to: M_LOW. M_MEDIUM. M_HIGH. Note that the accuracy varies depending on the image quality (for example, saturation, noise level, and dynamic range) and with respect to the quality of the contours (for example, smooth, wavy, and broken). With that being said, with good target image conditions, you can expect an accuracy of 0.1 sub-pixel accuracy. With excellent target image conditions (high dynamic range, low noise, no distortion, high resolution), you can greatly improve the sub-pixel accuracy by up to 1/50 th of a pixel. The default accuracy setting for an M_GEOMETRIC or M_GEOMETRIC_CONTROLLED type of Model Finder context is M_MEDIUM. This control type is not supported for an M_SHAPE_... type of Model Finder context. You can consider an M_SHAPE_... type of Model Finder context to have an equivalent accuracy setting of M_MEDIUM as well. Note that increasing the accuracy can slightly reduce the search speed. Timing out your search In time critical applications, you can set a time limit in milliseconds for Model Finder to find occurrences of the specified models, using MmodControl() with M_TIMEOUT. After the time limit, the search will stop even if the required number of occurrences is not found. Results are still returned for those occurrences found up to the timeout. However, it is not possible to predict which occurrences will be found before the time limit is reached. The default value is 2000 msecs. You can use MmodGetResult() with M_TIMEOUT_END to check whether the timeout limit has been reached. First and last levels Model searches use a hierarchical method to reduce the time needed to complete the search. Using this method, Model Finder produces a series of smaller, lower-resolution versions of both the target and the models, and the search begins on a much-reduced scale. This series of subsampled images is sometimes called a resolution pyramid because of the shape formed when the different resolution levels are stacked on top of each other. The resolution level for the initial and final stages of the search are typically set automatically. These default levels usually provide the best results for search operations, and you should leave them in most circumstances. If required for an M_GEOMETRIC or M_GEOMETRIC_CONTROLLED type of Model Finder context, you can set the resolution level for the initial and final stages of the search, using MmodControl() with M_FIRST_LEVEL or M_LAST_LEVEL. You can set the first and last levels to any integer value from 0 to 7. Level 0 is the original target size and each higher level is half the size (and resolution) of the previous one. The higher the level, the faster the initial search; however, the search will be less reliable at higher levels. Very small models and search regions cannot be subsampled as many times as large ones. If you specify too high a level, the highest practical level will be used. These control types are not supported for an M_SHAPE_... type of Model Finder context. Global context settings Setting the search speed Accuracy Timing out your search First and last levels ",
      "wordCount": 742,
      "subEntries": []
    },
    {
      "id": "UG_model-finder_Speeding_up_the_search",
      "version": null,
      "title": "Speeding up the search",
      "subTitles": [
        "Adjust the search speed of the algorithm",
        "Disable calculations specific to range search strategies",
        "Define several models with different expected angles",
        "Limit the position range",
        "Limit the search scale",
        "Specify the exact number of expected occurrences",
        "Clean up your model and your target",
        "Change the search levels",
        "Use an appropriate context type for your search"
      ],
      "location": "MIL UG P03: 2D processing and analysis",
      "pageURL": "content\\UserGuide\\model-finder\\Speeding_up_the_search.htm",
      "text": " Speeding up the search There are some things you should do to help ensure that your search runs as quickly as possible: Adjust the search speed of the algorithm. Disable calculations specific to range search strategies, if possible. Define several models with different expected angles. Limit the position range. Limit the search scale. Specify the exact number of expected occurrences. Clean up your model. Change the search levels (for controlled geometric Model Finder contexts only). Use an appropriate context type for your search. Adjust the search speed of the algorithm You can control the search speed of the algorithm used by your Model Finder context, using MmodControl() with M_SPEED. When you preprocess the context, MIL analyzes the patterns of the models and determines which shortcuts are appropriate for the search speed setting. At higher search speed settings, the search can take all reasonable shortcuts; therefore, when possible, the search is performed faster than at lower speeds. You can typically use higher speed settings when high accuracy is not an issue; this is because increasing the speed might affect the robustness and accuracy. Disable calculations specific to range search strategies If you expect that the occurrences sought are close to the specified nominal position, angle, or scale (for example, in a registration application), you can try disabling the calculations specific to the search strategies for the corresponding range (MmodControl() with M_SEARCH_POSITION_RANGE, M_SEARCH_ANGLE_RANGE, and/or M_SEARCH_SCALE_RANGE) to see if Model Finder can still find the required occurrences. Disabling one or more of these calculations might speed up the search depending on the model and the target. Define several models with different expected angles The actual angle of the occurrence does not affect search speed. If you need to search for a model at discrete angles only (for example, at intervals of 90 degrees), it is typically more efficient to define several models with different expected angles, than to search through the full angular range. Limit the position range Limiting the position range of the model to the minimum required generally decreases the search time. Set the position range of each model to the minimum needed, using MmodControl() with the M_POSITION_DELTA_NEG_X, M_POSITION_DELTA_NEG_Y, M_POSITION_DELTA_POS_X, and M_POSITION_DELTA_POS_Y control types. If the occurrence must be at a specific position, set these control types to zero. Limit the search scale It is best to set a fixed scale at which to search for occurrences of a model, instead of searching in a range. Sometimes, you must search for model occurrences that can vary in size; in these cases, enabling MmodControl() with M_SEARCH_SCALE_RANGE might be necessary. In these cases, keep the scale range as small as possible to avoid slowing down your search. You should not use the scale range to cover different expected scales at different positions. In this case, it is typically more efficient to define several models with different expected scales. This is because a large scale range could potentially slow down your operation; as well, you could find unwanted occurrences. Specify the exact number of expected occurrences If you know the exact number of occurrences for which to search, specify it using MmodControl() with M_NUMBER. This will typically reduce search time. If you search for more occurrences than required, the search might take longer than necessary. Clean up your model and your target Typically, reducing the number of unwanted edges in your models and your target will accelerate your search. There are several different ways to clean up your model and your target: Reduce the noise. Noise in your models can cause inaccurate results. In addition, noise in your models and/or your target can also increase the length of time for a search. The most efficient way to reduce noise is to use the MmodControl() M_SMOOTHNESS and M_DETAIL_LEVEL control types. These affect all image-type models in your context, as well as the target when it is an image. Use masking. You can use MmodMask() to mask regions of the model. Using MmodMask(), you can effectively remove areas of the model from consideration. This might help speed up your search. Use the Edge Finder module. You can use the Edge Finder module to extract only the required edges from the image that you want to use as your model source or target, and then use the Edge Finder results as the model source or target instead. Limit the number of active edgels MIL processes in the target. By calling MmodControl() with M_ACTIVE_EDGELS, you can adjust the degree to which MIL processes edgels in the target (MmodFind()) for a geometric (MmodAlloc() with M_GEOMETRIC) type of Model Finder context. The target edgels that MIL processes are considered active. By limiting the active edgels in the target, you can speed up the search. To draw the target's active edgels, use MmodDraw() with M_DRAW_ACTIVE_EDGELS. Change the search levels It is possible to speed up the search by adjusting the resolution levels for the search. This can be done using MmodControl() with M_FIRST_LEVEL and M_LAST_LEVEL. This should be done cautiously; their default setting (M_AUTO) determines the resolution levels automatically and usually provides the best results for the search operation. Use an appropriate context type for your search As has been discussed throughout this chapter, certain types of contexts have advantages and disadvantages with regards to the type of model being sought in the target. For instance, if the occurrences in a target vary in scale and have various distinct angles, an M_GEOMETRIC type of Model Finder context would be appropriate. Whereas, if the occurrences in the targets have a nominal difference in scale and angle, but have a high geometric complexity, the M_GEOMETRIC_CONTROLLED type of Model Finder context could be the most appropriate. When searching for general elliptical shapes, the M_SHAPE_ELLIPSE type of Model Finder context will search for a range of aspect ratios (M_MODEL_ASPECT_RATIO) relative to the nominal aspect ratio, and will typically provide better and/or faster results than the two previously mentioned context types. If the ellipses are in fact circles, the M_SHAPE_CIRCLE type of Model Finder context will typically provide better and/or faster results then the other types of contexts. Speeding up the search Adjust the search speed of the algorithm Disable calculations specific to range search strategies Define several models with different expected angles Limit the position range Limit the search scale Specify the exact number of expected occurrences Clean up your model and your target Change the search levels Use an appropriate context type for your search ",
      "wordCount": 1073,
      "subEntries": []
    },
    {
      "id": "UG_model-finder_Retrieving_and_analyzing_results",
      "version": null,
      "title": "Retrieving and analyzing results",
      "subTitles": [
        "Possible results",
        "Drawing results"
      ],
      "location": "MIL UG P03: 2D processing and analysis",
      "pageURL": "content\\UserGuide\\model-finder\\Retrieving_and_analyzing_results.htm",
      "text": " Retrieving and analyzing results After having successfully located your model occurrences in your target using MmodFind(), you can extract the required results from your result buffer using MmodGetResult(). Possible results You can retrieve several types of results with the Model Finder module. These results provide considerable information on the nature of the occurrence found. In addition to the score, target score, model coverage, target coverage, fit error, and forward/reverse transformation coefficients discussed previously in this chapter, results can be returned for: Number of occurrences. Index or user label of occurrences. Position X and position Y. Scale. Polarity. Angle. Whether the timeout limit has been reached. You can specify whether to retrieve results for all edges of the target in the region of the occurrence, or only the edges in the occurrence that correspond to the model's active edges, using M_TARGET and M_MODEL, respectively. Results are returned in descending order of match score, such that the result with the highest score is returned first. Generally, you should first retrieve the total number of occurrences found for all the models in the Model Finder context, to ascertain the size of the result array needed. Note that results can be returned for the entire context; the model index (M_INDEX result type) is used to differentiate results between models. For a complete description of all possible results, refer to the description of MmodGetResult() in the MIL Reference. Note that certain results types are only supported with certain types of models, or result buffers. For instance, M_RADIUS is only supported for M_CIRCLE type models, while the M_ASPECT_RATIO result type is not supported for an M_SHAPE_CIRCLE type of Model Finder result buffer. Occurrences are indexed with positive integers starting from 0. Drawing results The MmodDraw() function provides several operations for drawing results in any specified image buffer or 2D graphics list. You can also choose to draw in the display's overlay buffer. By drawing into the display's overlay buffer, you can annotate an image non-destructively (see the Annotating the displayed image non-destructively section of Chapter 25: Displaying an image). You can also draw zoomed results. You can draw a model box, or a bounding box around the occurrence, the active edges of the model, the edges of the result occurrence, or draw a cross-like symbol at the model's reference axis origin or occurrence position. Typically, all drawing operations in MmodDraw() can be combined; you can therefore draw multiple results simultaneously. For example, to draw the edges of the result occurrence and its position, you would specify M_DRAW_EDGES + M_DRAW_POSITION. The following code snippet shows how to combine drawing operations using MIL constant combination: MmodDraw(M_DEFAULT, MilResult, MilOverlayImage, M_DRAW_EDGES+M_DRAW_POSITION, M_DEFAULT, M_DEFAULT); When drawing results, you can draw the active edges of the model transformed at the occurrence position, or the edges of the target in the region of the occurrence. You can also draw a zoomed version of results that were obtained from a specified region in the target. To do so, specify the appropriate values for the MgraControl() M_DRAW_OFFSET_X, M_DRAW_OFFSET_Y, M_DRAW_ZOOM_X, and M_DRAW_ZOOM_Y control types. The relative origin values must be specified in pixels, and are relative to the coordinates of the top-left corner of the region in the model source, while the scale values specify the X- and Y-scaling factors used to fill the destination buffer. For more information on zooming, see the Defining and adding models to your Model Finder context section earlier in this chapter. You can use a previously allocated 2D graphics context (see Chapter 26: Generating graphics) to control the drawing color, or use the default 2D graphics context (M_DEFAULT). Retrieving and analyzing results Possible results Drawing results ",
      "wordCount": 608,
      "subEntries": []
    },
    {
      "id": "UG_model-finder_Calibration",
      "version": null,
      "title": "Camera calibration",
      "subTitles": [
        "Requirements",
        "Models and their camera calibration context",
        "Setting the aspect ratio control",
        "Using transformation coefficients with calibrated images"
      ],
      "location": "MIL UG P03: 2D processing and analysis",
      "pageURL": "content\\UserGuide\\model-finder\\Calibration.htm",
      "text": " Camera calibration The Model Finder module supports camera calibration. If the target is calibrated, matching is performed and results are calculated in the world coordinate system, compensating for any image distortion. Camera calibration is performed transparently, without the need for any setting adjustments. Requirements To search in a calibrated target, all models in an M_GEOMETRIC or M_GEOMETRIC_CONTROLLED type of Model Finder context must also be calibrated. To calibrate image-type, result-type, and merge-type models, use calibrated model sources or associate a camera calibration context with the models, using MmodControl() with M_ASSOCIATED_CALIBRATION. Note that defining models from calibrated model sources and adjusting individual model settings is done in pixels. Synthetic models in these types of contexts can be used with a calibrated target if defined in real-world units and associated with the camera calibration context of the target. The models in a M_GEOMETRIC or M_GEOMETRIC_CONTROLLED context can be associated with different camera calibration contexts; however, you should ensure that all camera calibration contexts use the same absolute coordinate system (otherwise, results will be skewed). Targets must also be calibrated using the same absolute coordinate system as the models in a M_GEOMETRIC or M_GEOMETRIC_CONTROLLED context. For a synthetic model in an M_SHAPE_... type of Model Finder context, the model is considered to have the same units as the target. If the target is calibrated, the model will be interpreted in world units. Conversely, if the target does not have a camera calibration context associated with it, the model will be interpreted in pixel units. The model will be defined in the same coordinate system as the target. You cannot associate a calibration context with the model. Targets can be either physically corrected or not, without affecting the robustness of the search. Targets can be grabbed from any number of cameras, each with its own camera calibration context, as long as the same absolute coordinate system has been used. For example, if a model has been extracted from a model source image taken using camera A, the model can be used to locate occurrences in a target image grabbed by camera B or camera C (whether or not the image has been physically transformed) since the same absolute coordinate system has been used to calibrate all images. MIL will transparently convert between camera calibration contexts. If the target is calibrated, results can be retrieved in real-world or pixel units. Note, however, in the presence of distortion some results are meaningless when converted from real-world to pixel units (for example, angle, scale, and transformation coefficient results). For example, if a model appears warped in the target, but the camera calibration context of the target compensates for this during the model search, the resulting angle is meaningful in the real-world coordinate system, and meaningless in the pixel coordinate system. When using MmodDraw() to draw features from a calibrated model or results from a calibrated target, the destination drawing buffer must also be calibrated, using the same absolute coordinate system, otherwise annotations will be skewed. MIL transparently takes into account the camera calibration when drawing these annotations. Models and their camera calibration context Camera calibration contexts associated with the models (MmodControl() with M_ASSOCIATED_CALIBRATION) can be saved with the Model Finder context using MmodSave() or MmodStream() with M_WITH_CALIBRATION. In this case, you must also use M_WITH_CALIBRATION when restoring the context (MmodRestore() or MmodStream()). If you do not save/restore the camera calibration contexts, you must re-associate them to each model after restoring the context. Note that the camera calibration contexts associated with synthetic models are not saved or restored by MmodSave(), MmodRestore(), or MmodStream(). When you use M_WITH_CALIBRATION, the camera calibration is saved or restored in/from the same file as the Model Finder context and cannot be managed independently from the context. When the context is freed, the camera calibrations are automatically freed as well. If necessary, you can disassociate a camera calibration context from a model, using MmodControl() with M_ASSOCIATED_CALIBRATION set to M_NULL. This can be useful if you want to use a calibrated model with an uncalibrated target. Setting the aspect ratio control When dealing with aspect ratio distortion, you can use MmodControl() with M_ASPECT_RATIO to compensate for the distortion, if the target is not calibrated. This will allow you to avoid using a camera calibration context during the search. This will not compensate for aspect ratio distortion in the model, so this method is mostly useful when searching for synthetic models in a target that has aspect ratio distortion. This is not supported for a model in an M_SHAPE_... type of Model Finder context. When performing the search, results will be returned for the corrected target coordinate system. The results will be converted to the original target coordinate system if you draw them using MmodDraw(). Using transformation coefficients with calibrated images You can use forward and reverse transformation coefficients if you want to map points of interest other than the reference axis origin (see the Forward and reverse transformation coefficients subsection of the Customizing search settings section earlier in this chapter). When using a calibrated model and a calibrated target, forward and reverse transformation coefficients (see MmodGetResult()) are given for the real world. This means that they can be used to convert any coordinates in the model world coordinate system to the corresponding coordinates in the target world coordinate system for an occurrence or vice versa. To get the forward or reverse transformation coefficients, use MmodGetResult() with M_..._FORWARD or with M_..._REVERSE, respectively. Apply the transformation coefficients to the coordinates using the following equations: x d = A x s + B y s + C y d = E x s + F y s + D For models that do not have an M_ASPECT_RATIO result type, note the following: E = -B F = A where A, B, C, D, E, and F are the transformation coefficients (forward or reverse). x s and y s specify the source coordinates (with respect to the origin of the model coordinate system for a forward transformation or target coordinate system for a reverse transformation); x d and y d are the destination coordinates (with respect to the origin of the target coordinate system for a forward transformation or model coordinate system for a reverse transformation). Once the transformation coefficients have been applied to the coordinates, you can convert the real-world coordinates back to pixel coordinates using McalTransformCoordinate(). These coordinates can be used to determine equivalent pixel positions in the model image and target image. After the transformation, you can draw the point at the equivalent positions in the model image and the target image using one of the Mgra...() functions. Note that the Mgra...() functions can also take the coordinates of the point in world units if you set MgraControl() with M_INPUT_UNITS to M_WORLD. See the image below for an example of a forward transformation. Camera calibration Requirements Models and their camera calibration context Setting the aspect ratio control Using transformation coefficients with calibrated images ",
      "wordCount": 1159,
      "subEntries": []
    },
    {
      "id": "UG_model-finder_Geometric_Model_Finder_example",
      "version": null,
      "title": "Geometric Model Finder example",
      "subTitles": null,
      "location": "MIL UG P03: 2D processing and analysis",
      "pageURL": "content\\UserGuide\\model-finder\\Geometric_Model_Finder_example.htm",
      "text": " Geometric Model Finder example The Model Finder example, MMod.cpp illustrates how the model can be used with the following source images: Specifically, MMod.cpp shows how to define a Model Finder context with a single model, as well as with several models, and find these models in a target image. mmod.cpp To run this example, use the Matrox Example Launcher in the MIL Control Center. Geometric Model Finder example ",
      "wordCount": 70,
      "subEntries": []
    }
  ]
}]