[{
  "id": "UG_meas",
  "version": "2024020714",
  "title": "Measurement",
  "subTitles": null,
  "location": "MIL UG P03: 2D processing and analysis",
  "pageURL": "content\\UserGuide\\meas\\ChapterInformation.htm",
  "text": " Chapter 19: Measurement This chapter describes how to use the MIL Measurement module to find and measure image characteristics (referred to as markers). MIL Measurement module Steps to finding and obtaining measurements of markers Basic concepts for the MIL Measurement module Markers Marker types A multiple-occurrence marker Search algorithm First derivative filter Minimum variation Retrieving and drawing edge information Search region Box search region Setting the size and position of the search region Using drawings to verify the search region placement Marker orientation and search direction Search region clipping Setting the angle of the box search region Multiple-angle search for a marker Determining the rotation tolerance of a marker Subregions of the box search region Ring search region Placing the ring search region Subregions of the ring search region Marker characteristics Essential characteristics Score characteristics Edge markers: basic characteristics that should be specified Polarity Minimum edgevalue Edge markers: advanced characteristics that can be specified Essential characteristics Maximum association distance of subedges Minimum variation Score characteristics Strength score Contrast score Position score Stripe markers: basic characteristics that should be specified Polarity Stripe markers: advanced characteristics that can be specified Essential characteristics Inclusion point Maximum association distance of subedges Score characteristics Edges inside a stripe marker Stripe width Circle markers: basic and advanced characteristics that should or can be specified Essential characteristics Polarity Maximum association distance of subedges Score characteristics Radius Multiple-occurrence marker characteristics Score characteristics Setting limits Using score characteristics Final score Lowest possible score and score-offset Search results Finding the marker and taking measurements Edge measurements taken by the find operation Line equation (mean line) Angle Length Position and reference position Intersection point An edge's start, end, and width (based on the intensity profile) An edge peak's maximum/minimum position and width (based on the first derivative) Stripe measurements taken by the find operation Line equation (mean line) Angle Length Position and reference position Stripe width Maximum association distance of subedges Circle measurements taken by the find operation Position and reference position Maximum association distance of subedges Radius Drawing Measurements between two markers Steps to taking measurements between two markers Specifying the measurement context and control settings Calculating with multiple-occurrence markers Angle Line equation and distance Measurement examples Circle markers and advanced settings ",
  "wordCount": 374,
  "subEntries": [
    {
      "id": "UG_meas_MIL_Measurement_module",
      "version": null,
      "title": "MIL Measurement module",
      "subTitles": null,
      "location": "MIL UG P03: 2D processing and analysis",
      "pageURL": "content\\UserGuide\\meas\\MIL_Measurement_module.htm",
      "text": " MIL Measurement module The MIL Measurement module allows you to find sets of markers in an image based on differences in pixel intensities. Upon finding a marker, such as an edge, stripe, or circle, the module returns its spatial reference position, as well as analytical measurements such as its width and angle. The module also allows you to create point markers at explicit locations, and to take a variety of measurements between any two markers. You can use the Measurement module to perform numerous types of imaging tasks. For example, you can find stripes that represent the conductive traces on printed circuit boards (PCBs) or pins protruding from chips and measure their angle and width, as well as the distance between them. The Measurement module relies on a one-dimensional analysis. As such, it has several advantages over other modules, such as Pattern Matching, when locating relatively simple image characteristics; it is independent of lighting, more tolerant of slight differences, and much faster. To help locate the marker in an image, you can define its essential characteristics, such as the required polarity and location. The more precisely you define the characteristics of a marker, the more likely MIL can distinguish it from other similar (though unwanted) aspects of the image. If necessary, MIL can also further distinguish a marker by calculating scores according to how well some of its characteristics are represented in the image; the higher the score, the more likely the marker found is the one you want. The Measurement module can operate on 8-bit or 16-bit unsigned grayscale image buffers. Measurements are made with subpixel accuracy and results can be returned in pixels or real-world units. For more information, see Chapter 28: Calibrating your camera setup. MIL Measurement module ",
      "wordCount": 293,
      "subEntries": []
    },
    {
      "id": "UG_meas_Steps_to_finding_and_obtaining_measurements_of_markers",
      "version": null,
      "title": "Steps to finding and obtaining measurements of markers",
      "subTitles": null,
      "location": "MIL UG P03: 2D processing and analysis",
      "pageURL": "content\\UserGuide\\meas\\Steps_to_finding_and_obtaining_measurements_of_markers.htm",
      "text": " Steps to finding and obtaining measurements of markers The following steps provide a basic methodology for using the MIL Measurement module: Allocate an edge, stripe, or circle marker buffer. For a multiple-occurrence marker, set the number of occurrences of the edge or stripe. You can also allocate a point marker buffer or a multiple-point marker buffer. Points are not found, they are explicitly set and typically used as a reference marker. In the marker buffer, specify the search region for the marker and set the marker's essential characteristics. Optionally, set a score characteristic for an edge, stripe, or circle marker. Note that preprocessing operations (such as filtering) can cause the location of edges to shift slightly. If precise edge location and measurement are crucial to your application, keep preprocessing operations to a minimum. Grab or load a target image. Optionally, preprocess it to improve its quality. Find the marker (defined in the marker buffer) in the target image and calculate measurements. Note that marker results are stored in the marker buffer, but they are stored separately. Read the results and, if necessary, annotate an image (for example, the original target image) with them. You can also draw the specified chacteristics of the requested marker (rather than the marker characteristics found in the target image). Free all your allocated objects, using MmeasFree(), unless M_UNIQUE_ID was specified during allocation. In general, the first two steps are performed once, while steps 3 to 5 are repeated as required. Note that you can avoid the first two steps by saving an initialized marker buffer on disk and restoring it when needed, using MmeasSaveMarker(), MmeasRestoreMarker(), or MmeasStream(). Saving a marker buffer stores all of the marker settings, but does not save any found marker results. You can also use MmeasCalculate() to take measurements between two markers. For more information, see the Measurements between two markers section later in this chapter. Steps to finding and obtaining measurements of markers ",
      "wordCount": 325,
      "subEntries": []
    },
    {
      "id": "UG_meas_Basic_concepts",
      "version": null,
      "title": "Basic concepts for the MIL Measurement module",
      "subTitles": null,
      "location": "MIL UG P03: 2D processing and analysis",
      "pageURL": "content\\UserGuide\\meas\\Basic_concepts.htm",
      "text": " Basic concepts for the MIL Measurement module The basic concepts and vocabulary conventions for the MIL Measurement module are: Characteristic. An identifying quality of a marker, such as its position. Edge. A curve that delineates a boundary, which can be established from intensity transitions in an image. Edge peak. The highest edgevalue among those for which the edge profile rises above and then falls below the minimum edgevalue threshold on both sides. Edge profile. The normalized first derivative of the intensity profile over the length of the search region for marker. Edge strength. The greatest edgevalue of an edge. Edgevalue. A value that represents the change at a given location in the intensity profile. MIL establishes edgevalues by applying a first derivative filter to the intensity profile of the pixels in the search region. MIL normalizes the filter's output according to the number of pixels and the maximum pixel value possible. Intensity profile. A projection of the pixels bounded by the two-dimensional search region into a one-dimensional pixel intensity summation. In the case of the Measurement module, the region is the search region. Marker. The set of image characteristics defining what to search for, or what to explicitly place, in a target image. The MIL Measurement module allows you to search for edge markers, stripe markers, and circle markers. You can also explicitly place point markers. Marker occurrence. An instance of the marker found in the target image. Orientation. The expected alignment of the marker's occurrences, relative to the search region. The orientation can be horizontal, vertical, or any. Search direction. The direction in which to search for the marker's occurrences in the search region. The search direction is perpendicular to the specified orientation of the marker. Search region. The general region of the target image in which the find operation can search for a marker occurrence. Subregions. Sections that subdivide the search region. If subregions exist, they define where to search for a marker occurrence. Target image. The image in which to define the search region and find the marker. Basic concepts for the MIL Measurement module ",
      "wordCount": 350,
      "subEntries": []
    },
    {
      "id": "UG_meas_Markers",
      "version": null,
      "title": "Markers",
      "subTitles": [
        "Marker types",
        "A multiple-occurrence marker"
      ],
      "location": "MIL UG P03: 2D processing and analysis",
      "pageURL": "content\\UserGuide\\meas\\Markers.htm",
      "text": " Markers To take any type of measurement with the MIL Measurement module, you must first allocate a marker buffer and initialize it with the definition (image characteristics) of the marker for which to search. Allocate the marker buffer using MmeasAllocMarker() and initialize it using MmeasSetMarker(). Each marker buffer can define the characteristics for only one specified type of marker in the target image. Marker types There are four types of markers: Point marker. A marker consisting of a single point or multiple points. You cannot search for point markers, but you can explicitly place them at required locations as reference positions and use them in calculations involving two markers. You can, for example, use point markers to represent positional results from a previous pattern matching or blob analysis operation. Edge marker. A marker consisting of an edge or multiple edges. In an image, edges are curves that delineate a boundary, which can be established from intensity transitions. Stripe marker. A marker consisting of a stripe (two edges) or multiple stripes. The edges of a stripe marker do not have to be parallel. Circle marker. A marker consisting of a single circle (a circular edge). A multiple-occurrence marker The Measurement module allows you to define a multiple-occurrence edge, stripe, or point marker. For edges and stripes, this allows you to search for multiple instances of the same image characteristics. You can specify the number of edges or stripes to locate, or the number of points to define, using MmeasSetMarker() with M_NUMBER; you cannot define a multiple-occurrence circle marker. The following example illustrates four occurrences of a stripe marker. By searching for a multiple-occurrence marker, you can take global measurements, and then compare them for conformity. For example, you can search for a multiple-occurrence marker to verify that a series of presumed-identical pins are actually of equal width or that the spacing between the pins is within established limits. Note that to define a multiple-occurrence marker, only one set of marker characteristics is specified, but MIL searches for a specified number of instances of the same characteristics. Markers Marker types A multiple-occurrence marker ",
      "wordCount": 353,
      "subEntries": []
    },
    {
      "id": "UG_meas_Search_Algorithm",
      "version": null,
      "title": "Search algorithm",
      "subTitles": [
        "First derivative filter",
        "Minimum variation",
        "Retrieving and drawing edge information"
      ],
      "location": "MIL UG P03: 2D processing and analysis",
      "pageURL": "content\\UserGuide\\meas\\Search_Algorithm.htm",
      "text": " Search algorithm To find an edge, stripe, or circle marker in an image, the MIL Measurement module's search algorithm performs the following general steps. Although these steps focus on how MIL establishes an edge marker, they also relate to how MIL establishes stripe and circle markers; fundamentally, MIL uses the same algorithm to establish each edge of a stripe or the edge of a circle. Establishes the intensity profile of the search region. To establish the intensity profile, the algorithm projects the pixels bounded by the two-dimensional search region (or each subregion) into a one-dimensional pixel intensity summation. The algorithm performs the summation according to the search region's origin and the direction of the search, and stores the results in an internal projection buffer. In the following example, each sum represents the intensity of all the pixels in its vertical column. Establishes the edgevalue of each intensity profile value. The algorithm establishes the edgevalue of each intensity profile value by applying a first derivative filter to the internal projection buffer containing the pixel intensity summation. The filter's output is normalized according to the number of pixels involved in each summation (for a box search region, this corresponds to the box height or width, depending on the search direction) and the maximum pixel value possible for the specified image buffer. The greater the difference in neighboring intensity profile values, the higher the edgevalue. An edgevalue of 100 represents the most difference, while an edgevalue of 0 represents no difference. The following is an example of a first derivative representation of an intensity profile. The normalized first derivative of the intensity profile is referred to as the edge profile. Identifies valid edgevalues. To establish the occurrence of a marker (edge), the algorithm only considers edgevalues above a minimum value, set using MmeasSetMarker() with M_EDGEVALUE_MIN. Given an edge profile, the edgevalue at the summit of the highest peak that satisfies this criterion represents the edge's position. When searching for multiple-occurrence markers, the Measurement module finds the highest peak among those for which the edge profile rises above and then falls below the minimum edgevalue on both sides. By default, only one possible instance of an edge is established from each interval above the specified minimum edgevalue. When searching for multiple occurrences of edges, some advanced applications might also need you to specify the minimum prominence of the required peaks, using M_EDGEVALUE_VAR_MIN. For more information, see the Minimum variation subsection of this section. Establishes and scores the marker. Based on the valid edgevalues, the algorithm establishes the marker and gives it a score, as a percentage. In general, the higher the score, the more confident you can be that the algorithm found the marker you expect. The algorithm rejects any possible marker occurrence that does not meet all the essential characteristics specified using MmeasSetMarker(). By default, the algorithm scores the marker according to its relative strength (maximum edgevalue), as indicated by the default behavior of MmeasSetScore(). This default behavior is usually sufficient and you needn't call this function. If necessary, you can specify characteristics other than strength to affect the score and influence the marker selection process. For example, you can score a marker according to its contrast. Typically, MmeasSetScore() is for advanced applications or when trying to distinguish between similar markers. You can retrieve or draw information about the edge peak or edge profile of the marker by calling MmeasGetResult() or MmeasDraw(). This can be useful, for example, when trying to establish an appropriate minimum edgevalue. For more information, see the Retrieving and drawing edge information subsection of this section. First derivative filter As previously discussed, edgevalues are established, in part, by a first derivative filter. You can choose either a Finite Impulse Response (FIR) filter or an Infinite Impulse Response (IIR) filter. Edgevalues can differ depending on which you select. FIR filters use a non-recursive convolution operation with a predefined kernel of a specified size. To select an FIR filter, use MmeasSetMarker() with M_FILTER_TYPE set to M_EULER or M_PREWITT. Conversely, IIR filters use a recursive convolution operation and have, theoretically, an infinite kernel size. To select an IIR filter, use MmeasSetMarker() with M_FILTER_TYPE set to M_SHEN, and specify the degree of smoothness (strength of denoising) to apply to the internal projection buffer of the search region, using MmeasSetMarker() with M_FILTER_SMOOTHNESS. Below are the general characteristics of each filter. The default, M_EULER, is typically sufficient for most applications. If necessary, you can try the others to see if they yield better results. [-1,1] (M_EULER). This is an FIR filter with a convolution kernel of size 2. This filter is faster but more sensitive to noise, compared to the M_PREWITT filter. [-1,0,1] (M_PREWITT). This is an FIR filter with a convolution kernel of size 3. This filter is slower but less sensitive to noise, compared to the M_EULER filter. An IIR filter (M_SHEN). This is a Shen-Castan Infinite Support Exponential filter. This is an exponential weighting function, of the general form: This IIR filter is slower than FIR filters (M_EULER or M_PREWITT). However, this filter is less sensitive to noise, can provide more accurate results, and allows you to control the strength of denoising. Minimum variation In advanced applications, M_EDGEVALUE_MIN might not give you enough control over identifying the required edges. This can happen when trying to find multiple neighboring edges in the search region, which are formed such that the foreground of the first edge becomes the background of the next edge. In the search region illustrated above, the pixels transition from gray (somewhat white), to less gray (more white), to white. If you consider the edge profile of the search region (by taking the first derivative and normalizing the intensity profile as previously discussed), you can see that M_EDGEVALUE_MIN does not give you enough control to establish three instances of an edge. To deal with such cases, you can try using MmeasSetMarker() with M_EDGEVALUE_VAR_MIN to set the minimum required prominence of the peak. To determine if this minimum prominence is met, MIL establishes a local threshold for each peak by subtracting M_EDGEVALUE_VAR_MIN from the edgevalue of each peak's summit. The portion of the edge profile above the local threshold that contains the edge peak can be referred to as the peak's interval, provided that the edge profile eventually dips below the local threshold on both sides of the edge peak's summit. For a peak to be considered an edge, there must be no edgevalues greater than that peak's summit within its interval. If the local threshold calculated with M_EDGEVALUE_VAR_MIN is less than M_EDGEVALUE_MIN, the local threshold equals M_EDGEVALUE_MIN. Retrieving and drawing edge information You can get information about the intensity profile or edge peak by calling MmeasGetResult(). To retrieve the start, end, and width of the edge based on the intensity profile, use MmeasGetResult() with M_EDGE_START, M_EDGE_END, and M_EDGE_WIDTH, respectively. To retrieve the maximum and minimum position of the edge peak, as well as the width of the edge peak, use MmeasGetResult() with M_EDGEVALUE_PEAK_POS_MAX, M_EDGEVALUE_PEAK_POS_MIN, and M_EDGEVALUE_PEAK_WIDTH. Using MmeasDraw(), you can draw different edge information. For example, you can draw the found marker's edge (M_DRAW_EDGES), or the position of the edge in the image (M_DRAW_POSITION). The edgevalues (that is, the edge profile) (M_DRAW_EDGES_PROFILE), the minimum edgevalue threshold (M_DRAW_EDGEVALUE_MIN_IN_PROFILE), the width of the edge peak (M_DRAW_EDGEVALUE_PEAK_WIDTH_IN_PROFILE), as well as the position of the marker in the edge profile (M_DRAW_POSITION_IN_PROFILE), are also drawable. If the drawings made by M_DRAW_..._PROFILE are not at an appropriate scale or location, you can use MmeasSetMarker() with M_DRAW_PROFILE_SCALE_OFFSET to specify a scale and an offset with which to draw. If the M_DRAW_IN_BOX combination constant is applied, you can set the scale and offset to M_AUTO_SCALE_PROFILE and M_AUTO_OFFSET_PROFILE, respectively. In this case, MIL will calculate the greatest scale factor and offset, respectively, that fit the drawing to the area that corresponds to the search region. Use M_AUTO_SCALE_PROFILE to calculate the maximum scale such that the maximum or minimum of your edgevalues (whichever is larger) touches the ends of the image buffer or the area corresponding to the search region in which the edge profile was established. You can also use an explicit value to specify your own scale. When using M_AUTO_SCALE_PROFILE, the scale is computed after applying the offset. You can specify an explicit offset, or have it calculated automatically using M_AUTO_OFFSET_PROFILE; the latter requires that you also use M_AUTO_SCALE_PROFILE. In this case, the scale and offset are calculated such that both the maximum and the minimum of your edgevalues touch the ends of the destination. When calculating the offset, MIL uses the height of the image buffer or, if the M_DRAW_IN_BOX combination constant is applied, the height of the area that corresponds to the search region. This height is influenced by the orientation of the search region, set using MmeasSetMarker() with M_ORIENTATION. Search algorithm First derivative filter Minimum variation Retrieving and drawing edge information ",
      "wordCount": 1477,
      "subEntries": []
    },
    {
      "id": "UG_meas_Search_region",
      "version": null,
      "title": "Search region",
      "subTitles": [
        "Box search region",
        "Setting the size and position of the search region",
        "Using drawings to verify the search region placement",
        "Marker orientation and search direction",
        "Search region clipping",
        "Setting the angle of the box search region",
        "Multiple-angle search for a marker",
        "Determining the rotation tolerance of a marker",
        "Subregions of the box search region",
        "Ring search region",
        "Placing the ring search region",
        "Subregions of the ring search region"
      ],
      "location": "MIL UG P03: 2D processing and analysis",
      "pageURL": "content\\UserGuide\\meas\\Search_region.htm",
      "text": " Search region Before you can search for a marker, you must define the area in which to perform the search. In general, this area is known as the search region. MIL stores the search region as a characteristic of the marker, which you must set with MmeasSetMarker(). MIL only searches for the marker in the search region. There are two types of search regions: Box search region (for edge and stripe markers). Ring search region (for circle markers). If the image you are using has a region of interest (ROI), MIL ignores the position and size of the box or ring search region defined using MmeasSetMarker(), and instead uses the ROI as the search region. To find edge or stripe markers, the ROI must be a rectangular region in vector format (M_VECTOR). To search for circle markers, the ROI must be a ring region in vector format. This does not affect the settings of the box or ring search regions defined using MmeasSetMarker() (these settings can still be recovered using MmeasInquire()), but the results of the find operation will be found based on the position and size of the region of interest (ROI). To draw the search region defined using MmeasSetMarker(), use MmeasDraw() with M_DRAW_SEARCH_REGION. Box search region To locate edge and stripe markers, you must use a box (rectangular) search region, defined using MmeasSetMarker() or a rectangular ROI. By default, MIL considers the entire target image as the box search region. The following example shows a target image with a delimited box search region and an edge marker found within it. For more advanced applications (such as dealing with crooked edges or edges that are not continuous), you can divide the box search region into sections, and then have MIL process a subregion of each of these sections. In this case, MIL finds and fits a line to points marking the strongest pixel intensity transition for each subregion (rather than for the entire box search region); this can result in better precision. This can be useful to, for example, detect irregularities by comparing the resulting positions of the subedges. In the following example, the Y-position of each subedge is not the same, so it can be deduced that the nail is not straight. Provided you are using a calibrated image, you can also specify the dimensions of your search region in world units using MmeasSetMarker() with M_MARKER_REFERENCE_INPUT_UNITS (or by using MgraControlList() with M_INPUT_UNITS if the search region was defined using an ROI). By using a calibrated image, you can specify the search region with respect to the relative coordinate system, and then fixture the relative coordinate system to each object. This way, you will only need to place the search region once, and all of the search results will be made from the same reference location. Setting the size and position of the search region When defining the box search region using MmeasSetMarker(), set the width and height of the box search region using M_BOX_SIZE. To set the box's position, you must specify the location of either its origin or center, using M_BOX_ORIGIN or M_BOX_CENTER, respectively. The origin always indicates the top-left corner of the unrotated box search region. When you set the width and height of the box (M_BOX_SIZE), the box expands or shrinks with respect to its origin. When you change M_BOX_SIZE, MIL moves the box's center accordingly (M_BOX_CENTER), while M_BOX_ORIGIN remains fixed. Similarly, if you change M_BOX_ORIGIN, MIL moves M_BOX_CENTER (and vice versa). When defining the box search region using MmeasSetMarker(), you can use MmeasInquire() to retrieve the box's actual dimensions, as well as the location of its center and origin. To draw the box's center, use MmeasDraw() with M_DRAW_SEARCH_REGION_CENTER. Regardless of how you are defining the box search region, to help prevent inaccurate results, especially with a detailed or complex target image, you should limit the box search region to as small an area as possible that still contains the marker. To help prevent inaccurate results, especially with a detailed or complex image, the box should fit entirely inside the target image and the edges of the marker should enter and exit on opposite sides of the box search region (although this is not a necessity). If you cannot always adhere to these conditions and are not getting the results you expect, you can try clipping the region or separating it into subregions. For more information, see the Search region clipping subsection of this section and the Subregions of the box search region subsection of this section. In certain cases, MIL requires subregions to perform its calculations and will internally use them even if you did not explicitly specify any, such as when calculating the equation of the line that best follows an edge. For more information, see the Line equation (mean line) subsection of the Search results section later in this chapter. Using drawings to verify the search region placement To verify that your search region is in the correct position, you can draw results to get a visual representation of your search region. When using MmeasDraw(), MIL will draw the specified characteristic within the dimensions of the destination image buffer. You can alternatively fit the drawings inside the box search region; to do so, you must add M_DRAW_IN_BOX to the drawing operation (for example, M_DRAW_EDGES_PROFILE + M_DRAW_IN_BOX). When using MmeasDraw(), MIL can shrink or enlarge certain drawings, such as M_DRAW_EDGES_PROFILE, so that they are more readable. For more information on resizing your drawings, see the Retrieving and drawing edge information subsection of the Search algorithm section earlier in this chapter. Marker orientation and search direction The marker's orientation specifies the expected direction of the marker's edge transition, relative to that of the box search region. You can set the orientation (M_ORIENTATION) to either vertical (M_VERTICAL) or horizontal (M_HORIZONTAL). MIL searches for the marker in the direction that is perpendicular to its specified orientation. That is, if you specify that the marker has a vertical orientation, MIL performs the search within the search region from left-to-right; if you specify that the marker has a horizontal orientation, MIL performs the search from top-to-bottom. To draw an arrow indicating the search direction, use MmeasDraw() with M_DRAW_SEARCH_DIRECTION. You can also set the orientation to M_ANY; in this case, MIL searches both left-to-right and top-to-bottom. Search region clipping If the search region falls outside the image boundaries, MmeasFindMarker() typically fails. To help manage this, you can set M_SEARCH_REGION_CLIPPING to M_MAXIMIZE_AREA, which allows MIL to try and internally create a clipped version of the search region that it can then search for the marker. MIL creates this region for internal access only; it does not alter the definition of the box search region that you set. This internal (clipped) region represents the maximum area that is both inscribed by the box search region and the image boundaries. The internally clipped region must always be within the defined (actual) box search region and the image. You can also specify the following M_SEARCH_REGION_CLIPPING_... conditions that must be met by the internally clipped region before MIL considers it a valid area within which it can search for a marker: M_SEARCH_REGION_CLIPPING_MIN_AREA, which allows you to specify a minimum required area for the internally clipped region. M_SEARCH_REGION_CLIPPING_MIN_HEIGHT and M_SEARCH_REGION_CLIPPING_MIN_WIDTH, which allow you to specify a minimum required height and width for the internally clipped region. M_SEARCH_REGION_CLIPPING_PRESERVE_CENTER, which allows you to specify conditions based on the center of the internally clipped region. For example, if you set M_SEARCH_REGION_CLIPPING_PRESERVE_CENTER to M_ALONG_HEIGHT, the internally clipped region will only be valid if the center-position along its height is the same as the center-position along the height of the defined box search region. Similarly, if you set M_ALONG_WIDTH, the internally clipped region can only be valid if the center-position along its width is the same as the center-position along the width of the defined box search region. If you allow clipping and you reposition the box search region such that it extends past the image boundary, inquiring the size of the box results in the size that you have set, and not the size of the internally clipped region. In the following example, the search region is defined using MmeasSetMarker(). The dimensions of the box search region (M_BOX_SIZE) are set to 180 (width) and 110 (height) pixels, and the box's center is at the center of the image. Repositioning the box's center to (50, 50) causes the box to move and extend past the image boundary. If you inquire the width and height of the box, MIL returns 180 and 110, respectively. If you inquire M_BOX_CENTER, MIL returns (50, 50), while M_BOX_ORIGIN returns the origin position that results from moving the box's center (that is, (-40, -5)). If you are using subregions and you do not enable clipping, the marker might still be found if the search region is outside the image. For more information on subregions, see the Subregions of the box search region subsection of this section. Setting the angle of the box search region Ideally, the edge or stripe marker should be perpendicular to the search direction of the box search region. The measurement operation can however tolerate a certain amount of rotation. The amount depends on several factors such as the target image, the placement of the box search region, and the marker's characteristic settings. If the rotation is too great, the chance of not finding the marker or miscalculating characteristics, such as edge strength and width, increases. In such cases, you can define the marker's box search region at an angle. The box's angle should be approximately the same angle as its marker. When defining the box search region using MmeasSetMarker(), use M_BOX_ANGLE to specify the angle. When defining the box search region using MmeasSetMarker(), the angle can be any value from 0 to 360° and should be set counter-clockwise, measured from the positive X-axis. By default, the center of rotation is the center of the box search region. To modify the center of rotation, use MmeasSetMarker() with M_BOX_ANGLE_REFERENCE. You can also have MIL analyze the content of the box search region and automatically determine the best angle for the box, by setting M_BOX_ANGLE to M_ANY (though this technique can increase processing time). You can use MmeasGetResult() with M_BOX_ANGLE_FOUND to retrieve the angle at which the marker was found. Multiple-angle search for a marker If you want to search for a marker within a range of possible angles, you can allow MIL to rotate the box search region by enabling a multiple-angle search, using M_BOX_ANGLE_MODE. In this case, you must set the range of angles to search (M_BOX_ANGLE_DELTA_NEG and M_BOX_ANGLE_DELTA_POS), the degree of rotation tolerance at any given angle (M_BOX_ANGLE_TOLERANCE), the type of interpolation (M_SEARCH_REGION_ANGLE_INTERPOLATION_MODE), and the required degree of accuracy for the resulting marker (M_BOX_ANGLE_ACCURACY). To perform a multiple-angle search for a marker, MIL first finds its approximate location and angle by searching within the angular range at every n (rotation tolerance) degrees. Once MIL establishes the approximate location of the marker, MIL performs a number of fine-tuned searches, according to the degree of accuracy. To be effective, the degree of accuracy must be less than the rotation tolerance. Note that the rotation tolerance refers to how much MIL can rotate a marker from its box search region and still find it. For more information, see the Determining the rotation tolerance of a marker subsection of this section. During each step of a multiple-angle search, MIL tries to find the marker with the highest score (M_SCORE_TOTAL); for an edge marker, this is the score of the edge, and for a stripe marker, this is the mean score of both edges. As previously mentioned, you can use MmeasGetResult() with M_BOX_ANGLE_FOUND to retrieve the angle of the box search region at which the marker was found. If searching within a range of angles causes the box search region to rotate beyond the edges of the target image, you must reposition or resize the box search region unless you are using subregions or allowing for clipping. Determining the rotation tolerance of a marker Every marker has its own particular rotation tolerance (the amount by which a marker can be offset from the box search region and still be found). This tolerance is dependent on the marker's individual characteristics and the surrounding image features. When performing a multiple-angle search for a marker, you should specify its rotation tolerance. To determine the tolerance, you can simulate the marker's rotation by turning the target image while maintaining the box search region at a fixed position and angle. That is: Ensure that the marker is at its expected (nominal) angle, and that the placement of the box search region is such that MIL finds the marker at an angle that is close to the same as the box's angle. Use MimRotate() to turn the image (which turns the marker) in small increments in the positive direction (for example, +0.5°) and perform an MmeasFindMarker() operation on each rotated image. Ensure that the image's center of rotation is the same as that of the box search region; otherwise, the resulting tolerance will be inaccurate. When rotating the image, always set the angle from the image's original position to avoid interpolating the image more than once. Check the results for the greatest angle with which MIL can find the marker and produce an acceptable score. Repeat steps 2 and 3, rotating the image in the negative direction (for example, -0.5°). Take the minimum of the absolute value of these angles, double it, and set that as the rotation tolerance for the angular search. When determining the rotation tolerance of a marker, the box search region must remain at a set position and angle; therefore, you must disable the multiple-angle search (M_BOX_ANGLE_MODE). Subregions of the box search region As previously mentioned, you can divide the box search region into sections and have MIL process a subregion of each of these sections. By default, subregions occupy the same area as their section, although you can reduce their size (for example, when the edge is not continuous). Edges within subregions are called subedges. Subregions typically apply to advanced applications and allow for more precise and complex measurements. For example, you can use the information from subregions to check if an edge is straight, or to find the line equation for a discontinuous edge that is disconnected at regular intervals. Each subregion acts like an independent box search region (MIL only searches for markers within them). To help prevent inaccurate results, the subedge should be continuous and should enter and exit the entire subregion in the direction that is perpendicular to the search (though this is not a necessity). For edge and stripe markers, you can use subregions to find single or multiple-occurrence markers. For example, the following image shows a box search region with three subregions and four occurrences of an edge marker. To divide the box search region into a certain number of sections, use MmeasSetMarker() with M_SUB_REGIONS_NUMBER. To narrow the subregion in each section, use M_SUB_REGIONS_SIZE, and specify the width of each subregion as a percentage of its section. By default, MIL centers the subregion within its section. To move the subregion, use M_SUB_REGIONS_OFFSET and specify the displacement as a percentage of the maximum possible offset within a section. Depending on the orientation, positive values can shift the subregion right or down, while negative values can shift it left or up. In the following example, the subedges cannot be found within their subregion (in the direction that is perpendicular to the search) until they are offset; only then, can MIL accurately calculate the line. A minimum of two subregions must be completely inside the target image for the search operation to succeed. This allows for more flexibility in the placement of the box search region when searching through an angular range, because a small part of the box search region is allowed to leave the target image. In some cases, such as in noisy images, MIL might place subregions at unwanted locations, thereby calculating inaccurate subedges; this can result in, for example, an incorrect line equation. To help solve this problem, you can set a maximum distance between a marker and a subedge (fit point). For more information, see the Maximum association distance of subedges subsection of the Edge markers: advanced characteristics that can be specified section later in this chapter Ring search region To locate a circle marker, you must use a ring search region, which you can specify with a center point (MmeasSetMarker() with M_RING_CENTER) and an inner and outer radius (M_RING_RADII). When defining the box search region using MmeasSetMarker(), the outer radius must be greater than the inner radius; otherwise, you will receive an error. The following animation shows how finding a circle marker in a target image is accomplished: When defining the box search region using MmeasSetMarker(), MIL considers the center of a ring search region to be its position; to draw it, use MmeasDraw() with M_DRAW_SEARCH_REGION_CENTER. Ring search regions have a radial search direction. That is, MIL searches for a circle marker within a ring search region in an outward direction, around the ring's center point, starting at the ring's inner radius and ending at its outer radius. Note that, by default, MIL divides the ring search region into eight subregions within which it searches for the circle marker. For more information, see the Subregions of the ring search region subsection of this section. By default, the search uses a nearest neighbor interpolation to locate circle markers. For most applications, this is typically appropriate. However, you can specify a bicubic or bilinear interpolation, using M_SEARCH_REGION_ANGLE_INTERPOLATION_MODE. Placing the ring search region By default, the position of the ring search region is either at the center of the image in the pixel coordinate system, or at the origin of the relative coordinate system, depending on the input coordinate system (set using M_SEARCH_REGION_INPUT_UNITS). Also, by default, the inner radius is 0 and the outer radius is equal to a value that corresponds to the largest possible circle that completely fits within the dimensions of the target image. This results in locating the best circle marker in the entire target image. Depending on your application, you will likely have to change these defaults; otherwise, incorrect results might occur. Placing the ring search region properly is essential to the success of the measurement operation, and depends on the expected location of the circle. You should limit the ring search region to as small an area as possible that still contains the circle marker. This increases the chance of success, especially with a detailed or complex target image. If the ring search region falls outside the image boundaries, the find operation typically fails. As previously discussed with box search regions, you can help manage this using M_SEARCH_REGION_CLIPPING set to M_MAXIMIZE_AREA, which allows MIL to automatically clip the ring search region when it falls outside the image. In this case, MIL internally creates a modified (clipped) version of the search region (it does not alter the actual search region that you set). For more information about how MIL clips the search region, see the Search region clipping subsection of this section. Since the ring search region is split into subregions (discussed later), MIL might still find the circle marker if the ring search region is outside the image and you do not enable clipping. Subregions of the ring search region By default, the ring search region internally has eight rectangular subregions that MIL evenly distributes around the center of the ring. Considering the subedges found within the subregions, MIL performs a circle fit operation to locate the circle marker. Each subregion acts like an independent search region (MIL only searches within them). Ideally, for MIL to find a circle marker, the edge within the subregion (subedge) should be continuous and should enter and exit the entire subregion in the direction that is perpendicular to the search (although this is not a necessity). Not all subregions must contain a valid edge; MIL requires a minimum of three. Therefore, it is possible to locate a circle even if part of it is missing, or part of it is outside the target image. Though MIL can locate a partial or broken circle, the marker that is found is always a fully closed circle, that is to say that the located subedges will be used to apply a circular fit to the remainder of the circle marker. The edges within the subregions must belong to a single circle; that is, you cannot specify a circle marker as a multiple-occurrence marker. The distribution of subregions is an internal operation that you cannot modify. However, you can set the number of subregions, using M_SUB_REGIONS_NUMBER. You can specify any value greater than or equal to 8 (default). The dimension of the subregion, along the side that is parallel to the search direction, is automatically set by the inner and outer radii. However, the dimension of the subregion along the side that is perpendicular to the search direction is set by M_SUB_REGIONS_CHORD_ANGLE. For this setting, you must specify an angle value according to the projected length of the chord (circle segment) that the rectangular subregion must contain. You can specify any angle between 0° and 45°. By default, the angle is 10°. Note that since a ring search region is circular and its subregions are rectangular, the subregions extend slightly beyond the boundaries of the radii to ensure that they enclose the specified chord. The default subregions and chord angle that the circle fit operation uses allows for a certain amount of tolerance towards outliers and missing subedges, which is generally sufficient for the majority of applications. However you might need to alter these defaults, particularly if you require greater precision; for example, locating one of two circles that are nearby, or dealing with a particularly noisy or occluded target image. If altering these defaults, remember to consider the value of both M_SUB_REGIONS_NUMBER and M_SUB_REGIONS_CHORD_ANGLE concurrently, since MIL creates subregions according to both of these settings. Depending on their values, subregions can overlap. In general, more subregions and a smaller chord angle results in a more precise fit of the circle, while too many subregions and too small an angle can result in false positives and longer processing times. In some cases, such as in noisy images, MIL can place subregions at unwanted locations and perform an incorrect fit of the circle marker. To help solve this problem, you can set a maximum distance between a marker and a subedge (fit point). For more information, see the Maximum association distance of subedges subsection of the Edge markers: advanced characteristics that can be specified section later in this chapter. By default, MIL uses a high level of accuracy to perform the circle's fit operation. However, if you are not dealing with noisy or badly contrasted images, this type of precision might be unnecessary. To lower the accuracy, and possibly the processing time, use with M_CIRCLE_ACCURACY set to M_LOW. Typically, the fit operation that MIL performs establishes the circle marker within the boundaries of the ring search region's subregions. However, given the circle marker's characteristics and the quality of your image (for example, if there is a lot of noise), MIL can, by default, establish a circle that is outside these boundaries. To specify that MIL must always establish the circle marker within the ring search region (and each of its subregions), set M_CIRCLE_INSIDE_SEARCH_REGION set to M_ENABLE. Search region Box search region Setting the size and position of the search region Using drawings to verify the search region placement Marker orientation and search direction Search region clipping Setting the angle of the box search region Multiple-angle search for a marker Determining the rotation tolerance of a marker Subregions of the box search region Ring search region Placing the ring search region Subregions of the ring search region ",
      "wordCount": 3983,
      "subEntries": []
    },
    {
      "id": "UG_meas_Marker_characteristics",
      "version": null,
      "title": "Marker characteristics",
      "subTitles": [
        "Essential characteristics",
        "Score characteristics"
      ],
      "location": "MIL UG P03: 2D processing and analysis",
      "pageURL": "content\\UserGuide\\meas\\Marker_characteristics.htm",
      "text": " Marker characteristics A marker's characteristics are its identifying qualities, such as its search region and polarity. The more precisely you define a marker's characteristics, the more likely MmeasFindMarker() will find the marker you want. To locate markers, the find operation uses two phases, each of which validates a specific set of characteristics: Phase one, which validates essential characteristics, set using MmeasSetMarker(). Phase two, which validates score characteristics, set using MmeasSetScore(). MmeasSetMarker() has essential characteristic settings that you should consider both basic (you typically change them) and advanced (you rarely change them), while MmeasSetScore() should be considered entirely advanced. Essential characteristics During the first phase of the search, MIL locates markers based on whether they have all the essential characteristics, as specified with MmeasSetMarker(). MIL considers every characteristic set with MmeasSetMarker() an unconditional requirement and discards any marker that does not have all of them. For example, a marker that does not have the specified polarity characteristic (M_POLARITY) can never be found, regardless of any other setting. Marker characteristics are set to their default upon the allocation of the marker buffer (MmeasAllocMarker()). Typically, essential characteristics other than the search region's origin or center can be set to M_ANY if the value is unknown or not a criteria. M_ANY generally indicates that you want to ignore that characteristic. Markers that have all the essential characteristics move on to phase two. Score characteristics During the second phase of the search, MIL calculates a score for each marker characteristic specified with MmeasSetScore(), and the marker with the highest score is found. Unlike essential characteristics, which are either met or not, MmeasSetScore() allows you to specify a range of acceptability, resulting in a characteristic score based on how well the calculated characteristic falls within that range. For example, you can specify that markers with a higher contrast score are better than markers with a lower contrast (M_EDGE_CONTRAST_SCORE), this allows you to find the marker with the best contrast while at the same time not eliminating markers with lower contrasts. For more information, see the Score characteristics section later in this chapter. If you do not specify any score characteristic, MIL only considers the marker's edge strength (M_STRENGTH_SCORE). Therefore, the marker with the strongest edges (highest edgevalues), and with all the essential characteristics, is found by default. This behavior is typically sufficient for most cases, and you need not call MmeasSetScore(). However, in advanced applications, or when you must distinguish between similar markers, score characteristics can prove useful to fine tune your search. Marker characteristics Essential characteristics Score characteristics ",
      "wordCount": 425,
      "subEntries": []
    },
    {
      "id": "UG_meas_Edge_markersfundamental_characteristics",
      "version": null,
      "title": "Edge markers: basic characteristics that should be specified",
      "subTitles": [
        "Polarity",
        "Minimum edgevalue"
      ],
      "location": "MIL UG P03: 2D processing and analysis",
      "pageURL": "content\\UserGuide\\meas\\Edge_markersfundamental_characteristics.htm",
      "text": " Edge markers: basic characteristics that should be specified This section describes basic edge marker characteristics that you should specify for most applications so that the appropriate edge marker is found. These edge marker characteristics are also characteristics that must be met. To specify a characteristic of an edge marker that must be met, use MmeasSetMarker(). These are known as essential characteristics. MIL can only find a marker if it meets all the essential characteristics. Note that certain essential characteristics, such as those related to the search region, multiple-occurrence markers, and the search algorithm, are described earlier in this chapter. Other more advanced edge marker characteristics that you can specify and that must be met are described later in this chapter. Polarity The polarity of an edge describes whether it is rising or falling, relative to the direction of the search (M_ORIENTATION). A rising edge denotes an increase (from dark to light) in grayscale values and a positive polarity, while a falling edge denotes a decrease (from light to dark) in grayscale values and a negative polarity. Use M_POLARITY to specify that the polarity of the edge marker must be positive (M_POSITIVE) or negative (M_NEGATIVE). You can also specify that the edge marker can have any polarity (M_ANY), in which case MIL does not consider polarity when trying to find the marker (default). For more information about orientation and search direction, see the Marker orientation and search direction subsection of the Search region section earlier in this chapter. Minimum edgevalue As previously discussed in this chapter, MIL establishes edgevalues by taking the normalized first derivative of the intensity profile. When you draw the edgevalues of each column, the graph generally resembles a peak when an edge is present. The minimum edgevalue is a type of threshold characteristic that you can set to represent the edgevalue above which a grayscale variation can be considered an edge. Any grayscale variation in the image that does not meet the specified minimum edgevalue is therefore discarded when MIL is searching for the marker. Though the default minimum edgevalue is typically sufficient, you can change it using MmeasSetMarker() with M_EDGEVALUE_MIN. When searching for multiple edges, some advanced applications might also need you to specify the minimum prominence of the required edge peaks, using M_EDGEVALUE_VAR_MIN. For more information about M_EDGEVALUE_VAR_MIN, and also about M_EDGEVALUE_MIN, see the Search algorithm section earlier in this chapter. Edge markers: basic characteristics that should be specified Polarity Minimum edgevalue ",
      "wordCount": 409,
      "subEntries": []
    },
    {
      "id": "UG_meas_Edge_markersadvanced_characteristics",
      "version": null,
      "title": "Edge markers: advanced characteristics that can be specified",
      "subTitles": [
        "Essential characteristics",
        "Maximum association distance of subedges",
        "Minimum variation",
        "Score characteristics",
        "Strength score",
        "Contrast score",
        "Position score"
      ],
      "location": "MIL UG P03: 2D processing and analysis",
      "pageURL": "content\\UserGuide\\meas\\Edge_markersadvanced_characteristics.htm",
      "text": " Edge markers: advanced characteristics that can be specified This section describes the characteristics of an edge marker that you would usually set for advanced applications, when the correct marker is difficult to find. These characteristics fall into two categories: those that must be met (essential characteristics) and those for which you can set a range of acceptable scores (score characteristics). Essential characteristics To specify an advanced essential characteristic of a marker, use MmeasSetMarker(). MIL only finds a marker occurrence if it meets all the essential characteristics set in the marker buffer. Maximum association distance of subedges The maximum association distance (M_MAX_ASSOCIATION_DISTANCE) determines the farthest a subedge can be from the fitted edge position, for MIL to consider it part of the edge marker. By default, the maximum association distance is unlimited; that is, MIL uses the entire box search region to establish markers. Typically, you might want to restrict the maximum association distance in certain types of noisy images, where MIL can interpret the noise as subedges, which can then be incorrectly used to fit the marker. To manage such situations, you should usually try restricting the size of the box search region; however, this might not always be convenient. For instance, if noisy images are rare but the edge location often varies, you might not want to reduce the box search region, although you have to account for an occasional noisy image that skews your results. In these cases, you can use M_MAX_ASSOCIATION_DISTANCE to restrict the image data that MIL uses to establish the marker. MIL measures the specified maximum distance from the center of the fitted edge along a straight line that is parallel to the search direction. Subedges that fall outside the maximum association distance do not affect the marker's fit operation even if they are in the box search region. Therefore, you can consider M_MAX_ASSOCIATION_DISTANCE as a way of restricting the image data that MIL uses to establish the edge, when it is not practical to decrease the size of box search region (or subregions). Although the maximum association distance applies to subedges, you might still need to specify it when dealing with noisy images, even if you have not explicitly subdivided the box search region into subregions (subedges). For example, to calculate an edge marker's line equation (mean line), MIL internally uses three subedges, even if you did not specify them (three fit points are a requirement to calculate a line). If an image has substantial specks (noise) in the subregions, the line that MIL calculates might not be what you expect; for example, it can be at an incorrect angle. By reducing the maximum association distance, the line can be much closer to what is expected. To retrieve the distance between the calculated marker and its farthest subedge, use MmeasGetResult() with M_FIT_ERROR_MAX. To retrieve the number of outliers (ignored subedges), use MmeasGetResult() with M_NUMBER_OF_OUTLIERS. Minimum variation The minimum variation refers to a type of threshold characteristic that you can set to represent the minimum prominence of the required edge peaks for the peak to be considered an occurrence of a marker. Advanced applications might need to specify this characteristic when trying to find multiple neighboring edges in the search region, which are formed such that the foreground of the first edge becomes the background of the next edge. To set the minimum variation characteristic, use M_EDGEVALUE_VAR_MIN. Note that, regardless of the M_EDGEVALUE_VAR_MIN setting, edgevalues must always be greater than the minimum edgevalue specified (M_EDGEVALUE_MIN) to be considered an occurrence of a marker. For more information, see the Minimum variation subsection of the Search algorithm section earlier in this chapter. Score characteristics To specify a score characteristic of a marker, use MmeasSetScore(). As previously discussed, the score characteristics only validate markers that have all the essential characteristics. Of these markers, MIL chooses the one with the highest edge strength score, by default. This behavior is typically sufficient and you usually don't have to call MmeasSetScore() unless you are working on advanced applications. Note that although you can specify multiple score characteristics, this can cause results that are difficult to interpret. It is often sufficient, and simpler, to use one score characteristic with which to find the best marker. Since the marker with the highest (best) strength score is found by default, you should therefore typically disable the strength score characteristic before setting another score characteristic (such as, for example, the contrast). For more information about how MIL calculates scores (as well as how to set a minimum acceptable score), see the Score characteristics section later in this chapter. Strength score As discussed earlier in this chapter, an edge's strength refers to its maximum edgevalue. The edge with the greatest strength can be referred to as the strongest edge and is, by default, the edge with the highest score. The edge's strength can actually refer to what is theoretically the lowest edgevalue (that is, the largest negative edgevalue) since edges can be found with positive or negative polarity. However, for explanatory purposes, the documentation generally refers to edges in the absolute, and therefore only to positive edgevalues and edge strengths. In the diagram below, the edge's strength is 100, which is the highest strength (and edgevalue) possible. This results from the theoretical case where the edge has a width of one pixel, is perfectly vertical, and has the greatest possible pixel value variation. Unlike the edge in the above example, the edges A and B in the diagram below do not come from a very high pixel variation, which means a lower strength. Also, since edge B is at an angle (its edge profile is distributed over ten edgevalues), while edge A has an edge width of one pixel, the strength of edge B (7) is less than edge A (31). Therefore, if you are finding an edge marker based on strength, as is the default case, edge A will be chosen. If you want to find edge B instead of edge A, you can use MmeasSetScore() to disable the strength score characteristic, and use the contrast score characteristic to select the best edge. Since the contrast is typically based on the difference in grayscale values between the start and the end of the intensity transition from which an edge is established, and edge B has a higher contrast (255 - 80 = 175) than edge A (80 - 0 = 80), edge B would have a higher contrast score and be chosen as the edge found. For more information about specifying the contrast score characteristic, see the Contrast score subsection of this section. To retrieve the calculated edge strength, use MmeasGetResult() with M_EDGE_STRENGTH. To specify the expected edge strength and tolerable variances, or to disable its effect, use MmeasSetScore() with M_STRENGTH_SCORE. You can also retrieve all the edgevalues of the marker buffer's search region, using MmeasGetResult() with M_BOX_EDGEVALUES. Specifically, this returns the calculated edgevalue for every projection value within the search region. This allows you to determine what MIL will likely consider an edge. You can then use this information to, for example, specify an appropriate value for M_STRENGTH_SCORE. Contrast score Contrast generally refers to the distinctiveness of an edge. Setting the contrast score characteristic can be useful when, for example, you must distinguish an edge from several other edges, particularly when the required edge does not have the highest edge strength (usually due to poor illumination, which strength is very dependent on), or when the edge is at an angle. To specify the contrast score characteristic, use either M_EDGE_CONTRAST_SCORE or M_EDGEVALUE_PEAK_CONTRAST_SCORE, depending on whether you want to determine the contrast based on the positions of the start and end of the edge, or based on positions relative to the minimum and maximum of the edge peak, respectively. For more information, see the Search algorithm section earlier in this chapter. Position score As previously discussed, an edge marker's position refers to the position of its maximum edgevalue. With M_DISTANCE_FROM_BOX_ORIGIN_SCORE, you can have MIL calculate a score based on the proximity of the marker's position to the origin of its box search region. Setting the position score characteristic can be useful when you want to find one particular edge marker that is among several edges that have similar characteristics and are all within the same box search region. For example, in the following illustration, there are three possible edge markers in the box search region, which are virtually identical; therefore, you cannot distinguish between them with score characteristics such as strength and contrast. However, with M_DISTANCE_FROM_BOX_ORIGIN_SCORE, you can find the first marker since it has the highest position score, given that it is the closest to the box origin. Edge markers: advanced characteristics that can be specified Essential characteristics Maximum association distance of subedges Minimum variation Score characteristics Strength score Contrast score Position score ",
      "wordCount": 1470,
      "subEntries": []
    },
    {
      "id": "UG_meas_Stripe_markersfundamental_characteristics",
      "version": null,
      "title": "Stripe markers: basic characteristics that should be specified",
      "subTitles": [
        "Polarity"
      ],
      "location": "MIL UG P03: 2D processing and analysis",
      "pageURL": "content\\UserGuide\\meas\\Stripe_markersfundamental_characteristics.htm",
      "text": " Stripe markers: basic characteristics that should be specified A stripe marker is simply a marker with two edges. Therefore edge marker characteristics, as discussed previously in this chapter, generally apply to stripe markers. The following example illustrates two stripe markers and some of their associated characteristics. This section describes basic stripe marker characteristics that you should specify for most applications so that the appropriate stripe marker is found. These stripe marker characteristics are also characteristics that must be met. To specify a characteristic of a stripe marker that must be met, use MmeasSetMarker(). These are known as essential characteristics. MIL can only find a marker if it meets all the essential characteristics. Note that certain essential characteristics, such as those related to the search region, multiple-occurrence markers, and the search algorithm, are described earlier in this chapter. Other more advanced stripe marker characteristics that you can specify and that must be met are described later in this chapter. Note that this section generally focuses on aspects of stripe markers that differ from edge markers. For stripes, characteristics usually apply to its mean line, to one of its two outermost edges, or to the area within its outermost edges. A stripe's first edge is the edge located closest to the search region origin. Polarity As explained for edge markers, polarity describes whether an edge is rising (increase in grayscale value) or falling (decrease in grayscale value). You can set the polarity for the first or second edge of a stripe by setting M_POLARITY to M_POSITIVE (rising edge), M_NEGATIVE (falling edge), or M_ANY (rising or falling edge). You can also set the second edge of a stripe to the same (M_SAME) or the opposite (M_OPPOSITE) polarity, relative to the first edge. When setting the polarity of a marker, it is important to keep in mind the direction of the search. For more information, see the Marker orientation and search direction subsection of the Search region section earlier in this chapter. Stripe markers: basic characteristics that should be specified Polarity ",
      "wordCount": 339,
      "subEntries": []
    },
    {
      "id": "UG_meas_Stripe_markersadvanced_characteristics",
      "version": null,
      "title": "Stripe markers: advanced characteristics that can be specified",
      "subTitles": [
        "Essential characteristics",
        "Inclusion point",
        "Maximum association distance of subedges",
        "Score characteristics",
        "Edges inside a stripe marker",
        "Stripe width"
      ],
      "location": "MIL UG P03: 2D processing and analysis",
      "pageURL": "content\\UserGuide\\meas\\Stripe_markersadvanced_characteristics.htm",
      "text": " Stripe markers: advanced characteristics that can be specified This section describes the characteristics of a stripe marker that you would usually set for advanced applications, when the correct marker is difficult to find. These characteristics fall into two categories: those that must be met (essential characteristics) and those for which you can set a range of acceptable scores (score characteristics). Note that this section focuses on stripe marker characteristics that differ from edge marker characteristics, which have already been discussed earlier in this chapter. In general, characteristics applicable to edge markers are also applicable to stripe markers. Essential characteristics To specify an advanced essential characteristic of a stripe marker, use MmeasSetMarker(). MIL only finds a marker occurrence if it meets all the essential characteristics. Inclusion point An inclusion point is an X- and Y-position that you can specify in the target image, using MmeasSetMarker() with M_INCLUSION_POINT. A stripe can only be found if the inclusion point falls on the inside, or on the outside, of the stripe's two outer edges, depending on the M_INCLUSION_POINT_INSIDE_STRIPE setting. By default, there is no inclusion point. Using an inclusion point can be useful when you know the general location at which MIL should find the stripe, and you are having difficulty finding it (for example, when other aspects of the image have similar features or stronger edges, or when you cannot set a proper box search region without clipping other similar image characteristics). If necessary, you can set the inclusion point outside the search region (to determine its position, MIL projects it along the one-dimensional pixel summation). To draw the inclusion point, use MmeasDraw() with M_DRAW_INCLUSION_POINT. Maximum association distance of subedges As previously discussed with edge markers, you can ignore unwanted subedges for stripe markers using MmeasSetMarker() with M_MAX_ASSOCIATION_DISTANCE. MIL measures the subedge's distance from the stripe's center (that is, the center of the fitted center line between the positions of the stripe's two outermost edges). Subedges that fall beyond this range do not affect the marker's fit operation, even if they are in the search region. Therefore, M_MAX_ASSOCIATION_DISTANCE gives you greater control over restricting the area in which to perform the fit operation when decreasing the box search region is not possible, allowing you to better ignore unwanted image elements such as specks and noise, which could be skewing your results. Although the maximum association distance applies to subedges, you might still need to specify it when dealing with noisy images, even if you have not explicitly subdivided the box search region into subregions (subedges). For example, to calculate the line equations for a stripe marker, MIL internally uses three subedges, even if you did not specify them (three fit points are a requirement to calculate a line). If an image has substantial specks (noise) in the subregions, the lines that MIL calculates for the stripe might not be what you expect; for example, they can be at an incorrect angle. By reducing the maximum association distance, the lines can be much closer to what is expected. Score characteristics To specify a score characteristic of a marker, use MmeasSetScore(). As previously discussed, the score characteristics only validate markers that have all the essential characteristics. Of these markers, MIL chooses the one with the highest edge strength score, by default. This behavior is typically sufficient and you usually don't have to call MmeasSetScore() unless you are working on advanced applications. Note that although you can specify multiple score characteristics, this can cause results that are difficult to interpret. It is often sufficient, and simpler, to use one score characteristic with which to find the best marker. Since the marker with the highest (best) strength score is found by default, you should therefore typically disable the strength score characteristic before setting another score characteristic (such as, for example, the contrast). For more information about how MIL calculates scores (as well as how to set a minimum acceptable score), see the Score characteristics section later in this chapter. Edges inside a stripe marker If there are multiple edges within a stripe, you might have difficulty isolating the edges of the target stripe (for example, the stripe consisting of the two outer edges). In such cases, you can specify M_EDGE_INSIDE_SCORE, which is a score characteristic related to the number of edges located between the outermost edges of a stripe marker. In this example, two stripes share the same position since their centers coincide. Either stripe marker can be found, depending on whether M_EDGE_INSIDE_SCORE specifies that the stripe must contain two or zero edges. This allows you to avoid setting other characteristics to find the stripe (such as its width). When specifying the number of edges that should be inside a stripe, you should typically set the value in increments of two, since stripes always require two edges. Stripe width As previously discussed, MIL measures the width of a stripe marker as the average distance in pixels between its outermost edges, perpendicular to the orientation of its box search region. To find a stripe marker according to an expected width value, you can use M_STRIPE_WIDTH_SCORE. Stripe markers: advanced characteristics that can be specified Essential characteristics Inclusion point Maximum association distance of subedges Score characteristics Edges inside a stripe marker Stripe width ",
      "wordCount": 875,
      "subEntries": []
    },
    {
      "id": "UG_meas_Circle_markersfundamental_and_advanced_characteristics",
      "version": null,
      "title": "Circle markers: basic and advanced characteristics that should or can be specified",
      "subTitles": [
        "Essential characteristics",
        "Polarity",
        "Maximum association distance of subedges",
        "Score characteristics",
        "Radius"
      ],
      "location": "MIL UG P03: 2D processing and analysis",
      "pageURL": "content\\UserGuide\\meas\\Circle_markersfundamental_and_advanced_characteristics.htm",
      "text": " Circle markers: basic and advanced characteristics that should or can be specified A circle marker is simply a marker with a closed circular edge. Therefore, edge marker characteristics, as discussed previously in this chapter, generally apply to circle marker characteristics. To establish a circle marker, MIL finds and extracts subedges using rectangular subregions of a ring search region and applies a circular fit to the subedges. The illustration below shows different possible circles, and how MIL extracts and fits the subedges according to the ring search region. Note that, although circle markers are closed, the edges that MIL uses to create them might not be closed; that is, MIL can establish a circle marker even if part of it is missing. This is due to the fact that only three valid subedges are required to identify a circle marker. For more information, see the Ring search region subsection of the Search region section earlier in this chapter. This section describes basic circle marker characteristics that you should specify for most applications so that the appropriate circle marker is found, as well as some advanced characteristics of a circle marker that you would usually set for advanced applications, when the correct marker is difficult to find. The latter characteristics fall into two categories: those that must be met (essential characteristics) and those for which you can set a range of acceptable scores (score characteristics). MmeasSetMarker() sets essential characteristic settings that you should consider both basic (you typically change them) and advanced (you rarely change them), while MmeasSetScore() should be considered entirely advanced. Essential characteristics To specify an essential characteristic of a circle marker, use MmeasSetMarker(). MIL only finds a marker occurrence if it meets all the essential characteristics set in the marker buffer. Polarity The polarity of an edge describes whether it is rising (increase in grayscale value) or falling (decrease in grayscale value). For circle markers, the polarity is measured outward, from the circle's center (radially). This is the same direction that MmeasFindMarker() uses to find circles. To specify the polarity, use MmeasSetMarker() with M_POLARITY set to M_ANY (default), M_NEGATIVE (falling edge), or M_POSITIVE (rising edge). Polarity is considered a basic characteristic since you must typically consider it for most applications. Maximum association distance of subedges As previously discussed with edge markers, you can ignore unwanted subedges using M_MAX_ASSOCIATION_DISTANCE. MIL measures the maximum distance radially, along the perimeter of the fitted circle within the rectangular subregions. Subedges that fall outside this range do not affect the marker's fit operation, even if they are in the search region. Therefore, M_MAX_ASSOCIATION_DISTANCE gives you greater control over restricting the area in which to perform the fit operation, allowing you to better ignore unwanted image elements, such as specks and noise, which could skew your results. Score characteristics To specify a score characteristic of a marker, use MmeasSetScore(). As previously discussed, the score characteristics only validate markers that have all the essential characteristics. Of these markers, MIL chooses the one with the highest edge strength score, by default. This behavior is typically sufficient and you usually don't have to call MmeasSetScore() unless you are working on advanced applications. Note that although you can specify multiple score characteristics, this can cause results that are difficult to interpret. It is often sufficient, and simpler, to use one score characteristic with which to find the best marker. Since the marker with the highest (best) strength score is found by default, you should therefore typically disable the strength score characteristic before setting another score characteristic (such as, for example, the contrast). For more information about how MIL calculates scores (as well as how to set a minimum acceptable score), see the Score characteristics section later in this chapter. Radius Radius refers to the distance between a circle's circumference and its center. If the target image has multiple circles with similar radii that share a common position (center), you might have difficulty isolating the circle you want. In such cases, you can find the marker based on a score MIL establishes according to how well the circle's radius corresponds to the radius specifications set with M_RADIUS_SCORE. In this example, there are three circles that share the same position (their centers coincide). If you want to find the biggest of these circles, you would typically narrow the ring search region. However, in certain cases, this might cause you to miss smaller circles that you would otherwise want to find if bigger circles were not there. Without having to adjust other characteristics (such as the ring search region), you can use M_RADIUS_SCORE to calculate a score for the circles within the ring search region, such that the circle with the biggest radius receives that highest score and is therefore found by MIL. Circle markers: basic and advanced characteristics that should or can be specified Essential characteristics Polarity Maximum association distance of subedges Score characteristics Radius ",
      "wordCount": 816,
      "subEntries": []
    },
    {
      "id": "UG_meas_Multiple_occurrence_marker_characteristics",
      "version": null,
      "title": "Multiple-occurrence marker characteristics",
      "subTitles": null,
      "location": "MIL UG P03: 2D processing and analysis",
      "pageURL": "content\\UserGuide\\meas\\Multiple_occurrence_marker_characteristics.htm",
      "text": " Multiple-occurrence marker characteristics To define a multiple edge or stripe marker, specify the number of edges or stripes to find using MmeasSetMarker() with M_NUMBER; the default is 1. If you expect a regular spacing pattern between the edges or stripes, you can have MIL calculate a score according to how well the actual found spacing adheres to the expected spacing, using MmeasSetScore() with M_SPACING_SCORE. In this case, the spacing score can affect which markers MIL finds. To view the found spacing between the multiple edges or stripes found, you can draw an H-type line (|-|) between them using MmeasDraw() with M_DRAW_SPACING. For more information, see the Score characteristics section later in this chapter. Unless you specify a minimum number of occurrences (M_NUMBER_MIN), you will receive no results if the number of edges or stripes found falls below M_NUMBER. If the exact number of edges or stripes is unknown, set M_NUMBER to M_ALL. You can also define a multiple-occurrence point marker. To do so, use MmeasSetMarker() with M_POSITION (the first point's position), M_NUMBER (the number of points), and M_SPACING (the distance between points). You can only define a multiple-occurrence point marker that uses the same spacing between its points. If you require irregularly spaced points, do not use a multiple-occurrence point marker; specify individual point markers instead. Multiple-occurrence marker characteristics ",
      "wordCount": 221,
      "subEntries": []
    },
    {
      "id": "UG_meas_Score_characteristics",
      "version": null,
      "title": "Score characteristics",
      "subTitles": [
        "Setting limits",
        "Using score characteristics",
        "Final score",
        "Lowest possible score and score-offset"
      ],
      "location": "MIL UG P03: 2D processing and analysis",
      "pageURL": "content\\UserGuide\\meas\\Score_characteristics.htm",
      "text": " Score characteristics As previously discussed, a marker is found according to its associated characteristics, which you can set with MmeasSetMarker() (essential characteristics) and MmeasSetScore() (score characteristics). Score characteristics apply only to markers that have all essential characteristics. Unlike essential characteristics, which are either met or not (causing the marker to be kept or discarded), score characteristics allow you to specify a range of acceptable values; based on where the actual characteristic result falls within that range, MIL calculates its score. For example, with M_EDGE_CONTRAST_SCORE, you can set a range of valid contrast values, from the highest possible contrast to the lowest that you are willing to tolerate; the better (higher) the marker's contrast, the higher its contrast score. MIL multiplies the scores of all score characteristics, specified for the marker, to calculate the final score of the marker (MmeasGetResult() with M_SCORE_TOTAL). The marker with the highest final score is the one found by MmeasFindMarker(). By default, MIL only calculates the score of the marker's edge strength (M_STRENGTH_SCORE). Therefore, if you do not call MmeasSetScore(), the marker that has the strongest edges (and all the essential characteristics) is found. Although you can specify multiple score characteristics, doing so can cause results that are difficult to interpret. It is often sufficient, and simpler, to use one score characteristic with which to find the best marker. Since the marker with the highest (best) strength is found by default, you should therefore typically disable the strength score characteristic before setting another score characteristic. After calling MmeasFindMarker(), you can use MmeasGetScore() with M_RESULT to retrieve the characteristic's score, as well as other related information, such as the actual value of the characteristic (for example, the contrast of the marker in the image). You can also use MmeasGetResult() to retrieve the actual value of the characteristic (for example, M_EDGE_CONTRAST), regardless of whether you call MmeasSetScore(). To inquire MmeasSetScore() settings, use MmeasGetScore() with M_MARKER. Setting limits You must use MmeasSetScore() with the Min, Low, High, and Max parameters to set the acceptable limits of a score characteristic. These limits represent a type of score function, f(x), where x is the calculated characteristic. If x is less than Low and greater than or equal to Min, or greater than High and less than or equal to Max, MIL calculates the characteristic's score (f(x)) to be above 0% and below 100%. If x is greater than or equal to Low and less than or equal to High, the characteristic is automatically given a score of 100%. Conversely, if x is less than Min or greater than Max, the characteristic is automatically given a score of 0% and is discarded. For example, if you are using M_EDGE_CONTRAST_SCORE and set Min to 25 and Max to 225, any contrast value that is below 25 and over 225 will score 0%. If you also set Low to 50 and High to 200, then any contrast between 50 and 200 will score 100%, while contrasts between 25 and 50, or between 200 and 225, will score above 0% and below 100% ( f(x)). You must specify a value for each limit parameter. All limits except Min can be set to M_MAX_POSSIBLE_VALUE, which represents a predetermined maximum established by MIL for that characteristic. Using score characteristics The variety of limits (Min, Low, High, and Max) provide you with great flexibility and control over score characteristics, which affect the marker that is ultimately found. The following examples illustrate how to set these limits to achieve the required results. You want to specify one limit that a characteristic must be above; for example, you only want to find edge markers that have a strength that is higher than 20. To do so, use M_STRENGTH_SCORE, and set Min and Low to 20, and High and Max to M_MAX_POSSIBLE_VALUE. In this case, if the marker's strength (highest edgevalue) is greater than 20, the strength score will be 100%. If it is below 20, the strength score will be 0%. You want to specify one limit that a characteristic must be under; for example, you only want to find edge markers that have a contrast that is below 80. To do so, use M_EDGE_CONTRAST_SCORE, and set Min and Low to 0, and High and Max to 80. In this case, if the contrast is less than 80, the contrast score will be 100%. If it is above 80, the contrast score will be 0%. You want to specify two limits that a characteristic must be within; for example, you only want to find stripe markers that have a width between 40 and 60 pixels. To do so, use M_STRIPE_WIDTH_SCORE, and set Min and Low to 40, and High and Max to 60. In this case, if a stripe's width is greater than 40 pixels and less that 60 pixels the width score will be 100%. Otherwise, the width score will be 0%. You want to specify two limits that a characteristic should ideally be within, and to allow some tolerance for each limit; for example, you prefer finding stripe markers that have a width between 40 and 60 pixels (if available), but if necessary you also want to accept widths that are closest to those limits by a maximum of 10 pixels. To do so, use M_STRIPE_WIDTH_SCORE, and set Min to 30, Low to 40, High to 60, and Max to 70. In this case, if a stripe's width is between 40 and 60 pixels, it will score 100%, while widths between 30 and 40, or between 60 and 70, will score above 0% and below 100%, depending on how close they are to the ideal limit. Widths below 30 and above 70 will score 0%. You want to specify limits that favor characteristics with higher values; for example, you want to find the circle that has the biggest radius. To do so, use M_RADIUS_SCORE, and set Min to 0, and Low, High, and Max to M_MAX_POSSIBLE_VALUE. You want to specify limits that favor characteristics with lower values; for example, you want to find the circle that has the smallest radius. To do so, use M_RADIUS_SCORE, and set Min, Low, and High to 0, and Max to M_MAX_POSSIBLE_VALUE. You want to specify limits that cause the characteristic to be ignored (a flat mapping); for example, you want to ensure that the marker's edge strength score will not affect the marker that is found. To do so, use M_STRENGTH_SCORE and set Min and Low to 0, and High and Max to M_MAX_POSSIBLE_VALUE. A score characteristic that has its limits set to the specified flat mapping will always score 100%; therefore, it can never be a criterion by which to select the best marker. That is, since all possible characteristic values (having already been validated by the essential characteristics) always receive a perfect score, there can never be one that is better than another. As previously mentioned, this flat mapping is the default behavior of all score characteristics except M_STRENGTH_SCORE. Note that since the edge strength limits are set, by default, to find the marker with the highest strength characteristic score (that is, Min set to 0, and Low, High and Max set to M_MAX_POSSIBLE_VALUE), it might be useful to sometimes apply a flat mapping to M_STRENGTH_SCORE and ignore the strength, thereby allowing some other characteristic, such as the contrast, to find the best edge. Final score Since MIL multiplies the score (percentage) of all of the marker's characteristics to establish the marker's final score (M_SCORE_TOTAL), you should keep in mind the following potential effects of this calculation: If a characteristic's score is 0%, the marker's final score will also result in 0%, thereby eliminating any possibility of obtaining a result. That is, multiplying any x by 0 always gives 0. If a characteristic's score is 100%, the calculation of the marker's final score remains unaffected by that characteristic. That is, multiplying x by 100% always gives x. In this case, the score of the other characteristics (if any have been set) will determine the best marker among all possible markers. For example, if characteristic C has a score of 25% and all other characteristics have scores of 100%, then characteristic C determines the final score and whether the marker is found (the final score of such a marker would be 25%). If the range between the Low and High limits is too wide, many characteristics can score 100%, making it difficult to ascertain which is better. Therefore, if you are having difficulty distinguishing between markers, you can try narrowing these limits. Once a characteristic's score is below 100%, the marker's final score can never be 100%. That is, if an element in a set is imperfect, the set as a whole can never attain perfection. The following example illustrates how a marker's final score is computed according to the result of the specified score characteristics. Marker Contrast score result Strength score result Position score result Marker's final score A 70% 80% 100% 56% (0.7 x 0.8 x 1.0) B 100% 100% 20% 20% (1.0 x 1.0 x 0.2) C 100% 100% 0% 0% (1.0 x 1.0 x 0.0) Lowest possible score and score-offset When using multiple score characteristics, you can specify the importance of each, allowing you to affect a characteristic's influence on the marker's final score. To do this, MIL lets you adjust a characteristic's lowest-possible score, which is 0 by default. For example, by default, if a characteristic scores 5%, and MIL multiplies it with other characteristics, it will significantly affect the marker's final score (the lower a characteristic's score, the greater its multiplicative effect). However, if you set its lowest possible score to 93%, MIL remaps that same characteristic's score to 98%; this results in the characteristic's score having less influence on the final score. This allows you to potentially modify results (the marker found) without having to alter other settings. To change the lowest possible score, use the ScoreOffset parameter and specify a value that MIL will then offset from a perfect score (100%). That is: 100% - ScoreOffset = LowestPossibleScore. Since the default lowest possible score is 0%, the default score-offset is 100% (calculated as, 100% - 100% = 0%). Although the score-offset increases the lowest-possible score of a characteristic, it does not alter the range of acceptable characteristic values, as set with the limit parameters (Min, Low, High, and Max). For example, the following image shows two graphs with equivalent limits. However, the first graph has a score-offset of 100% (default), while the second graph has a score-offset of 70%. In each case, the pool of valid characteristic values is the same. The only difference is, in the first graph, the lowest-possible score of a characteristic (less than or equal to Min greater than or equal to Max) is greater than 0, while in the second graph the lowest-possible score of a valid characteristic (between the same ranges) is greater than 30. As the graphs indicate, the score-offset essentially influences the slope of the characteristic's score function (f(x)). Note that since the angle of the function is slightly different in each graph, MIL plots the resulting scores for equivalent characteristic values within these ranges somewhat differently. For example, in the first graph, a characteristic value that scores 5% will score approximately 34% in the second graph. However, in either case, any characteristic value that is less than 10 or greater than 90 (that is, below Min or above Max) will score 0%. Note that characteristic values between 40 and 60 (Low and High) will always score 100%. Score characteristics Setting limits Using score characteristics Final score Lowest possible score and score-offset ",
      "wordCount": 1939,
      "subEntries": []
    },
    {
      "id": "UG_meas_Using_Search_Results",
      "version": null,
      "title": "Search results",
      "subTitles": [
        "Finding the marker and taking measurements",
        "Edge measurements taken by the find operation",
        "Line equation (mean line)",
        "Angle",
        "Length",
        "Position and reference position",
        "Intersection point",
        "An edge's start, end, and width (based on the intensity profile)",
        "An edge peak's maximum/minimum position and width (based on the first derivative)",
        "Stripe measurements taken by the find operation",
        "Line equation (mean line)",
        "Angle",
        "Length",
        "Position and reference position",
        "Stripe width",
        "Maximum association distance of subedges",
        "Circle measurements taken by the find operation",
        "Position and reference position",
        "Maximum association distance of subedges",
        "Radius",
        "Drawing"
      ],
      "location": "MIL UG P03: 2D processing and analysis",
      "pageURL": "content\\UserGuide\\meas\\Using_Search_Results.htm",
      "text": " Search results You can obtain results using MmeasGetResult() (or MmeasGetResultSingle()) or MmeasGetScore(). MIL stores results from MmeasFindMarker() directly within the marker buffer rather than in a result buffer. Results do not overwrite specified marker characteristics. If you have specified a score characteristic with MmeasSetScore(), you can obtain the results using MmeasGetScore(). All positional results are relative to the center of the top-left pixel in the target image or the origin of the relative coordinate system of an calibrated image. For a multiple-occurrence marker, MmeasFindMarker() takes the required measurements for all the found edges or stripes (all marker occurrences). To obtain the number of edges or stripes found, use MmeasGetResult() with M_NUMBER. Global results, such as the maximum, minimum, mean, or standard deviation of any characteristic of the calculated results can be returned. Finding the marker and taking measurements Use MmeasFindMarker() to find a marker and take its measurements, such as its strength, position, and contrast. By default, MIL performs all measurements that apply to the marker type, which is typically what you want. Measurements are taken with subpixel accuracy. When you call MmeasFindMarker(), however, you can limit the number of measurements performed using MmeasSetMarker(). Advanced users can modify how MIL calculates the positions of the subpixels using MmeasSetMarker() with M_SUBPIXEL_MODE. Edge measurements taken by the find operation When you call MmeasFindMarker(), MIL not only locates the best possible marker, but also takes its measurements, such as the marker's angle and width. If you call this function with M_DEFAULT, MIL performs all possible measurements on the marker, which is typically appropriate for the vast majority of applications. However, you can also call MmeasFindMarker() with a specific set of measurements to calculate. In this case, be aware that certain results might not be available for retrieval. For example, if you use MmeasFindMarker() to calculate just the line equation of an edge marker (M_LINE_EQUATION), you cannot use MmeasGetResult() with M_EDGE_END to retrieve the X- and Y-coordinates of the end of the edge. Except for some very rare cases, there is no reason to restrict the default measurements MmeasFindMarker() performs. Some of the less evident measurements that MIL takes are discussed below; for a complete list, refer to MmeasFindMarker() in the MIL Reference. Line equation (mean line) When you call the find operation, MIL calculates the equation of the line that best follows the edge marker. MIL bases the line equation on the general form, Ax + By + C = 0. Use MmeasGetResult() with M_LINE_A, M_LINE_B, and M_LINE_C to retrieve the coefficients A, B, and C, respectively. If you did not specify multiple subregions (MmeasSetMarker() with M_SUB_REGIONS_NUMBER), MIL internally uses three, since it is the minimum number it requires to calculate the line equation (mean line). Angle When you call the find operation, MIL calculates the angle of an edge marker, which you can then retrieve using MmeasGetResult() with M_ANGLE. MIL measures the angle, as a value from 0° to 360°, between the positive X-axis and the edge's mean line. Length When you call the find operation, MIL also calculates the length of the side of the search region perpendicular to the search direction, in pixels, which you can then retrieve using MmeasGetResult() with M_LENGTH. This is useful to retrieve the number of pixels that were projected into a single value of the intensity profile without having to find M_ORIENTATION first. Position and reference position The edge marker's position refers to the X- and Y-coordinates of its maximum edgevalue (highest edge peak) and the center of the search region, as found with MmeasFindMarker(). To retrieve the marker's found position, use MmeasGetResult() with M_POSITION. To draw a cross (+) at this position, use MmeasDraw() with M_DRAW_POSITION; if you are using subregions, you can specify M_DRAW_SUB_POSITIONS to draw a cross at the found position of each subedge. MIL uses the found position of the edge marker (M_DRAW_POSITION) as its default reference position, when calculating measurements between two markers using MmeasCalculate(). To change the default, call MmeasSetMarker() with M_MARKER_REFERENCE and specify X- and Y-offset values relative to the found position. Only MmeasCalculate() makes use of this reference position. For more information, see the Measurements between two markers section later in this chapter. Intersection point When you call the find operation, MIL calculates the X- and Y-coordinates of the two intersection points between the marker's mean line and the box search region. To retrieve the intersection points, use MmeasGetResult() with M_LINE_END_POINT_FIRST and M_LINE_END_POINT_SECOND. For vertical edges, the first intersection point is typically at the top of the box search region, while the second intersection point is typically at the bottom. For horizontal edges, the first intersection point is typically on the right of the box search region, while the second intersection point is typically on the left. However, the intersection point that MIL considers first and second can change depending on certain factors, such as the orientation, the edge's angle, and the rotation of the box search region. An edge's start, end, and width (based on the intensity profile) When you call the find operation, MIL calculates the start and end position of the edge, based on the intensity profile of the search region. To retrieve these results, use M_EDGE_START and M_EDGE_END. You can also retrieve the distance between M_EDGE_START and M_EDGE_END, using M_EDGE_WIDTH. For more information, see the Search algorithm section earlier in this chapter. An edge peak's maximum/minimum position and width (based on the first derivative) When you call the find operation, MIL calculates the minimum and maximum positions of the edge peak, based on the edge profile (the normalized first derivative of the intensity profile). To retrieve these results, use M_EDGEVALUE_PEAK_POS_MIN and M_EDGEVALUE_PEAK_POS_MAX. You can also retrieve the distance between M_EDGEVALUE_PEAK_POS_MIN and M_EDGEVALUE_PEAK_POS_MAX, using M_EDGEVALUE_PEAK_WIDTH. For more information, see the Search algorithm section earlier in this chapter. Stripe measurements taken by the find operation When you call MmeasFindMarker(), MIL not only locates the best possible marker, but also takes its measurements, such as the stripe marker's length and width. As with edge markers, you would typically perform all possible measurements on the stripe (M_DEFAULT). Line equation (mean line) When you call the find operation to find stripe markers, MIL calculates the equation of three lines: the stripe's mean line, the line that best represents the stripe's first edge, and the line that best represents the stripe's second edge. Much like for edge markers, each line equation is based on the general form, Ax + By + C = 0. Use MmeasGetResult() with M_LINE_A, M_LINE_B, and M_LINE_C to retrieve the coefficients A, B, and C, respectively. You can retrieve these coefficients for a specific edge's line equation, using the combination value M_EDGE_FIRST or M_EDGE_SECOND. If you do not specify a specific edge, the function returns the coefficients of the line equation for the stripe's mean line. The mean line follows the center of the marker occurrence, between the lines MIL calculates for the stripe's two outermost edges. If you did not specify multiple subregions (MmeasSetMarker() with M_SUB_REGIONS_NUMBER), MIL internally uses three subregions, since it is the minimum number it requires to calculate a line equation. Angle When you call the find operation, MIL calculates the angle of a stripe marker, in much the same manner as it does for an edge based marker (discussed in the Angle subsection of this section), that is to say by measuring the angle between the positive X-axis and the stripe's mean line. The angle of a stripe marker is independent of the angle of the search region. The angle is measured in the coordinate system specified, and can be changed using M_RESULT_OUTPUT_UNITS. You can also retrieve the angle of the stripe's first or second edge, using M_ANGLE and the combination value M_EDGE_FIRST or M_EDGE_SECOND, respectively. Length As with an edge marker, the length of a stripe marker is the length of the side of the search region perpendicular to the search region. The retrieval of the length of a marker is discussed in the Length subsection of this section. Position and reference position The stripe marker's position refers to the X- and Y-coordinates of the center of a theoretical line between the position of the stripe's two outermost edges, as found with MmeasFindMarker(). Note that since the position of an edge refers to the X- and Y-coordinates of its maximum edgevalue and the center of the search region, the stripe marker's found position will always be along the center of the search region. The process of retrieving the found position for a stripe marker is much the same as for an edge marker, as discussed in the Position and reference position subsection of this section. Furthermore, all operations in the previously mentioned corresponding section for an edge marker can also be performed for a stripe marker. Stripe width To retrieve the actual stripe width, call MmeasGetResult() with M_STRIPE_WIDTH. This result is available even if you do not use M_STRIPE_WIDTH_SCORE. To draw an H-type line (|-|) along the found width of the stripe, use MmeasDraw() with M_DRAW_WIDTH. Maximum association distance of subedges To retrieve the distance between the calculated stripe marker and its farthest subedge, use MmeasGetResult() with M_FIT_ERROR_MAX. To retrieve the number of outliers (ignored subedges), use MmeasGetResult() with M_NUMBER_OF_OUTLIERS. Circle measurements taken by the find operation When you call MmeasFindMarker(), MIL not only locates the best possible marker, but also takes its measurements, such as the circle marker's position and radius. As with edge markers, you would typically perform all possible measurements on the circle (M_DEFAULT). Position and reference position The circle marker's position refers to the X- and Y-coordinates of its center, as found with MmeasFindMarker(). The process of retrieving the found position for a circle marker is much the same as for an edge or stripe marker, as discussed in the Position and reference position subsection of this section. Furthermore, all operations in the previously mentioned corresponding section for an edge marker can also be performed for a circle marker. Maximum association distance of subedges The retrieval of the distance between a circle marker and its farthest subedge is done in much the same way as it is done for a stripe marker, as discussed in the Maximum association distance of subedges subsection of this section. Radius To retrieve a circle marker's radius, use MmeasGetResult() with M_RADIUS. This result is available even if you do not use M_RADIUS_SCORE. Drawing To verify marker specifications or results, you can call MmeasDraw() with M_MARKER or M_RESULT, respectively; that is, you can perform the drawing operation (M_DRAW_...) using the expected marker characteristics (M_MARKER), or using the marker characteristics found in the target image (M_RESULT). For example, you can draw the marker's search region defined using MmeasSetMarker() (M_DRAW_SEARCH_REGION), as well as the found position of a marker (M_DRAW_POSITION). When drawing results, you can use the M_RESULT_PER_SUBREGION() macro to indicate that MIL should perform the drawing operation according to the specified subregions (one or all) of the specified occurrences (one or all). For stripe markers, you can perform certain drawing operations based on the marker's first or second outermost edge, by adding either M_EDGE_FIRST or M_EDGE_SECOND to the operation (for example, M_DRAW_POSITION + M_EDGE_SECOND). A stripe's first edge is the edge located closest to the search region origin. MIL stores both the specified (expected) marker characteristics, and the characteristics of marker results, in the same measurement marker buffer. You must therefore pass the identifier of this one marker to MmeasDraw(), whether you are using M_MARKER or M_RESULT. MmeasDraw() also accepts the identifier of a measurement result buffer, but only for drawing the resulting line between two markers when using MmeasCalculate(). For more information, see the Measurements between two markers section later in this chapter. To control the drawing color of MmeasDraw() operations, you can use a previously allocated 2D graphics context or the default 2D graphics context (see the 2D graphics context section of Chapter 26: Generating graphics). You can draw directly into an image buffer or a 2D graphics list. By drawing into the display's overlay buffer or associating the 2D graphics list with the display, you can also annotate non-destructively. For more information, see the Annotating the displayed image non-destructively section of Chapter 25: Displaying an image. Search results Finding the marker and taking measurements Edge measurements taken by the find operation Line equation (mean line) Angle Length Position and reference position Intersection point An edge's start, end, and width (based on the intensity profile) An edge peak's maximum/minimum position and width (based on the first derivative) Stripe measurements taken by the find operation Line equation (mean line) Angle Length Position and reference position Stripe width Maximum association distance of subedges Circle measurements taken by the find operation Position and reference position Maximum association distance of subedges Radius Drawing ",
      "wordCount": 2121,
      "subEntries": []
    },
    {
      "id": "UG_meas_Measurements_between_two_markers",
      "version": null,
      "title": " Measurements between two markers",
      "subTitles": [
        "Steps to taking measurements between two markers",
        "Specifying the measurement context and control settings",
        "Calculating with multiple-occurrence markers",
        "Angle",
        "Line equation and distance"
      ],
      "location": "MIL UG P03: 2D processing and analysis",
      "pageURL": "content\\UserGuide\\meas\\Measurements_between_two_markers.htm",
      "text": " Measurements between two markers Once you have found the position of your markers, you can use MmeasCalculate() to take measurements between two markers. MmeasCalculate() performs measurements according to the line joining the reference position of any two markers. By default, MmeasCalculate() performs all possible measurements (angle, distance, and line equation). This allows you to quickly determine some fundamental information about the relationship between the specified markers, such as how far apart they are from each other. By default, a marker's reference position is the same as its actual position (MmeasGetResult() with M_POSITION), which depends on the marker's type. Marker type Default reference position Point X- and Y-coordinates specified using MmeasSetMarker() with M_POSITION. Edge X- and Y-coordinates of the edge's maximum edgevalue. Stripe X- and Y-coordinates at the center of a theoretical line between the position (maximum edgevalue) of the stripe's two outermost edges. Circle X- and Y-coordinates at the circle's center. To change the marker's reference position, use MmeasSetMarker() with M_MARKER_REFERENCE. Modifying the reference position only affects calculations between two markers (MmeasCalculate()); it does not, for example, affect how MIL finds markers. Steps to taking measurements between two markers The following steps provide a basic methodology for taking measurements between two markers: Allocate a context, using MmeasAllocContext(). This is to allow the user to control the behavior of measurement operations (using MmeasControl()). Allocate a result buffer, using MmeasAllocResult(). This is to store the results obtained of the MmeasCalculate() operation. Allocate and define your markers, and find each marker (for more information, see the Steps to finding and obtaining measurements of markers section earlier in this chapter). Note that you cannot find point markers; you must set their position with M_POSITION. Call MmeasCalculate() and specify the two markers and the measurements to take. Read the results, using MmeasGetResult(). To draw the resulting line that MIL used to take measurements between the two markers, call MmeasDraw() with M_DRAW_LINE, M_RESULT, and the identifier of the buffer that contains the results of the MmeasCalculate() operation. Specifying the measurement context and control settings While you would normally be required to explicitly specify a measurement context using MmeasAllocContext(), this is not required to perform basic measurements operations for the MmeasFindMarker(), MmeasCalculate(), and MmeasInquire() functions. This is because within those functions, it is possible to specify M_DEFAULT as the context's identifier, and in so doing, allocating the default measurement context. In order to modify a measurement context using MmeasControl(), you need to explicitly allocate the measurement context using MmeasAllocContext(). This will then allow you to change various context settings, such as the pixel aspect ratio to correct measurement inputs (M_PIXEL_ASPECT_RATIO). However it is to be noted that these settings are typically reserved for more advanced applications. When you no longer require a measurement context allocated with MmeasAllocContext(), free it using MmeasFree(). Calculating with multiple-occurrence markers If you specify two multiple-occurance markers, calculations are made using the occurrences of the first marker and the corresponding occurrences of the second marker. The number of calculations is limited to the smallest number of occurrences held in either marker. For example, in the following illustration, Marker 1 is a simple edge marker, while Marker 2 is a multiple-occurrence marker with four edge occurrences. In this case, MIL performs the calculations between Marker 1 and the first occurrence of Marker 2. When retrieving results for a multiple-occurrence marker, you must pass an array to MmeasGetResult() that is large enough to hold the results of all occurrences. If necessary, you can use MmeasGetResultSingle() to retrieve a single result. Angle To calculate the angle of the line joining the two markers, use M_ANGLE. The angle is measured counter-clockwise, from the positive X-axis, and can be a value from 0 to 360°. The angle is returned in the output units specified using MmeasControl() (for a measurement result buffer) with M_RESULT_OUTPUT_UNITS. Line equation and distance To calculate the equation of the line joining the two markers, use M_LINE_EQUATION. To calculate the distance between the two markers, use M_DISTANCE. The following illustration shows two stripe markers, each of which is a multiple-occurrence marker; the first has two occurrences, and the second has three. In this example, MIL calculates the line equation and distance between each corresponding occurrence (relative to each marker's reference position). Since each multiple-occurrence marker has a different number of occurrences, MIL uses the smaller number and ignores the extra occurrence. Note that you can also retrieve the horizontal or vertical distance between two markers using MmeasGetResult() with M_DISTANCE_X or M_DISTANCE_Y. Measurements between two markers Steps to taking measurements between two markers Specifying the measurement context and control settings Calculating with multiple-occurrence markers Angle Line equation and distance ",
      "wordCount": 775,
      "subEntries": []
    },
    {
      "id": "UG_meas_Measurement_examples",
      "version": null,
      "title": "Measurement examples",
      "subTitles": [
        "Circle markers and advanced settings"
      ],
      "location": "MIL UG P03: 2D processing and analysis",
      "pageURL": "content\\UserGuide\\meas\\Measurement_examples.htm",
      "text": " Measurement examples The Measurement example MMeas.cpp demonstrates how to find a stripe in an image and measure its position, width, and angle. This example also demonstrates how to find the average position, average width, and average angle of a row of pins on a chip. In addition, the example shows you how to perform drawing operations and return measurement statistics. mmeas.cpp Circle markers and advanced settings There are also examples regarding circle markers and advanced measurement settings. These examples illustrate how to handle: A simple circle. In this case, a circle is found with default settings. A circle with two possible outer edges (circles). In this case, only the outermost circle must be measured. To achieve proper results, MmeasSetMarker() with M_MAX_ASSOCIATION_DISTANCE (restricts edges) was used. A circle that is both incomplete and textured (can detect many edges). In this case, only the main circle must be measured. To achieve proper results, MmeasSetMarker() with M_EDGEVALUE_MIN was set above the default (reduces noise) and M_MAX_ASSOCIATION_DISTANCE was given a value (restricts edges). Concentric circles. In this case, only the inner-most circle must be measured. To achieve proper results, MmeasSetMarker() with M_MAX_ASSOCIATION_DISTANCE (restricts edges) was used. Also, the strength score characteristic was removed and a radius score characteristic was set, using MmeasSetScore() with M_STRENGTH_SCORE and M_RADIUS_SCORE (locates smallest circle). To run these examples, use the Matrox Example Launcher in the MIL Control Center. Measurement examples Circle markers and advanced settings ",
      "wordCount": 238,
      "subEntries": []
    }
  ]
}]