[{
  "id": "UG_using",
  "version": "2024020714",
  "title": "Using MIL under Linux",
  "subTitles": null,
  "location": "MIL UG P10: Other programming languages, APIs, and operating systems",
  "pageURL": "content\\UserGuide\\using\\ChapterInformation.htm",
  "text": " Chapter 61: Using MIL under Linux This chapter describes unique characteristics of using MIL while running the Linux operating system. Working with Linux Annotating the display (overlay) with Cairo Cairo library package requirements Annotating the display (overlay) with Linux examples Creating an interactive redistribution using Linux Silent redistribution under Linux ",
  "wordCount": 52,
  "subEntries": [
    {
      "id": "UG_using_Working_with_Linux",
      "version": null,
      "title": "Working with Linux",
      "subTitles": [
        "Annotating the display (overlay) with Cairo",
        "Cairo library package requirements",
        "Annotating the display (overlay) with Linux examples"
      ],
      "location": "MIL UG P10: Other programming languages, APIs, and operating systems",
      "pageURL": "content\\UserGuide\\using\\Working_with_Linux.htm",
      "text": " Working with Linux Besides the computer requirements discussed in the Requirements to run MIL section of Chapter 1: Introduction, there are a few limitations when running MIL under Linux. Note the following limitations due to the Linux operating system: Buffers cannot be allocated in display (video) memory. Linux offers limited control over window attributes, such as window resizing and overlapping. The device-independent bitmap (DIB) storage format is not supported. Intellicam is not supported. The graphical user interfaces (GUIs) for the processing and analysis modules are not supported. The functionality of the MIL Sequences module is not supported. Annotating the display (overlay) with Cairo Cairo is required when annotating the display (overlay) with MIL under Linux. To draw native Linux annotations in the buffer selected to the display, or the display's overlay buffer, allocate a Cairo surface for either the image buffer or the overlay buffer of the display using MbufControl() with M_SURFACE_ALLOC; then, inquire its identifier using MbufInquire() with M_SURFACE_HANDLE. Once you have finished painting your annotations on the Cairo surface, free the surface using MbufControl() with M_SURFACE_FREE. Cairo library package requirements When annotating the display (overlay) in a Linux application, the following Cairo development package must be installed: Red Hat Enterprise Linux (64-bit): cairo-devel. SUSE Linux Enterprise (64-bit): cairo-devel. Ubuntu LTS (64-bit): libcairo2-dev. Annotating the display (overlay) with Linux examples The following examples demonstrate how to add annotations to a MIL user selected window using the MIL's Overlay mechanism. The example MdispQtview.cpp demonstrates how to annotate the display in a Qt project. It integrates Qt menus and functionality with MIL displays, buffers, timers, and a digitizer. mdispqtview.cpp Note that painting on this widget (using PaintEvent with Qt) without using the MIL Overlay is not reliable or safe. The example MdispGtkview.cpp demonstrates how to annotate the display in a GTK project. mdispgtkview.cpp Note that painting on this widget (using the Expose event with GTK) without using the MIL Overlay is not reliable or safe. Working with Linux Annotating the display (overlay) with Cairo Cairo library package requirements Annotating the display (overlay) with Linux examples ",
      "wordCount": 346,
      "subEntries": []
    },
    {
      "id": "UG_using_Creating_interactive_redistribution_using_Linux",
      "version": null,
      "title": "Creating an interactive redistribution using Linux",
      "subTitles": null,
      "location": "MIL UG P10: Other programming languages, APIs, and operating systems",
      "pageURL": "content\\UserGuide\\using\\Creating_interactive_redistribution_using_Linux.htm",
      "text": " Creating an interactive redistribution using Linux To redistribute the MIL or MIL-Lite DLLs and device drivers under Linux, you can have your application's setup program call MIL or MIL-Lite's redistribution setup program using the interactive redistribution mechanism. In this case, your customer will be prompted for information during the setup. There are two ways to implement this mechanism. To redistribute the MIL or MIL-Lite DLLs and device drivers and use the default installation options, perform the following: Copy the MIL_X.X-YYYY_Installer.run file from the MIL or MIL-Lite installation media to your installation directory, where X.X is the version number and YYYY is the build number. The MIL_X.X-YYYY_Installer.run file is a packed file that includes all MIL files to install. Have your redistribution program call the MIL_X.X-YYYY_Installer.run file, located in your installation directory. The MIL_X.X-YYYY_Installer.run program will prompt your customer to choose which features to install. The very first question asked is \"Do you want to install the development components?\". If your client is installing MIL from your application's installation program, they should answer no to this question. To limit the content of the MIL or MIL-lite installation media to include in your application's installation directory and restrict the installer options, you must generate a new MIL_X.X-YYYY_Installer.run file that only includes the required components. To do so, perform the following: Launch the MIL_X.X-YYYY_Installer.run program, located on your MIL or MIL-Lite installation media, with the -- --redist option. MIL_X.X-YYYY_Installer.run -- --redist The Matrox Imaging Library Redistribution dialog box is presented. Specify the location of the MIL_X.X-YYYY_Installer.run file to copy to your installation directory. To do so, click on the Browse button next to the Source edit field. From the presented Open dialog box, select the MIL_X.X-YYYY_Installer.run file located in the root of your MIL or MIL-Lite installation media, and then click on the Open button. Specify the location of where to write your newly generated MIL_X.X-YYYY_Installer.run file. To do so, click on the Browse button next to the Destination edit field. From the presented Choose folder dialog box, select your destination directory, and then click on the Select button. Select the Linux distribution, and the Matrox imaging boards that you want to make available to your customer during installation. Note that if your customer is not using a hardware license-key or a hardware ID key, you can deselect the Wibu (Hardware Key) option to avoid copying the Wibu driver to your installation directory. Click on the Generate button to begin building the new MIL_X.X-YYYY_Installer.run file in your destination directory. Have your redistribution program call the newly generated MIL_X.X-YYYY_Installer.run file, located in the specified destination directory. The MIL_X.X-YYYY_Installer.run program will prompt your customer to choose which features to install from the features that you have made available. In Linux, MIL drivers are compiled during the installation process. If you are generating a redistribution file for a deployment that includes Matrox imaging boards, you must ensure that the driver compilation environment exists on the client computer. Creating an interactive redistribution using Linux ",
      "wordCount": 499,
      "subEntries": []
    },
    {
      "id": "UG_using_Silent_redistribution_in_Linux",
      "version": null,
      "title": "Silent redistribution under Linux",
      "subTitles": null,
      "location": "MIL UG P10: Other programming languages, APIs, and operating systems",
      "pageURL": "content\\UserGuide\\using\\Silent_redistribution_in_Linux.htm",
      "text": " Silent redistribution under Linux A silent redistribution does not prompt your user for any MIL or MIL-Lite information; instead, it uses a configuration file to provide the necessary setup parameters for the intended computer. You would use a silent redistribution when you are including MIL or MIL-Lite within your application and you do not want to have any Matrox Imaging setup questions appear at the command prompt. You could also use a silent redistribution if you wanted to control the setup parameters for your client. It is not possible to create a configuration file for only a few of the setup parameters and ask the customer for the rest of the setup information. If you are going to use a configuration file, you must provide answers to all of the setup questions. To redistribute the MIL or MIL-Lite DLLs and device drivers using a silent redistribution: Copy the mil-10_XXXX-installer.run file from the MIL or MIL-Lite installation media to an empty working directory on a temporary computer. Note that your working directory should be on a computer that does not have MIL installed. The mil-10_XXXX-installer.run file is a packed file that includes all MIL files to install. Optionally, to reduce the number of MIL components (files) that will be installed on your customer's computer, remove the unnecessary files in the mil-10_XXXX-installer.run file as described in the Creating an interactive redistribution using Linux section earlier in this chapter. Record in the configuration file the setup options that should be used when MIL is installed on your customer's computer. To record your setup options, you will need to install MIL on your temporary computer with the required options. To install MIL and record the choices made during the installation, execute: mil-10_XXXX-installer.run -- --recordfile=/home/MIL10/mil-install-recording.ini where /home/MIL10/mil-install-recording.ini can be any absolute path to a configuration file that will record all the options you will select during the installation process. Note that if you do not specify a path with the --recordfile parameter, your Linux /var/tmp directory is used by default. The mil-10_XXXX-installer.run file will unpack and then begin installing MIL. If MIL is already installed, an error message appears asking you to first uninstall MIL. The MIL installation program poses a series of questions via a command prompt. You can select which MIL setup options will be used during the installation of MIL on your customer's computer. Once all selections are made, MIL is installed. Note that MIL is installed in a predetermined directory. Copy the configuration file along with the mil-10_XXXX-installer.run file to the location from which you are building your installation media or package. Have your installation program call the MIL installer as follows: mil-10_XXXX-installer.run -– --play=mil-install-recording.ini The MIL installer will silently install MIL or MIL-Lite with the options that you selected during the recording phase and stored in the mil-install-recording.ini file. When running the installation program with a configuration file (mil-install-recording.ini), you must use the same version of the MIL installer file (mil-10_XXXX-installer.run) as the one used to generate the configuration file; otherwise, an error will occur. Silent redistribution under Linux ",
      "wordCount": 511,
      "subEntries": []
    }
  ]
}]