[{
  "id": "UG_Using_the_3D_Geometry_module",
  "version": "2024020714",
  "title": "Using the 3D Geometry module",
  "subTitles": null,
  "location": "MIL UG P06: 3D related information",
  "pageURL": "content\\UserGuide\\Using_the_3D_Geometry_module\\ChapterInformation.htm",
  "text": " Chapter 44: Using the 3D Geometry module This chapter describes how to use the 3D geometry module to create 3D geometry objects or transformation matrix objects. 3D Geometry module overview Defining 3D geometries Steps to defining and using a 3D geometry object 3D geometry objects Finding missing coordinates for a 3D line, plane, or sphere Defining an oriented plane using a transformation matrix Constructing 3D geometries from existing geometries Constructing a box Constructing a cylinder Constructing a line Constructing a plane Constructing a point Constructing a sphere Constructing 3D geometries example Defining transformation matrix objects ",
  "wordCount": 97,
  "subEntries": [
    {
      "id": "UG_Using_the_3D_Geometry_module_3D_geometry_module_overview",
      "version": null,
      "title": "3D Geometry module overview",
      "subTitles": null,
      "location": "MIL UG P06: 3D related information",
      "pageURL": "content\\UserGuide\\Using_the_3D_Geometry_module\\3D_geometry_module_overview.htm",
      "text": " 3D Geometry module overview The 3D Geometry module allows you to create 3D geometry objects or transformation matrix objects. 3D geometry objects can be used to limit or define the processing region when dealing with point clouds or depth maps. For example, you can use 3D geometries to crop a point cloud or perform an arithmetic operation on a depth map. You can also use a 3D geometry object to perform comparative measurements with a point cloud or depth map. For example, you can fit a 3D geometry to a point cloud or depth map and calculate distances between points and the fitted surface. The 3D Geometry module allows you to define a geometry object with one of the supported 3D shapes: box, cylinder, line, plane, or sphere. Using the 3D Image Processing module, you can translate, scale, or transform the resulting geometries. Functions that can use a 3D geometry object, take it as a parameter. Transformation matrix objects store matrices that define a required 3D transformation. You can generate the required transformation coefficients using M3dgeoMatrixSetWithAxes(), or M3dgeoMatrixSetTransform() with a transformation to perform (for example, M_TRANSLATION). Alternatively, you can copy a resulting matrix from other MIL 3D modules (for example, the 3D Metrology and the 3D Registration modules) into the transformation matrix object. You can then apply the transformation matrix to a point cloud or a 3D geometry object, using M3dimMatrixTransform(). For information on using transformation matrix objects, see the Moving or scaling a point cloud or 3D geometry section of Chapter 35: 3D image processing. 3D Geometry module overview ",
      "wordCount": 262,
      "subEntries": []
    },
    {
      "id": "UG_Using_the_3D_Geometry_module_Defining_3D_geometries",
      "version": null,
      "title": "Defining 3D geometries",
      "subTitles": [
        "Steps to defining and using a 3D geometry object",
        "3D geometry objects",
        "Finding missing coordinates for a 3D line, plane, or sphere",
        "Defining an oriented plane using a transformation matrix"
      ],
      "location": "MIL UG P06: 3D related information",
      "pageURL": "content\\UserGuide\\Using_the_3D_Geometry_module\\Defining_3D_geometries.htm",
      "text": " Defining 3D geometries 3D geometry objects must be allocated and defined before using them as a source in other 3D modules. Steps to defining and using a 3D geometry object The following steps provide a basic methodology for defining 3D geometry objects. Allocate a 3D geometry object on the specified system, using M3dgeoAlloc() with M_GEOMETRY. Define the geometry of the object by calling one of the 3D geometry definition functions (for example, M3dgeoBox() or M3dgeoCylinder()); see the 3D geometry objects subsection of this section. You can also copy a geometry result into the 3D geometry object to define it (for example, M3dimCopyResult() with M_BOUNDING_BOX). If necessary, manipulate the defined geometry object using the 3D Image Processing module. You can translate, rotate, scale, or otherwise transform the geometry using M3dimTranslate(), M3dimRotate(), M3dimScale(), or M3dimMatrixTransform(), respectively. Pass the 3D geometry object to a function that can take one (for example, M3dmetDistance() or M3dimCrop()). Free the 3D geometry object, using M3dgeoFree(), unless M_UNIQUE_ID was specified during allocation. 3D geometry objects The following table lists all 3D geometries that you can define; it also indicates the M3dgeo...() functions that you can use to define them. Geometry name Example Geometry definition function Box M3dgeoBox() Cylinder M3dgeoCylinder() Line M3dgeoLine() Plane M3dgeoPlane() Point M3dgeoPoint() Sphere M3dgeoSphere() Finding missing coordinates for a 3D line, plane, or sphere You can use M3dgeoEvalCurve() or M3dgeoEvalSurface() to find missing coordinates for a 3D line, plane, or sphere, given an incomplete set of coordinates. For example, if you pass a 3D line geometry and a corresponding array of X-coordinates to M3dgeoEvalCurve(), the function can find the missing Y- and Z-coordinates that correspond to points on the curve (3D line). Similarly, you can pass a 3D plane or sphere to M3dgeoEvalSurface() with corresponding arrays of X- and Y- coordinates, and the function can find the missing Z-coordinates for points that lie on the surface of the 3D plane or sphere. These functions output the missing coordinates in a destination array or arrays, in either a packed or unpacked format. The following image shows an M3dgeoEvalSurface() operation for a sphere, with source coordinate pairs on the XZ-plane, and resulting point locations on the sphere's surface, for which the function has found the missing Y-coordinates. In this case, only the points corresponding to the largest calculated Y-coordinates are shown. You can use M3dgeoEvalSurface() to increase the density of a plane or sphere in a point cloud. For example, if you have a sphere that is too sparse, you can estimate its position and radius, and then use M3dgeoEvalSurface() to generate more points on the surface, resulting in a denser point cloud. Another use-case for these functions is when you need an incomplete point cloud version of a 3D line, plane, or sphere (for example, one that is occluded or contains holes). You can use M3dgeoEvalCurve() or M3dgeoEvalSurface() to construct the point cloud point by point. To create a point cloud of a 3D geometry that does not exist in your current point cloud, use M3dimSample(). Defining an oriented plane using a transformation matrix If you want to define a plane with finite dimensions or with two in-plane axes whose orientations are explicitly specified, the 3D plane geometry object is often not suitable. For example, when taking the profile of a point cloud, 3D geometry, or mesh using M3dimProfile(), you need to define a slicing plane with an explicitly specified origin and axes orientation along the plane. You might want to begin the profile at a specific location, or use a finite slicing plane, so your plane must be defined with an origin and a direction for the X-axis. Functions that require an oriented plane (for example, M3dimProfile()) take the definition of a new coordinate system instead. They use its XY-plane (Z=0) as the oriented plane. As input, they take a transformation matrix that defines the new coordinate system. To set up the matrix, use M3dgeoMatrixSetWithAxes() with M_COORDINATE_SYSTEM_TRANSFORMATION; specify the coordinates of the new coordinate system's origin and the components of two of its axes. The third axis will automatically be calculated such that it is perpendicular to the first two and respects the right hand rule. M3dgeoMatrixSetWithAxes() with M_COORDINATE_SYSTEM_TRANSFORMATION returns a transformation matrix that moves your new coordinate system to your current working coordinate system. If you want to take a profile, for example, M3dimProfile() will use the XY-plane of your new coordinate system as the slicing plane along which to extract points, and you can set a limit on the X-dimension, so that the slicing plane is finite. The image below shows how a function like M3dimProfile() uses the XY-plane (Z=0) of the new specified coordinate system; the function takes the XY-plane as the oriented plane. Defining 3D geometries Steps to defining and using a 3D geometry object 3D geometry objects Finding missing coordinates for a 3D line, plane, or sphere Defining an oriented plane using a transformation matrix ",
      "wordCount": 817,
      "subEntries": []
    },
    {
      "id": "UG_Using_the_3D_Geometry_module_Constructing_3D_geometries_from_existing_geometries",
      "version": null,
      "title": "Constructing 3D geometries from existing geometries",
      "subTitles": [
        "Constructing a box",
        "Constructing a cylinder",
        "Constructing a line",
        "Constructing a plane",
        "Constructing a point",
        "Constructing a sphere",
        "Constructing 3D geometries example"
      ],
      "location": "MIL UG P06: 3D related information",
      "pageURL": "content\\UserGuide\\Using_the_3D_Geometry_module\\Constructing_3D_geometries_from_existing_geometries.htm",
      "text": " Constructing 3D geometries from existing geometries You can use existing geometries as a starting point for building other 3D geometries. To do so, use M3dgeoConstruct(). Whether you have defined a source 3D geometry using a dedicated function, or obtained the geometry from other processing and analysis operations (for example, fitting a 3D geometry to a point cloud), M3dgeoConstruct() offers multiple operations for constructing new 3D geometries. For instance, you can construct: A point at the center of another geometry. A plane that passes through the face of a box or cylinder. A cylinder in which its central axis coincides with an existing line. Two points can form the basis for several new 3D geometries: a box from opposite corner points, a cylinder or line from start and end points, or a sphere from antipodal points. For an example scenario of using M3dgeoConstruct(), consider the following workflow, in which lines are constructed to join calculated points on an object: Obtain a point cloud (for example, grabbed from a 3D sensor). Fit 3D planes to the surfaces of an object in the point cloud (M3dmetFit()). Find intersection points of the planes (M3dmetFeatureEx()). Construct lines between the calculated points (M3dgeoConstruct()). You can construct 3D geometries that are useful markers for further processing and analysis. For example, you can construct a unit line that points in the same direction as a plane's normal vector. Conversely, you can construct a plane whose normal vector is aligned with a source line. You can use M3dgeoConstruct() with M_FLIP to interchange the start and end points of a line or cylinder. An M_FLIP operation can also invert a plane so that its normal vector points in the opposite direction. Constructing a box The following table lists the operation and related parameter settings required to construct an M_BOX geometry. Operation Src1 Src2 Param Result Example diagram M_BOTH_CORNERS Point Point — 1 box Constructing a cylinder The following table lists the possible operations and related parameter settings required to construct an M_CYLINDER geometry. Operation Src1 Src2 Param Result Example diagram M_AXIS Line — Radius &gt;= 0 1 cylinder M_FLIP Cylinder — — 1 cylinder M_TWO_POINTS Point Point Radius &gt;= 0 1 cylinder Constructing a line The following table lists the possible operations and related parameter settings required to construct an M_LINE geometry. Operation Src1 Src2 Param Result Example diagram M_AXIS Cylinder — Radius &gt;= 0 1 line M_EDGE Box — 0 &lt;= Value &lt;= 11 (to specify the edge) 1 line M_FLIP Line — — 1 line M_NORMAL Plane — — 1 line (1 unit in length) Point — 1 line (1 unit in length) M_TWO_POINTS Point Point — 1 line Constructing a plane The following table lists the possible operations and related parameter settings required to construct an M_PLANE geometry. Operation Src1 Src2 Param Result Example diagram M_FACE Box Cylinder — Box: 0 &lt;= Value &lt;= 5 (to specify the face) Finite cylinder: 0 or 1 (to specify the first (0) or second (1) circular base) Infinite cylinder: 0 (specifies the cylinder's start point) 1 plane M_FLIP Line — — 1 plane M_LINE_AND_POINT Line Point — 1 plane M_NORMAL Line — — 1 plane Point — 1 plane Constructing a point The following table lists the possible operations and related parameter settings required to construct an M_POINT geometry. Operation Src1 Src2 Param Result Example diagram M_CENTER Box Finite cylinder Finite line Point Sphere — — 1 point M_CLOSEST_TO_ORIGIN Plane — — 1 point M_CORNER Box — 0 &lt;= Value &lt;= 7 (to specify the corner) 1 point M_END_POINT Finite line Finite cylinder — — 1 point M_START_POINT Line Cylinder — — 1 point Constructing a sphere The following table lists the possible operations and related parameter settings required to construct an M_SPHERE geometry. Operation Src1 Src2 Param Result Example diagram M_CENTER_AND_RADIUS Point — Radius &gt;= 0 1 sphere M_DIAMETER Point Point — 1 sphere Constructing 3D geometries example The following example uses M3dgeoConstruct() to draw lines between points, as well as to flip planes to a required orientation. 3dmetrologyconstructions.cpp Constructing 3D geometries from existing geometries Constructing a box Constructing a cylinder Constructing a line Constructing a plane Constructing a point Constructing a sphere Constructing 3D geometries example ",
      "wordCount": 700,
      "subEntries": []
    },
    {
      "id": "UG_Using_the_3D_Geometry_module_Defining_transformation_matrix_objects",
      "version": null,
      "title": "Defining transformation matrix objects",
      "subTitles": null,
      "location": "MIL UG P06: 3D related information",
      "pageURL": "content\\UserGuide\\Using_the_3D_Geometry_module\\Defining_transformation_matrix_objects.htm",
      "text": " Defining transformation matrix objects As a consistent way of retrieving or specifying a 3D transformation, MIL uses a transformation matrix object to store the matrix that defines the transformation. Although you can, you typically don't need to explicitly specify the coefficients of the matrix. MIL 3D functions represent calculated 3D transformations as matrices and store them into specified transformation matrix objects (for example, M3dmodCopyResult() with M_FIXTURING_MATRIX). In addition, there are MIL functions that allow you to specify the required 3D transformation, and they calculate and return the corresponding matrix into the specified transformation matrix object. You can then use it to specify the required 3D transformation to functions that take a transformation matrix object (for example, M3dgraText()). You can also use it to apply the transformation to a point cloud or 3D geometry, using M3dimMatrixTransform(); this allows you to displace, rotate, or scale coordinates, or allows you to fixture the point cloud or 3D geometry to a required position or orientation. Note that you can apply simple 3D transformations directly to a 3D geometry or point cloud, without a transformation matrix object, using M3dimTranslate(), M3dimRotate(), and M3dimScale(). For more information about the different types of 3D transformations and a more detailed explanation about using transformation matrices to fixture or transform points, see the Moving or scaling a point cloud or 3D geometry section of Chapter 35: 3D image processing. Defining transformation matrix objects ",
      "wordCount": 235,
      "subEntries": []
    }
  ]
}]